NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* STATE @Bit 16 : PLL state (Running between START task and STOPPED event) */
  #define CLOCK_PLL24M_STAT_STATE_Pos (16UL)         /*!< Position of STATE field.                                             */
  #define CLOCK_PLL24M_STAT_STATE_Msk (0x1UL << CLOCK_PLL24M_STAT_STATE_Pos) /*!< Bit mask of STATE field.                     */
  #define CLOCK_PLL24M_STAT_STATE_Min (0x0UL)        /*!< Min enumerator value of STATE field.                                 */
  #define CLOCK_PLL24M_STAT_STATE_Max (0x1UL)        /*!< Max enumerator value of STATE field.                                 */
  #define CLOCK_PLL24M_STAT_STATE_NotRunning (0x0UL) /*!< PLL24M is not running                                                */
  #define CLOCK_PLL24M_STAT_STATE_Running (0x1UL)    /*!< PLL24M is running                                                    */


/* ====================================================== Struct CLOCK ======================================================= */
/**
  * @brief Clock management
  */
  typedef struct {                                   /*!< CLOCK Structure                                                      */
    __OM uint32_t TASKS_XOSTART;                     /*!< (@ 0x00000000) Start crystal oscillator (HFXO)                       */
    __OM uint32_t TASKS_XOSTOP;                      /*!< (@ 0x00000004) Stop crystal oscillator (HFXO)                        */
    __OM uint32_t TASKS_PLLSTART;                    /*!< (@ 0x00000008) Start PLL and keep it running, regardless of the
                                                                         automatic clock requests*/
    __OM uint32_t TASKS_PLLSTOP;                     /*!< (@ 0x0000000C) Stop PLL                                              */
    __OM uint32_t TASKS_LFCLKSTART;                  /*!< (@ 0x00000010) Start LFCLK source as selected in LFCLK.SRC           */
    __OM uint32_t TASKS_LFCLKSTOP;                   /*!< (@ 0x00000014) Stop LFCLK source                                     */
    __OM uint32_t TASKS_CAL;                         /*!< (@ 0x00000018) Start calibration of LFRC oscillator                  */
    __OM uint32_t TASKS_XOTUNE;                      /*!< (@ 0x0000001C) Request tuning for HFXO                               */
    __OM uint32_t TASKS_XOTUNEABORT;                 /*!< (@ 0x00000020) Abort tuning for HFXO                                 */
    __OM uint32_t TASKS_XO24MSTART;                  /*!< (@ 0x00000024) Request HFXO to provide a crystal clock for PCLK24M   */
    __OM uint32_t TASKS_XO24MSTOP;                   /*!< (@ 0x00000028) Stop request HFXO for PCLK24M. When all requests for
                                                                         HFXO are stopped, HFXO will also stop.*/
    __IM uint32_t RESERVED[21];
    __IOM uint32_t SUBSCRIBE_XOSTART;                /*!< (@ 0x00000080) Subscribe configuration for task XOSTART              */
    __IOM uint32_t SUBSCRIBE_XOSTOP;                 /*!< (@ 0x00000084) Subscribe configuration for task XOSTOP               */
    __IOM uint32_t SUBSCRIBE_PLLSTART;               /*!< (@ 0x00000088) Subscribe configuration for task PLLSTART             */
    __IOM uint32_t SUBSCRIBE_PLLSTOP;                /*!< (@ 0x0000008C) Subscribe configuration for task PLLSTOP              */
    __IOM uint32_t SUBSCRIBE_LFCLKSTART;             /*!< (@ 0x00000090) Subscribe configuration for task LFCLKSTART           */
    __IOM uint32_t SUBSCRIBE_LFCLKSTOP;              /*!< (@ 0x00000094) Subscribe configuration for task LFCLKSTOP            */
    __IOM uint32_t SUBSCRIBE_CAL;                    /*!< (@ 0x00000098) Subscribe configuration for task CAL                  */
    __IOM uint32_t SUBSCRIBE_XOTUNE;                 /*!< (@ 0x0000009C) Subscribe configuration for task XOTUNE               */
    __IOM uint32_t SUBSCRIBE_XOTUNEABORT;            /*!< (@ 0x000000A0) Subscribe configuration for task XOTUNEABORT          */
    __IOM uint32_t SUBSCRIBE_XO24MSTART;             /*!< (@ 0x000000A4) Subscribe configuration for task XO24MSTART           */
    __IOM uint32_t SUBSCRIBE_XO24MSTOP;              /*!< (@ 0x000000A8) Subscribe configuration for task XO24MSTOP            */
    __IM uint32_t RESERVED1[21];
    __IOM uint32_t EVENTS_XOSTARTED;                 /*!< (@ 0x00000100) Crystal oscillator has started                        */
    __IOM uint32_t EVENTS_PLLSTARTED;                /*!< (@ 0x00000104) PLL started                                           */
    __IOM uint32_t EVENTS_LFCLKSTARTED;              /*!< (@ 0x00000108) LFCLK source started                                  */
    __IOM uint32_t EVENTS_DONE;                      /*!< (@ 0x0000010C) Calibration of LFRC oscillator complete event         */
    __IOM uint32_t EVENTS_XOTUNED;                   /*!< (@ 0x00000110) HFXO tuning is done. XOTUNED is generated after
                                                                         TASKS_XOSTART or after TASKS_XOTUNE has completed*/
    __IOM uint32_t EVENTS_XOTUNEERROR;               /*!< (@ 0x00000114) HFXO quality issue detected, XOTUNE is needed         */
    __IOM uint32_t EVENTS_XOTUNEFAILED;              /*!< (@ 0x00000118) HFXO tuning could not be completed                    */
    __IOM uint32_t EVENTS_XO24MSTARTED;              /*!< (@ 0x0000011C) XO24M started                                         */
    __IM uint32_t RESERVED2[24];
    __IOM uint32_t PUBLISH_XOSTARTED;                /*!< (@ 0x00000180) Publish configuration for event XOSTARTED             */
    __IOM uint32_t PUBLISH_PLLSTARTED;               /*!< (@ 0x00000184) Publish configuration for event PLLSTARTED            */
    __IOM uint32_t PUBLISH_LFCLKSTARTED;             /*!< (@ 0x00000188) Publish configuration for event LFCLKSTARTED          */
    __IOM uint32_t PUBLISH_DONE;                     /*!< (@ 0x0000018C) Publish configuration for event DONE                  */
    __IOM uint32_t PUBLISH_XOTUNED;                  /*!< (@ 0x00000190) Publish configuration for event XOTUNED               */
    __IOM uint32_t PUBLISH_XOTUNEERROR;              /*!< (@ 0x00000194) Publish configuration for event XOTUNEERROR           */
    __IOM uint32_t PUBLISH_XOTUNEFAILED;             /*!< (@ 0x00000198) Publish configuration for event XOTUNEFAILED          */
    __IOM uint32_t PUBLISH_XO24MSTARTED;             /*!< (@ 0x0000019C) Publish configuration for event XO24MSTARTED          */
    __IM uint32_t RESERVED3[88];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED4[60];
    __IOM NRF_CLOCK_XO_Type XO;                      /*!< (@ 0x00000400) (unspecified)                                         */
    __IM uint32_t RESERVED5[4];
    __IOM NRF_CLOCK_PLL_Type PLL;                    /*!< (@ 0x00000420) (unspecified)                                         */
    __IM uint32_t RESERVED6[4];
    __IOM NRF_CLOCK_LFCLK_Type LFCLK;                /*!< (@ 0x00000440) (unspecified)                                         */
    __IM uint32_t RESERVED7[3];
    __IOM NRF_CLOCK_PLL24M_Type PLL24M;              /*!< (@ 0x00000460) (unspecified)                                         */
  } NRF_CLOCK_Type;                                  /*!< Size = 1136 (0x470)                                                  */

/* CLOCK_TASKS_XOSTART: Start crystal oscillator (HFXO) */
  #define CLOCK_TASKS_XOSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_XOSTART register.                            */

