NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event XOTUNED will publish to */
  #define CLOCK_PUBLISH_XOTUNED_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XOTUNED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XOTUNED_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define CLOCK_PUBLISH_XOTUNED_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define CLOCK_PUBLISH_XOTUNED_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XOTUNED_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XOTUNED_EN_Msk (0x1UL << CLOCK_PUBLISH_XOTUNED_EN_Pos) /*!< Bit mask of EN field.                      */
  #define CLOCK_PUBLISH_XOTUNED_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNED_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNED_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define CLOCK_PUBLISH_XOTUNED_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* CLOCK_PUBLISH_XOTUNEERROR: Publish configuration for event XOTUNEERROR */
  #define CLOCK_PUBLISH_XOTUNEERROR_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XOTUNEERROR register.                */

/* CHIDX @Bits 0..7 : DPPI channel that event XOTUNEERROR will publish to */
  #define CLOCK_PUBLISH_XOTUNEERROR_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XOTUNEERROR_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XOTUNEERROR_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define CLOCK_PUBLISH_XOTUNEERROR_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define CLOCK_PUBLISH_XOTUNEERROR_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Msk (0x1UL << CLOCK_PUBLISH_XOTUNEERROR_EN_Pos) /*!< Bit mask of EN field.              */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Disabled (0x0UL) /*!< Disable publishing                                                */
  #define CLOCK_PUBLISH_XOTUNEERROR_EN_Enabled (0x1UL) /*!< Enable publishing                                                  */


/* CLOCK_PUBLISH_XOTUNEFAILED: Publish configuration for event XOTUNEFAILED */
  #define CLOCK_PUBLISH_XOTUNEFAILED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XOTUNEFAILED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event XOTUNEFAILED will publish to */
  #define CLOCK_PUBLISH_XOTUNEFAILED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XOTUNEFAILED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XOTUNEFAILED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_PUBLISH_XOTUNEFAILED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_PUBLISH_XOTUNEFAILED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Msk (0x1UL << CLOCK_PUBLISH_XOTUNEFAILED_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define CLOCK_PUBLISH_XOTUNEFAILED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* CLOCK_PUBLISH_XO24MSTARTED: Publish configuration for event XO24MSTARTED */
  #define CLOCK_PUBLISH_XO24MSTARTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_XO24MSTARTED register.              */

/* CHIDX @Bits 0..7 : DPPI channel that event XO24MSTARTED will publish to */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                             */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Msk (0xFFUL << CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.  */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                         */
  #define CLOCK_PUBLISH_XO24MSTARTED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                          */

/* EN @Bit 31 : (unspecified) */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Pos (31UL)   /*!< Position of EN field.                                                */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Msk (0x1UL << CLOCK_PUBLISH_XO24MSTARTED_EN_Pos) /*!< Bit mask of EN field.            */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Min (0x0UL)  /*!< Min enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Max (0x1UL)  /*!< Max enumerator value of EN field.                                    */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Disabled (0x0UL) /*!< Disable publishing                                               */
  #define CLOCK_PUBLISH_XO24MSTARTED_EN_Enabled (0x1UL) /*!< Enable publishing                                                 */


/* CLOCK_INTEN: Enable or disable interrupt */
  #define CLOCK_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

