NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* ENABLE0 @Bit 0 : Enable the lock for SEED[0] */
  #define CRACEN_SEEDLOCK_ENABLE0_Pos (0UL)          /*!< Position of ENABLE0 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE0_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE0_Min (0x0UL)        /*!< Min enumerator value of ENABLE0 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE0_Max (0x1UL)        /*!< Max enumerator value of ENABLE0 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE0_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE0_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE1 @Bit 1 : Enable the lock for SEED[1] */
  #define CRACEN_SEEDLOCK_ENABLE1_Pos (1UL)          /*!< Position of ENABLE1 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE1_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE1_Min (0x0UL)        /*!< Min enumerator value of ENABLE1 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE1_Max (0x1UL)        /*!< Max enumerator value of ENABLE1 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE1_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE1_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE2 @Bit 2 : Enable the lock for SEED[2] */
  #define CRACEN_SEEDLOCK_ENABLE2_Pos (2UL)          /*!< Position of ENABLE2 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE2_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE2_Min (0x0UL)        /*!< Min enumerator value of ENABLE2 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE2_Max (0x1UL)        /*!< Max enumerator value of ENABLE2 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE2_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE2_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE3 @Bit 3 : Enable the lock for SEED[3] */
  #define CRACEN_SEEDLOCK_ENABLE3_Pos (3UL)          /*!< Position of ENABLE3 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE3_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE3_Pos) /*!< Bit mask of ENABLE3 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE3_Min (0x0UL)        /*!< Min enumerator value of ENABLE3 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE3_Max (0x1UL)        /*!< Max enumerator value of ENABLE3 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE3_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE3_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE4 @Bit 4 : Enable the lock for SEED[4] */
  #define CRACEN_SEEDLOCK_ENABLE4_Pos (4UL)          /*!< Position of ENABLE4 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE4_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE4_Pos) /*!< Bit mask of ENABLE4 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE4_Min (0x0UL)        /*!< Min enumerator value of ENABLE4 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE4_Max (0x1UL)        /*!< Max enumerator value of ENABLE4 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE4_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE4_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE5 @Bit 5 : Enable the lock for SEED[5] */
  #define CRACEN_SEEDLOCK_ENABLE5_Pos (5UL)          /*!< Position of ENABLE5 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE5_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE5_Pos) /*!< Bit mask of ENABLE5 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE5_Min (0x0UL)        /*!< Min enumerator value of ENABLE5 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE5_Max (0x1UL)        /*!< Max enumerator value of ENABLE5 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE5_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE5_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE6 @Bit 6 : Enable the lock for SEED[6] */
  #define CRACEN_SEEDLOCK_ENABLE6_Pos (6UL)          /*!< Position of ENABLE6 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE6_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE6_Pos) /*!< Bit mask of ENABLE6 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE6_Min (0x0UL)        /*!< Min enumerator value of ENABLE6 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE6_Max (0x1UL)        /*!< Max enumerator value of ENABLE6 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE6_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE6_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

/* ENABLE7 @Bit 7 : Enable the lock for SEED[7] */
  #define CRACEN_SEEDLOCK_ENABLE7_Pos (7UL)          /*!< Position of ENABLE7 field.                                           */
  #define CRACEN_SEEDLOCK_ENABLE7_Msk (0x1UL << CRACEN_SEEDLOCK_ENABLE7_Pos) /*!< Bit mask of ENABLE7 field.                   */
  #define CRACEN_SEEDLOCK_ENABLE7_Min (0x0UL)        /*!< Min enumerator value of ENABLE7 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE7_Max (0x1UL)        /*!< Max enumerator value of ENABLE7 field.                               */
  #define CRACEN_SEEDLOCK_ENABLE7_Disabled (0x0UL)   /*!< Lock disabled.                                                       */
  #define CRACEN_SEEDLOCK_ENABLE7_Enabled (0x1UL)    /*!< Lock enabled.                                                        */

