NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CRACENCORE_CRYPTMSTRDMA_START: Start */
  #define CRACENCORE_CRYPTMSTRDMA_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                          */

/* STARTFETCH @Bit 0 : Writing a '1' starts the fetcher DMA. Writing a '0' has no effect. */
  #define CRACENCORE_CRYPTMSTRDMA_START_STARTFETCH_Pos (0UL) /*!< Position of STARTFETCH field.                                */
  #define CRACENCORE_CRYPTMSTRDMA_START_STARTFETCH_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_START_STARTFETCH_Pos) /*!< Bit mask of
                                                                            STARTFETCH field.*/

/* STARTPUSH @Bit 1 : Writing a '1' starts the pusher DMA. Writing a '0' has no effect. */
  #define CRACENCORE_CRYPTMSTRDMA_START_STARTPUSH_Pos (1UL) /*!< Position of STARTPUSH field.                                  */
  #define CRACENCORE_CRYPTMSTRDMA_START_STARTPUSH_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_START_STARTPUSH_Pos) /*!< Bit mask of
                                                                            STARTPUSH field.*/


/* CRACENCORE_CRYPTMSTRDMA_STATUS: Status */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                        */

/* FETCHBUSY @Bit 0 : This bit is high as long as the fetcher DMA is busy. */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Pos (0UL) /*!< Position of FETCHBUSY field.                                 */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHBUSY_Pos) /*!< Bit mask of
                                                                            FETCHBUSY field.*/

/* PUSHBUSY @Bit 1 : This bit is high as long as the pusher DMA is busy. */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Pos (1UL) /*!< Position of PUSHBUSY field.                                   */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHBUSY_Pos) /*!< Bit mask of
                                                                            PUSHBUSY field.*/

/* FETCHNOTEMPTY @Bit 4 : Not empty flag for fetcher DMA input FIFO */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Pos (4UL) /*!< Position of FETCHNOTEMPTY field.                         */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_STATUS_FETCHNOTEMPTY_Pos) /*!< Bit
                                                                            mask of FETCHNOTEMPTY field.*/

/* PUSHWAITINGFIFO @Bit 5 : Pusher DMA Waiting FIFO. This bit is high when the pusher is waiting for more data in output FIFO. */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Pos (5UL) /*!< Position of PUSHWAITINGFIFO field.                     */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHWAITINGFIFO_Pos) /*!<
                                                                            Bit mask of PUSHWAITINGFIFO field.*/

/* SOFTRSTBUSY @Bit 6 : This bit is high when the soft reset is on going */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Pos (6UL) /*!< Position of SOFTRSTBUSY field.                             */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Msk (0x1UL << CRACENCORE_CRYPTMSTRDMA_STATUS_SOFTRSTBUSY_Pos) /*!< Bit mask
                                                                            of SOFTRSTBUSY field.*/

/* PUSHNBDATA @Bits 16..31 : Amount of data in the pusher DMA output FIFO */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Pos (16UL) /*!< Position of PUSHNBDATA field.                              */
  #define CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Msk (0xFFFFUL << CRACENCORE_CRYPTMSTRDMA_STATUS_PUSHNBDATA_Pos) /*!< Bit
                                                                            mask of PUSHNBDATA field.*/



/* ============================================== Struct CRACENCORE_CRYPTMSTRHW ============================================== */
/**
  * @brief CRYPTMSTRHW [CRACENCORE_CRYPTMSTRHW] (unspecified)
  */
typedef struct {
  __IOM uint32_t  INCLIPSHWCFG;                      /*!< (@ 0x00000000) Incuded IPs Hardware configuration                    */
  __IOM uint32_t  BA411EAESHWCFG1;                   /*!< (@ 0x00000004) Generic g_AesModesPoss value.                         */
  __IOM uint32_t  BA411EAESHWCFG2;                   /*!< (@ 0x00000008) Generic g_CtrSize value.                              */
  __IOM uint32_t  BA413HASHHWCFG;                    /*!< (@ 0x0000000C) Generic g_Hash value                                  */
  __IOM uint32_t  BA418SHA3HWCFG;                    /*!< (@ 0x00000010) Generic g_Sha3CtxtEn value.                           */
  __IOM uint32_t  BA419SM4HWCFG;                     /*!< (@ 0x00000014) Generic g_SM4ModesPoss value.                         */
  __IOM uint32_t  BA424ARIAHWCFG;                    /*!< (@ 0x00000018) Generic g_aria_modePoss value.                        */
} NRF_CRACENCORE_CRYPTMSTRHW_Type;                   /*!< Size = 28 (0x01C)                                                    */

/* CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG: Incuded IPs Hardware configuration */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_ResetValue (0x00000671UL) /*!< Reset value of INCLIPSHWCFG register.             */

/* BA411AESINCLUDED @Bit 0 : Generic g_IncludeAES value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Pos (0UL) /*!< Position of BA411AESINCLUDED field.              */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA411AESINCLUDED_Pos)
                                                                            /*!< Bit mask of BA411AESINCLUDED field.*/

/* BA415HPAESGCMINCLUDED @Bit 1 : Generic g_IncludeAESGCM value. */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Pos (1UL) /*!< Position of BA415HPAESGCMINCLUDED field.    */
  #define CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_INCLIPSHWCFG_BA415HPAESGCMINCLUDED_Pos)
                                                                            /*!< Bit mask of BA415HPAESGCMINCLUDED field.*/

