NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CH18 @Bit 18 : Channel 18 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH18_Pos (18UL)              /*!< Position of CH18 field.                                              */
  #define DPPIC_CHENCLR_CH18_Msk (0x1UL << DPPIC_CHENCLR_CH18_Pos) /*!< Bit mask of CH18 field.                                */
  #define DPPIC_CHENCLR_CH18_Min (0x0UL)             /*!< Min enumerator value of CH18 field.                                  */
  #define DPPIC_CHENCLR_CH18_Max (0x1UL)             /*!< Max enumerator value of CH18 field.                                  */
  #define DPPIC_CHENCLR_CH18_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH18_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH18_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH19 @Bit 19 : Channel 19 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH19_Pos (19UL)              /*!< Position of CH19 field.                                              */
  #define DPPIC_CHENCLR_CH19_Msk (0x1UL << DPPIC_CHENCLR_CH19_Pos) /*!< Bit mask of CH19 field.                                */
  #define DPPIC_CHENCLR_CH19_Min (0x0UL)             /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHENCLR_CH19_Max (0x1UL)             /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHENCLR_CH19_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH19_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH19_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH20 @Bit 20 : Channel 20 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH20_Pos (20UL)              /*!< Position of CH20 field.                                              */
  #define DPPIC_CHENCLR_CH20_Msk (0x1UL << DPPIC_CHENCLR_CH20_Pos) /*!< Bit mask of CH20 field.                                */
  #define DPPIC_CHENCLR_CH20_Min (0x0UL)             /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHENCLR_CH20_Max (0x1UL)             /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHENCLR_CH20_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH20_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH20_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH21 @Bit 21 : Channel 21 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH21_Pos (21UL)              /*!< Position of CH21 field.                                              */
  #define DPPIC_CHENCLR_CH21_Msk (0x1UL << DPPIC_CHENCLR_CH21_Pos) /*!< Bit mask of CH21 field.                                */
  #define DPPIC_CHENCLR_CH21_Min (0x0UL)             /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHENCLR_CH21_Max (0x1UL)             /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHENCLR_CH21_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH21_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH21_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH22 @Bit 22 : Channel 22 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH22_Pos (22UL)              /*!< Position of CH22 field.                                              */
  #define DPPIC_CHENCLR_CH22_Msk (0x1UL << DPPIC_CHENCLR_CH22_Pos) /*!< Bit mask of CH22 field.                                */
  #define DPPIC_CHENCLR_CH22_Min (0x0UL)             /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHENCLR_CH22_Max (0x1UL)             /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHENCLR_CH22_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH22_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH22_Clear (0x1UL)           /*!< Write: Disable channel                                               */

/* CH23 @Bit 23 : Channel 23 enable clear register. Writing 0 has no effect. */
  #define DPPIC_CHENCLR_CH23_Pos (23UL)              /*!< Position of CH23 field.                                              */
  #define DPPIC_CHENCLR_CH23_Msk (0x1UL << DPPIC_CHENCLR_CH23_Pos) /*!< Bit mask of CH23 field.                                */
  #define DPPIC_CHENCLR_CH23_Min (0x0UL)             /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHENCLR_CH23_Max (0x1UL)             /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHENCLR_CH23_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENCLR_CH23_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENCLR_CH23_Clear (0x1UL)           /*!< Write: Disable channel                                               */


/* DPPIC_CHG: Channel group n Note: Writes to this register are ignored if either SUBSCRIBE_CHG[n].EN or SUBSCRIBE_CHG[n].DIS is
               enabled */

  #define DPPIC_CHG_MaxCount (6UL)                   /*!< Max size of CHG[6] array.                                            */
  #define DPPIC_CHG_MaxIndex (5UL)                   /*!< Max index of CHG[6] array.                                           */
  #define DPPIC_CHG_MinIndex (0UL)                   /*!< Min index of CHG[6] array.                                           */
  #define DPPIC_CHG_ResetValue (0x00000000UL)        /*!< Reset value of CHG[6] register.                                      */

/* CH0 @Bit 0 : Include or exclude channel 0 */
  #define DPPIC_CHG_CH0_Pos (0UL)                    /*!< Position of CH0 field.                                               */
  #define DPPIC_CHG_CH0_Msk (0x1UL << DPPIC_CHG_CH0_Pos) /*!< Bit mask of CH0 field.                                           */
  #define DPPIC_CHG_CH0_Min (0x0UL)                  /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Max (0x1UL)                  /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHG_CH0_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH0_Included (0x1UL)             /*!< Include                                                              */

/* CH1 @Bit 1 : Include or exclude channel 1 */
  #define DPPIC_CHG_CH1_Pos (1UL)                    /*!< Position of CH1 field.                                               */
  #define DPPIC_CHG_CH1_Msk (0x1UL << DPPIC_CHG_CH1_Pos) /*!< Bit mask of CH1 field.                                           */
  #define DPPIC_CHG_CH1_Min (0x0UL)                  /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Max (0x1UL)                  /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHG_CH1_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH1_Included (0x1UL)             /*!< Include                                                              */

/* CH2 @Bit 2 : Include or exclude channel 2 */
  #define DPPIC_CHG_CH2_Pos (2UL)                    /*!< Position of CH2 field.                                               */
  #define DPPIC_CHG_CH2_Msk (0x1UL << DPPIC_CHG_CH2_Pos) /*!< Bit mask of CH2 field.                                           */
  #define DPPIC_CHG_CH2_Min (0x0UL)                  /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Max (0x1UL)                  /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHG_CH2_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH2_Included (0x1UL)             /*!< Include                                                              */

/* CH3 @Bit 3 : Include or exclude channel 3 */
  #define DPPIC_CHG_CH3_Pos (3UL)                    /*!< Position of CH3 field.                                               */
  #define DPPIC_CHG_CH3_Msk (0x1UL << DPPIC_CHG_CH3_Pos) /*!< Bit mask of CH3 field.                                           */
  #define DPPIC_CHG_CH3_Min (0x0UL)                  /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Max (0x1UL)                  /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHG_CH3_Excluded (0x0UL)             /*!< Exclude                                                              */
  #define DPPIC_CHG_CH3_Included (0x1UL)             /*!< Include                                                              */

