NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* STOP5 @Bit 21 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP5_Pos (21UL)         /*!< Position of STOP5 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP5_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP5_Pos) /*!< Bit mask of STOP5 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP5_Min (0x0UL)        /*!< Min enumerator value of STOP5 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP5_Max (0x1UL)        /*!< Max enumerator value of STOP5 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP5_Disabled (0x0UL)   /*!< The single PE comparator input 5, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP5_Enabled (0x1UL)    /*!< The single PE comparator input 5, is selected as a stop resource.    */

/* STOP6 @Bit 22 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP6_Pos (22UL)         /*!< Position of STOP6 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP6_Pos) /*!< Bit mask of STOP6 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP6_Min (0x0UL)        /*!< Min enumerator value of STOP6 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP6_Max (0x1UL)        /*!< Max enumerator value of STOP6 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP6_Disabled (0x0UL)   /*!< The single PE comparator input 6, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP6_Enabled (0x1UL)    /*!< The single PE comparator input 6, is selected as a stop resource.    */

/* STOP7 @Bit 23 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP7_Pos (23UL)         /*!< Position of STOP7 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP7_Pos) /*!< Bit mask of STOP7 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP7_Min (0x0UL)        /*!< Min enumerator value of STOP7 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP7_Max (0x1UL)        /*!< Max enumerator value of STOP7 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP7_Disabled (0x0UL)   /*!< The single PE comparator input 7, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP7_Enabled (0x1UL)    /*!< The single PE comparator input 7, is selected as a stop resource.    */


/* ETM_TRCVDCTLR: Controls data trace filtering. Might ignore writes when the trace unit is enabled or not idle. This register
                   must be programmed when data tracing is enabled, that is, when either TRCCONFIGR.DA == 1 or TRCCONFIGR.DV ==
                   1. */

  #define ETM_TRCVDCTLR_ResetValue (0x00000000UL)    /*!< Reset value of TRCVDCTLR register.                                   */

/* EVENT0 @Bit 0 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT0_Pos (0UL)             /*!< Position of EVENT0 field.                                            */
  #define ETM_TRCVDCTLR_EVENT0_Msk (0x1UL << ETM_TRCVDCTLR_EVENT0_Pos) /*!< Bit mask of EVENT0 field.                          */
  #define ETM_TRCVDCTLR_EVENT0_Min (0x0UL)           /*!< Min enumerator value of EVENT0 field.                                */
  #define ETM_TRCVDCTLR_EVENT0_Max (0x1UL)           /*!< Max enumerator value of EVENT0 field.                                */
  #define ETM_TRCVDCTLR_EVENT0_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT0_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT1 @Bit 1 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT1_Pos (1UL)             /*!< Position of EVENT1 field.                                            */
  #define ETM_TRCVDCTLR_EVENT1_Msk (0x1UL << ETM_TRCVDCTLR_EVENT1_Pos) /*!< Bit mask of EVENT1 field.                          */
  #define ETM_TRCVDCTLR_EVENT1_Min (0x0UL)           /*!< Min enumerator value of EVENT1 field.                                */
  #define ETM_TRCVDCTLR_EVENT1_Max (0x1UL)           /*!< Max enumerator value of EVENT1 field.                                */
  #define ETM_TRCVDCTLR_EVENT1_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT1_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT2 @Bit 2 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT2_Pos (2UL)             /*!< Position of EVENT2 field.                                            */
  #define ETM_TRCVDCTLR_EVENT2_Msk (0x1UL << ETM_TRCVDCTLR_EVENT2_Pos) /*!< Bit mask of EVENT2 field.                          */
  #define ETM_TRCVDCTLR_EVENT2_Min (0x0UL)           /*!< Min enumerator value of EVENT2 field.                                */
  #define ETM_TRCVDCTLR_EVENT2_Max (0x1UL)           /*!< Max enumerator value of EVENT2 field.                                */
  #define ETM_TRCVDCTLR_EVENT2_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT2_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

/* EVENT3 @Bit 3 : Event unit enable bit. */
  #define ETM_TRCVDCTLR_EVENT3_Pos (3UL)             /*!< Position of EVENT3 field.                                            */
  #define ETM_TRCVDCTLR_EVENT3_Msk (0x1UL << ETM_TRCVDCTLR_EVENT3_Pos) /*!< Bit mask of EVENT3 field.                          */
  #define ETM_TRCVDCTLR_EVENT3_Min (0x0UL)           /*!< Min enumerator value of EVENT3 field.                                */
  #define ETM_TRCVDCTLR_EVENT3_Max (0x1UL)           /*!< Max enumerator value of EVENT3 field.                                */
  #define ETM_TRCVDCTLR_EVENT3_Disabled (0x0UL)      /*!< The trace event is not selected for trace filtering.                 */
  #define ETM_TRCVDCTLR_EVENT3_Enabled (0x1UL)       /*!< The trace event is selected for trace filtering.                     */

