NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CLR1 @Bit 1 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR1_Pos (1UL)             /*!< Position of CLR1 field.                                              */
  #define ETM_TRCCLAIMCLR_CLR1_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR1_Pos) /*!< Bit mask of CLR1 field.                            */
  #define ETM_TRCCLAIMCLR_CLR1_Min (0x0UL)           /*!< Min enumerator value of CLR1 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR1_Max (0x1UL)           /*!< Max enumerator value of CLR1 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR1_NotSet (0x0UL)        /*!< Claim tag 1 is not set.                                              */
  #define ETM_TRCCLAIMCLR_CLR1_Set (0x1UL)           /*!< Claim tag 1 is set.                                                  */
  #define ETM_TRCCLAIMCLR_CLR1_Clear (0x1UL)         /*!< Clear claim tag 1.                                                   */

/* CLR2 @Bit 2 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR2_Pos (2UL)             /*!< Position of CLR2 field.                                              */
  #define ETM_TRCCLAIMCLR_CLR2_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR2_Pos) /*!< Bit mask of CLR2 field.                            */
  #define ETM_TRCCLAIMCLR_CLR2_Min (0x0UL)           /*!< Min enumerator value of CLR2 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR2_Max (0x1UL)           /*!< Max enumerator value of CLR2 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR2_NotSet (0x0UL)        /*!< Claim tag 2 is not set.                                              */
  #define ETM_TRCCLAIMCLR_CLR2_Set (0x1UL)           /*!< Claim tag 2 is set.                                                  */
  #define ETM_TRCCLAIMCLR_CLR2_Clear (0x1UL)         /*!< Clear claim tag 2.                                                   */

/* CLR3 @Bit 3 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR3_Pos (3UL)             /*!< Position of CLR3 field.                                              */
  #define ETM_TRCCLAIMCLR_CLR3_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR3_Pos) /*!< Bit mask of CLR3 field.                            */
  #define ETM_TRCCLAIMCLR_CLR3_Min (0x0UL)           /*!< Min enumerator value of CLR3 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR3_Max (0x1UL)           /*!< Max enumerator value of CLR3 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR3_NotSet (0x0UL)        /*!< Claim tag 3 is not set.                                              */
  #define ETM_TRCCLAIMCLR_CLR3_Set (0x1UL)           /*!< Claim tag 3 is set.                                                  */
  #define ETM_TRCCLAIMCLR_CLR3_Clear (0x1UL)         /*!< Clear claim tag 3.                                                   */


/* ETM_TRCAUTHSTATUS: Indicates the current level of tracing permitted by the system */
  #define ETM_TRCAUTHSTATUS_ResetValue (0x00000000UL) /*!< Reset value of TRCAUTHSTATUS register.                              */

/* NSID @Bits 0..1 : Non-secure Invasive Debug */
  #define ETM_TRCAUTHSTATUS_NSID_Pos (0UL)           /*!< Position of NSID field.                                              */
  #define ETM_TRCAUTHSTATUS_NSID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSID_Pos) /*!< Bit mask of NSID field.                        */
  #define ETM_TRCAUTHSTATUS_NSID_Min (0x0UL)         /*!< Min enumerator value of NSID field.                                  */
  #define ETM_TRCAUTHSTATUS_NSID_Max (0x1UL)         /*!< Max enumerator value of NSID field.                                  */
  #define ETM_TRCAUTHSTATUS_NSID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                   */
  #define ETM_TRCAUTHSTATUS_NSID_Implemented (0x1UL) /*!< The feature is implemented.                                          */

/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define ETM_TRCAUTHSTATUS_NSNID_Pos (2UL)          /*!< Position of NSNID field.                                             */
  #define ETM_TRCAUTHSTATUS_NSNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                     */
  #define ETM_TRCAUTHSTATUS_NSNID_Min (0x0UL)        /*!< Min enumerator value of NSNID field.                                 */
  #define ETM_TRCAUTHSTATUS_NSNID_Max (0x1UL)        /*!< Max enumerator value of NSNID field.                                 */
  #define ETM_TRCAUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                  */
  #define ETM_TRCAUTHSTATUS_NSNID_Implemented (0x1UL) /*!< The feature is implemented.                                         */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define ETM_TRCAUTHSTATUS_SID_Pos (4UL)            /*!< Position of SID field.                                               */
  #define ETM_TRCAUTHSTATUS_SID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                           */
  #define ETM_TRCAUTHSTATUS_SID_Min (0x0UL)          /*!< Min enumerator value of SID field.                                   */
  #define ETM_TRCAUTHSTATUS_SID_Max (0x1UL)          /*!< Max enumerator value of SID field.                                   */
  #define ETM_TRCAUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                    */
  #define ETM_TRCAUTHSTATUS_SID_Implemented (0x1UL)  /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define ETM_TRCAUTHSTATUS_SNID_Pos (6UL)           /*!< Position of SNID field.                                              */
  #define ETM_TRCAUTHSTATUS_SNID_Msk (0x3UL << ETM_TRCAUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                        */
  #define ETM_TRCAUTHSTATUS_SNID_Min (0x0UL)         /*!< Min enumerator value of SNID field.                                  */
  #define ETM_TRCAUTHSTATUS_SNID_Max (0x1UL)         /*!< Max enumerator value of SNID field.                                  */
  #define ETM_TRCAUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                   */
  #define ETM_TRCAUTHSTATUS_SNID_Implemented (0x1UL) /*!< The feature is implemented.                                          */


