NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* PIN6 @Bit 6 : Status on whether PIN6 has met criteria set in PIN_CNF[6].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN6_Pos (6UL)                  /*!< Position of PIN6 field.                                              */
  #define GPIO_LATCH_PIN6_Msk (0x1UL << GPIO_LATCH_PIN6_Pos) /*!< Bit mask of PIN6 field.                                      */
  #define GPIO_LATCH_PIN6_Min (0x0UL)                /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_LATCH_PIN6_Max (0x1UL)                /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_LATCH_PIN6_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN6_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN7 @Bit 7 : Status on whether PIN7 has met criteria set in PIN_CNF[7].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN7_Pos (7UL)                  /*!< Position of PIN7 field.                                              */
  #define GPIO_LATCH_PIN7_Msk (0x1UL << GPIO_LATCH_PIN7_Pos) /*!< Bit mask of PIN7 field.                                      */
  #define GPIO_LATCH_PIN7_Min (0x0UL)                /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_LATCH_PIN7_Max (0x1UL)                /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_LATCH_PIN7_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN7_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN8 @Bit 8 : Status on whether PIN8 has met criteria set in PIN_CNF[8].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN8_Pos (8UL)                  /*!< Position of PIN8 field.                                              */
  #define GPIO_LATCH_PIN8_Msk (0x1UL << GPIO_LATCH_PIN8_Pos) /*!< Bit mask of PIN8 field.                                      */
  #define GPIO_LATCH_PIN8_Min (0x0UL)                /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_LATCH_PIN8_Max (0x1UL)                /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_LATCH_PIN8_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN8_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN9 @Bit 9 : Status on whether PIN9 has met criteria set in PIN_CNF[9].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN9_Pos (9UL)                  /*!< Position of PIN9 field.                                              */
  #define GPIO_LATCH_PIN9_Msk (0x1UL << GPIO_LATCH_PIN9_Pos) /*!< Bit mask of PIN9 field.                                      */
  #define GPIO_LATCH_PIN9_Min (0x0UL)                /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_LATCH_PIN9_Max (0x1UL)                /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_LATCH_PIN9_NotLatched (0x0UL)         /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN9_Latched (0x1UL)            /*!< Criteria has been met                                                */

/* PIN10 @Bit 10 : Status on whether PIN10 has met criteria set in PIN_CNF[10].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN10_Pos (10UL)                /*!< Position of PIN10 field.                                             */
  #define GPIO_LATCH_PIN10_Msk (0x1UL << GPIO_LATCH_PIN10_Pos) /*!< Bit mask of PIN10 field.                                   */
  #define GPIO_LATCH_PIN10_Min (0x0UL)               /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_LATCH_PIN10_Max (0x1UL)               /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_LATCH_PIN10_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN10_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN11 @Bit 11 : Status on whether PIN11 has met criteria set in PIN_CNF[11].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN11_Pos (11UL)                /*!< Position of PIN11 field.                                             */
  #define GPIO_LATCH_PIN11_Msk (0x1UL << GPIO_LATCH_PIN11_Pos) /*!< Bit mask of PIN11 field.                                   */
  #define GPIO_LATCH_PIN11_Min (0x0UL)               /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_LATCH_PIN11_Max (0x1UL)               /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_LATCH_PIN11_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN11_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN12 @Bit 12 : Status on whether PIN12 has met criteria set in PIN_CNF[12].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN12_Pos (12UL)                /*!< Position of PIN12 field.                                             */
  #define GPIO_LATCH_PIN12_Msk (0x1UL << GPIO_LATCH_PIN12_Pos) /*!< Bit mask of PIN12 field.                                   */
  #define GPIO_LATCH_PIN12_Min (0x0UL)               /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_LATCH_PIN12_Max (0x1UL)               /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_LATCH_PIN12_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN12_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN13 @Bit 13 : Status on whether PIN13 has met criteria set in PIN_CNF[13].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN13_Pos (13UL)                /*!< Position of PIN13 field.                                             */
  #define GPIO_LATCH_PIN13_Msk (0x1UL << GPIO_LATCH_PIN13_Pos) /*!< Bit mask of PIN13 field.                                   */
  #define GPIO_LATCH_PIN13_Min (0x0UL)               /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_LATCH_PIN13_Max (0x1UL)               /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_LATCH_PIN13_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN13_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN14 @Bit 14 : Status on whether PIN14 has met criteria set in PIN_CNF[14].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN14_Pos (14UL)                /*!< Position of PIN14 field.                                             */
  #define GPIO_LATCH_PIN14_Msk (0x1UL << GPIO_LATCH_PIN14_Pos) /*!< Bit mask of PIN14 field.                                   */
  #define GPIO_LATCH_PIN14_Min (0x0UL)               /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_LATCH_PIN14_Max (0x1UL)               /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_LATCH_PIN14_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN14_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN15 @Bit 15 : Status on whether PIN15 has met criteria set in PIN_CNF[15].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN15_Pos (15UL)                /*!< Position of PIN15 field.                                             */
  #define GPIO_LATCH_PIN15_Msk (0x1UL << GPIO_LATCH_PIN15_Pos) /*!< Bit mask of PIN15 field.                                   */
  #define GPIO_LATCH_PIN15_Min (0x0UL)               /*!< Min enumerator value of PIN15 field.                                 */
  #define GPIO_LATCH_PIN15_Max (0x1UL)               /*!< Max enumerator value of PIN15 field.                                 */
  #define GPIO_LATCH_PIN15_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN15_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN16 @Bit 16 : Status on whether PIN16 has met criteria set in PIN_CNF[16].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN16_Pos (16UL)                /*!< Position of PIN16 field.                                             */
  #define GPIO_LATCH_PIN16_Msk (0x1UL << GPIO_LATCH_PIN16_Pos) /*!< Bit mask of PIN16 field.                                   */
  #define GPIO_LATCH_PIN16_Min (0x0UL)               /*!< Min enumerator value of PIN16 field.                                 */
  #define GPIO_LATCH_PIN16_Max (0x1UL)               /*!< Max enumerator value of PIN16 field.                                 */
  #define GPIO_LATCH_PIN16_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN16_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN17 @Bit 17 : Status on whether PIN17 has met criteria set in PIN_CNF[17].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN17_Pos (17UL)                /*!< Position of PIN17 field.                                             */
  #define GPIO_LATCH_PIN17_Msk (0x1UL << GPIO_LATCH_PIN17_Pos) /*!< Bit mask of PIN17 field.                                   */
  #define GPIO_LATCH_PIN17_Min (0x0UL)               /*!< Min enumerator value of PIN17 field.                                 */
  #define GPIO_LATCH_PIN17_Max (0x1UL)               /*!< Max enumerator value of PIN17 field.                                 */
  #define GPIO_LATCH_PIN17_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN17_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN18 @Bit 18 : Status on whether PIN18 has met criteria set in PIN_CNF[18].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN18_Pos (18UL)                /*!< Position of PIN18 field.                                             */
  #define GPIO_LATCH_PIN18_Msk (0x1UL << GPIO_LATCH_PIN18_Pos) /*!< Bit mask of PIN18 field.                                   */
  #define GPIO_LATCH_PIN18_Min (0x0UL)               /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_LATCH_PIN18_Max (0x1UL)               /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_LATCH_PIN18_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN18_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN19 @Bit 19 : Status on whether PIN19 has met criteria set in PIN_CNF[19].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN19_Pos (19UL)                /*!< Position of PIN19 field.                                             */
  #define GPIO_LATCH_PIN19_Msk (0x1UL << GPIO_LATCH_PIN19_Pos) /*!< Bit mask of PIN19 field.                                   */
  #define GPIO_LATCH_PIN19_Min (0x0UL)               /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_LATCH_PIN19_Max (0x1UL)               /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_LATCH_PIN19_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN19_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN20 @Bit 20 : Status on whether PIN20 has met criteria set in PIN_CNF[20].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN20_Pos (20UL)                /*!< Position of PIN20 field.                                             */
  #define GPIO_LATCH_PIN20_Msk (0x1UL << GPIO_LATCH_PIN20_Pos) /*!< Bit mask of PIN20 field.                                   */
  #define GPIO_LATCH_PIN20_Min (0x0UL)               /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_LATCH_PIN20_Max (0x1UL)               /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_LATCH_PIN20_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN20_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN21 @Bit 21 : Status on whether PIN21 has met criteria set in PIN_CNF[21].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN21_Pos (21UL)                /*!< Position of PIN21 field.                                             */
  #define GPIO_LATCH_PIN21_Msk (0x1UL << GPIO_LATCH_PIN21_Pos) /*!< Bit mask of PIN21 field.                                   */
  #define GPIO_LATCH_PIN21_Min (0x0UL)               /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_LATCH_PIN21_Max (0x1UL)               /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_LATCH_PIN21_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN21_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN22 @Bit 22 : Status on whether PIN22 has met criteria set in PIN_CNF[22].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN22_Pos (22UL)                /*!< Position of PIN22 field.                                             */
  #define GPIO_LATCH_PIN22_Msk (0x1UL << GPIO_LATCH_PIN22_Pos) /*!< Bit mask of PIN22 field.                                   */
  #define GPIO_LATCH_PIN22_Min (0x0UL)               /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_LATCH_PIN22_Max (0x1UL)               /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_LATCH_PIN22_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN22_Latched (0x1UL)           /*!< Criteria has been met                                                */

/* PIN23 @Bit 23 : Status on whether PIN23 has met criteria set in PIN_CNF[23].SENSE register. Write '1' to clear. */
  #define GPIO_LATCH_PIN23_Pos (23UL)                /*!< Position of PIN23 field.                                             */
  #define GPIO_LATCH_PIN23_Msk (0x1UL << GPIO_LATCH_PIN23_Pos) /*!< Bit mask of PIN23 field.                                   */
  #define GPIO_LATCH_PIN23_Min (0x0UL)               /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_LATCH_PIN23_Max (0x1UL)               /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_LATCH_PIN23_NotLatched (0x0UL)        /*!< Criteria has not been met                                            */
  #define GPIO_LATCH_PIN23_Latched (0x1UL)           /*!< Criteria has been met                                                */

