NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* TASKS_PUSHBLOCK @Bit 0 : Block only the PUSH operation of a key slot, preventing the key slot from being PUSHED until next
                            reset. The task is kept for backwards compatibility. */

  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Pos (0UL) /*!< Position of TASKS_PUSHBLOCK field.                                */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Msk (0x1UL << KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Pos) /*!< Bit mask of
                                                                            TASKS_PUSHBLOCK field.*/
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Min (0x1UL) /*!< Min enumerator value of TASKS_PUSHBLOCK field.                  */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Max (0x1UL) /*!< Max enumerator value of TASKS_PUSHBLOCK field.                  */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Trigger (0x1UL) /*!< Trigger task                                                */


/* KMU_TASKS_BLOCK: Block the PROVISION, PUSH, and REVOKE operations of a key slot, preventing the key slot from being
                     PROVISIONED, PUSHED, or REVOKED until next reset */

  #define KMU_TASKS_BLOCK_ResetValue (0x00000000UL)  /*!< Reset value of TASKS_BLOCK register.                                 */

/* TASKS_BLOCK @Bit 0 : Block the PROVISION, PUSH, and REVOKE operations of a key slot, preventing the key slot from being
                        PROVISIONED, PUSHED, or REVOKED until next reset */

  #define KMU_TASKS_BLOCK_TASKS_BLOCK_Pos (0UL)      /*!< Position of TASKS_BLOCK field.                                       */
  #define KMU_TASKS_BLOCK_TASKS_BLOCK_Msk (0x1UL << KMU_TASKS_BLOCK_TASKS_BLOCK_Pos) /*!< Bit mask of TASKS_BLOCK field.       */
  #define KMU_TASKS_BLOCK_TASKS_BLOCK_Min (0x1UL)    /*!< Min enumerator value of TASKS_BLOCK field.                           */
  #define KMU_TASKS_BLOCK_TASKS_BLOCK_Max (0x1UL)    /*!< Max enumerator value of TASKS_BLOCK field.                           */
  #define KMU_TASKS_BLOCK_TASKS_BLOCK_Trigger (0x1UL) /*!< Trigger task                                                        */


/* KMU_EVENTS_PROVISIONED: Key slot successfully provisioned */
  #define KMU_EVENTS_PROVISIONED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PROVISIONED register.                    */

/* EVENTS_PROVISIONED @Bit 0 : Key slot successfully provisioned */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Pos (0UL) /*!< Position of EVENTS_PROVISIONED field.                       */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Msk (0x1UL << KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Pos) /*!< Bit mask
                                                                            of EVENTS_PROVISIONED field.*/
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PROVISIONED field.         */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PROVISIONED field.         */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Generated (0x1UL) /*!< Event generated                                     */


/* KMU_EVENTS_PUSHED: Key slot successfully pushed */
  #define KMU_EVENTS_PUSHED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PUSHED register.                              */

/* EVENTS_PUSHED @Bit 0 : Key slot successfully pushed */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Pos (0UL)  /*!< Position of EVENTS_PUSHED field.                                     */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Msk (0x1UL << KMU_EVENTS_PUSHED_EVENTS_PUSHED_Pos) /*!< Bit mask of EVENTS_PUSHED
                                                                            field.*/
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PUSHED field.                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PUSHED field.                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Generated (0x1UL) /*!< Event generated                                               */


/* KMU_EVENTS_REVOKED: Key slot has been revoked and can no longer be used */
  #define KMU_EVENTS_REVOKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REVOKED register.                            */

/* EVENTS_REVOKED @Bit 0 : Key slot has been revoked and can no longer be used */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Pos (0UL) /*!< Position of EVENTS_REVOKED field.                                   */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Msk (0x1UL << KMU_EVENTS_REVOKED_EVENTS_REVOKED_Pos) /*!< Bit mask of EVENTS_REVOKED
                                                                            field.*/
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_REVOKED field.                     */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_REVOKED field.                     */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Generated (0x1UL) /*!< Event generated                                             */


/* KMU_EVENTS_ERROR: Error generated during PROVISION, PUSH, READMETADATA or REVOKE operations. Triggering the PROVISION, PUSH
                      and REVOKE tasks on a BLOCKED keyslot will also generate this event. */

  #define KMU_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                                */

/* EVENTS_ERROR @Bit 0 : Error generated during PROVISION, PUSH, READMETADATA or REVOKE operations. Triggering the PROVISION,
                         PUSH and REVOKE tasks on a BLOCKED keyslot will also generate this event. */

  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)    /*!< Position of EVENTS_ERROR field.                                      */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << KMU_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.  */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)  /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)  /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                 */


/* KMU_EVENTS_METADATAREAD: Key slot metadata has been read into METADATA register */
  #define KMU_EVENTS_METADATAREAD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_METADATAREAD register.                  */

