NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << PPIB_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PPIB_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define PPIB_PUBLISH_RECEIVE_EN_Msk (0x1UL << PPIB_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define PPIB_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define PPIB_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                            PWM                                            ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct PWM_TASKS_DMA_SEQ ================================================= */
/**
  * @brief SEQ [PWM_TASKS_DMA_SEQ] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  START;                             /*!< (@ 0x00000000) Starts operation using easyDMA to load the values. See
                                                                         peripheral description for operation using easyDMA.*/
  __IM  uint32_t  RESERVED;
} NRF_PWM_TASKS_DMA_SEQ_Type;                        /*!< Size = 8 (0x008)                                                     */
  #define PWM_TASKS_DMA_SEQ_MaxCount (2UL)           /*!< Size of SEQ[2] array.                                                */
  #define PWM_TASKS_DMA_SEQ_MaxIndex (1UL)           /*!< Max index of SEQ[2] array.                                           */
  #define PWM_TASKS_DMA_SEQ_MinIndex (0UL)           /*!< Min index of SEQ[2] array.                                           */

/* PWM_TASKS_DMA_SEQ_START: Starts operation using easyDMA to load the values. See peripheral description for operation using
                             easyDMA. */

  #define PWM_TASKS_DMA_SEQ_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                */

/* START @Bit 0 : Starts operation using easyDMA to load the values. See peripheral description for operation using easyDMA. */
  #define PWM_TASKS_DMA_SEQ_START_START_Pos (0UL)    /*!< Position of START field.                                             */
  #define PWM_TASKS_DMA_SEQ_START_START_Msk (0x1UL << PWM_TASKS_DMA_SEQ_START_START_Pos) /*!< Bit mask of START field.         */
  #define PWM_TASKS_DMA_SEQ_START_START_Min (0x1UL)  /*!< Min enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Max (0x1UL)  /*!< Max enumerator value of START field.                                 */
  #define PWM_TASKS_DMA_SEQ_START_START_Trigger (0x1UL) /*!< Trigger task                                                      */



/* ================================================== Struct PWM_TASKS_DMA =================================================== */
/**
  * @brief TASKS_DMA [PWM_TASKS_DMA] Peripheral tasks.
  */
typedef struct {
  __OM  NRF_PWM_TASKS_DMA_SEQ_Type SEQ[2];           /*!< (@ 0x00000000) Peripheral tasks.                                     */
} NRF_PWM_TASKS_DMA_Type;                            /*!< Size = 16 (0x010)                                                    */


/* ============================================== Struct PWM_SUBSCRIBE_DMA_SEQ =============================================== */
/**
  * @brief SEQ [PWM_SUBSCRIBE_DMA_SEQ] Subscribe configuration for tasks
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Subscribe configuration for task START                */
  __IM  uint32_t  RESERVED;
} NRF_PWM_SUBSCRIBE_DMA_SEQ_Type;                    /*!< Size = 8 (0x008)                                                     */
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxCount (2UL)       /*!< Size of SEQ[2] array.                                                */
  #define PWM_SUBSCRIBE_DMA_SEQ_MaxIndex (1UL)       /*!< Max index of SEQ[2] array.                                           */
  #define PWM_SUBSCRIBE_DMA_SEQ_MinIndex (0UL)       /*!< Min index of SEQ[2] array.                                           */

/* PWM_SUBSCRIBE_DMA_SEQ_START: Subscribe configuration for task START */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Msk (0xFFUL << PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Msk (0x1UL << PWM_SUBSCRIBE_DMA_SEQ_START_EN_Pos) /*!< Bit mask of EN field.          */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define PWM_SUBSCRIBE_DMA_SEQ_START_EN_Enabled (0x1UL) /*!< Enable subscription                                              */



/* ================================================ Struct PWM_SUBSCRIBE_DMA ================================================= */
/**
  * @brief SUBSCRIBE_DMA [PWM_SUBSCRIBE_DMA] Subscribe configuration for tasks
  */
typedef struct {
  __IOM NRF_PWM_SUBSCRIBE_DMA_SEQ_Type SEQ[2];       /*!< (@ 0x00000000) Subscribe configuration for tasks                     */
} NRF_PWM_SUBSCRIBE_DMA_Type;                        /*!< Size = 16 (0x010)                                                    */


/* ================================================ Struct PWM_EVENTS_DMA_SEQ ================================================ */
/**
  * @brief SEQ [PWM_EVENTS_DMA_SEQ] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after all MAXCNT bytes have been transferred*/
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer.             */
} NRF_PWM_EVENTS_DMA_SEQ_Type;                       /*!< Size = 12 (0x00C)                                                    */
