NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CHIDX @Bits 0..7 : DPPI channel that task AUXDATADMASTOP will subscribe to */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_AUXDATADMASTOP_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                     */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Pos) /*!< Bit mask of EN field.    */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Disabled (0x0UL) /*!< Disable subscription                                         */
  #define RADIO_SUBSCRIBE_AUXDATADMASTOP_EN_Enabled (0x1UL) /*!< Enable subscription                                           */


/* RADIO_SUBSCRIBE_PLLEN: Subscribe configuration for task PLLEN */
  #define RADIO_SUBSCRIBE_PLLEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_PLLEN register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task PLLEN will subscribe to */
  #define RADIO_SUBSCRIBE_PLLEN_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_PLLEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_PLLEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_SUBSCRIBE_PLLEN_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_PLLEN_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_PLLEN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_PLLEN_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_CSTONESSTART: Subscribe configuration for task CSTONESSTART */
  #define RADIO_SUBSCRIBE_CSTONESSTART_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CSTONESSTART register.          */

/* CHIDX @Bits 0..7 : DPPI channel that task CSTONESSTART will subscribe to */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                           */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                       */
  #define RADIO_SUBSCRIBE_CSTONESSTART_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                        */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Pos (31UL) /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CSTONESSTART_EN_Pos) /*!< Bit mask of EN field.        */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                   */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                   */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Disabled (0x0UL) /*!< Disable subscription                                           */
  #define RADIO_SUBSCRIBE_CSTONESSTART_EN_Enabled (0x1UL) /*!< Enable subscription                                             */


/* RADIO_SUBSCRIBE_SOFTRESET: Subscribe configuration for task SOFTRESET */
  #define RADIO_SUBSCRIBE_SOFTRESET_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SOFTRESET register.                */

/* CHIDX @Bits 0..7 : DPPI channel that task SOFTRESET will subscribe to */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Pos (0UL)  /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Pos) /*!< Bit mask of CHIDX field.    */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                          */
  #define RADIO_SUBSCRIBE_SOFTRESET_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                           */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Pos (31UL)    /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Msk (0x1UL << RADIO_SUBSCRIBE_SOFTRESET_EN_Pos) /*!< Bit mask of EN field.              */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Min (0x0UL)   /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Max (0x1UL)   /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Disabled (0x0UL) /*!< Disable subscription                                              */
  #define RADIO_SUBSCRIBE_SOFTRESET_EN_Enabled (0x1UL) /*!< Enable subscription                                                */


/* RADIO_EVENTS_READY: RADIO has ramped up and is ready to be started */
  #define RADIO_EVENTS_READY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_READY register.                              */

