NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event CCABUSY will publish to */
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CCABUSY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_CCABUSY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CCABUSY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CCABUSY_EN_Msk (0x1UL << RADIO_PUBLISH_CCABUSY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RADIO_PUBLISH_CCABUSY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CCABUSY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CCABUSY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_CCABUSY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_CCASTOPPED: Publish configuration for event CCASTOPPED */
  #define RADIO_PUBLISH_CCASTOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CCASTOPPED register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event CCASTOPPED will publish to */
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CCASTOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_PUBLISH_CCASTOPPED_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Msk (0x1UL << RADIO_PUBLISH_CCASTOPPED_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_CCASTOPPED_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_RATEBOOST: Publish configuration for event RATEBOOST */
  #define RADIO_PUBLISH_RATEBOOST_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RATEBOOST register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RATEBOOST will publish to */
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RATEBOOST_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RATEBOOST_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RATEBOOST_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RATEBOOST_EN_Msk (0x1UL << RADIO_PUBLISH_RATEBOOST_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_RATEBOOST_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RATEBOOST_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RATEBOOST_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_RATEBOOST_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_MHRMATCH: Publish configuration for event MHRMATCH */
  #define RADIO_PUBLISH_MHRMATCH_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_MHRMATCH register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event MHRMATCH will publish to */
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_MHRMATCH_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_MHRMATCH_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_MHRMATCH_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_MHRMATCH_EN_Msk (0x1UL << RADIO_PUBLISH_MHRMATCH_EN_Pos) /*!< Bit mask of EN field.                    */
  #define RADIO_PUBLISH_MHRMATCH_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MHRMATCH_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_MHRMATCH_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_MHRMATCH_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_SYNC: Publish configuration for event SYNC */
  #define RADIO_PUBLISH_SYNC_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SYNC register.                              */

/* CHIDX @Bits 0..7 : DPPI channel that event SYNC will publish to */
  #define RADIO_PUBLISH_SYNC_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_SYNC_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_SYNC_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define RADIO_PUBLISH_SYNC_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_SYNC_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_SYNC_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_SYNC_EN_Msk (0x1UL << RADIO_PUBLISH_SYNC_EN_Pos) /*!< Bit mask of EN field.                            */
  #define RADIO_PUBLISH_SYNC_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_SYNC_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_SYNC_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_SYNC_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_CTEPRESENT: Publish configuration for event CTEPRESENT */
  #define RADIO_PUBLISH_CTEPRESENT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CTEPRESENT register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event CTEPRESENT will publish to */
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_CTEPRESENT_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define RADIO_PUBLISH_CTEPRESENT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Msk (0x1UL << RADIO_PUBLISH_CTEPRESENT_EN_Pos) /*!< Bit mask of EN field.                */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define RADIO_PUBLISH_CTEPRESENT_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* RADIO_PUBLISH_PLLREADY: Publish configuration for event PLLREADY */
  #define RADIO_PUBLISH_PLLREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_PLLREADY register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that event PLLREADY will publish to */
  #define RADIO_PUBLISH_PLLREADY_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_PLLREADY_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_PLLREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define RADIO_PUBLISH_PLLREADY_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_PLLREADY_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_PLLREADY_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_PLLREADY_EN_Msk (0x1UL << RADIO_PUBLISH_PLLREADY_EN_Pos) /*!< Bit mask of EN field.                    */
  #define RADIO_PUBLISH_PLLREADY_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_PLLREADY_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_PLLREADY_EN_Disabled (0x0UL) /*!< Disable publishing                                                   */
  #define RADIO_PUBLISH_PLLREADY_EN_Enabled (0x1UL)  /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_RXADDRESS: Publish configuration for event RXADDRESS */
  #define RADIO_PUBLISH_RXADDRESS_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXADDRESS register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event RXADDRESS will publish to */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_RXADDRESS_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define RADIO_PUBLISH_RXADDRESS_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_RXADDRESS_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_RXADDRESS_EN_Msk (0x1UL << RADIO_PUBLISH_RXADDRESS_EN_Pos) /*!< Bit mask of EN field.                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_RXADDRESS_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define RADIO_PUBLISH_RXADDRESS_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* RADIO_PUBLISH_AUXDATADMAEND: Publish configuration for event AUXDATADMAEND */
  #define RADIO_PUBLISH_AUXDATADMAEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_AUXDATADMAEND register.            */

/* CHIDX @Bits 0..7 : DPPI channel that event AUXDATADMAEND will publish to */
  #define RADIO_PUBLISH_AUXDATADMAEND_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RADIO_PUBLISH_AUXDATADMAEND_CHIDX_Msk (0xFFUL << RADIO_PUBLISH_AUXDATADMAEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RADIO_PUBLISH_AUXDATADMAEND_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RADIO_PUBLISH_AUXDATADMAEND_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Msk (0x1UL << RADIO_PUBLISH_AUXDATADMAEND_EN_Pos) /*!< Bit mask of EN field.          */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Disabled (0x0UL) /*!< Disable publishing                                              */
  #define RADIO_PUBLISH_AUXDATADMAEND_EN_Enabled (0x1UL) /*!< Enable publishing                                                */


/* RADIO_PUBLISH_CSTONESEND: Publish configuration for event CSTONESEND */
  #define RADIO_PUBLISH_CSTONESEND_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CSTONESEND register.                  */

