NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* RRAMC_TASKS_COMMITWRITEBUF: Commits the data stored in internal write-buffer to RRAM */
  #define RRAMC_TASKS_COMMITWRITEBUF_ResetValue (0x00000000UL) /*!< Reset value of TASKS_COMMITWRITEBUF register.              */

/* TASKS_COMMITWRITEBUF @Bit 0 : Commits the data stored in internal write-buffer to RRAM */
  #define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Pos (0UL) /*!< Position of TASKS_COMMITWRITEBUF field.               */
  #define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Msk (0x1UL << RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Pos)
                                                                            /*!< Bit mask of TASKS_COMMITWRITEBUF field.*/
  #define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Min (0x1UL) /*!< Min enumerator value of TASKS_COMMITWRITEBUF field. */
  #define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Max (0x1UL) /*!< Max enumerator value of TASKS_COMMITWRITEBUF field. */
  #define RRAMC_TASKS_COMMITWRITEBUF_TASKS_COMMITWRITEBUF_Trigger (0x1UL) /*!< Trigger task                                    */


/* RRAMC_SUBSCRIBE_WAKEUP: Subscribe configuration for task WAKEUP */
  #define RRAMC_SUBSCRIBE_WAKEUP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_WAKEUP register.                      */

/* CHIDX @Bits 0..7 : DPPI channel that task WAKEUP will subscribe to */
  #define RRAMC_SUBSCRIBE_WAKEUP_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define RRAMC_SUBSCRIBE_WAKEUP_CHIDX_Msk (0xFFUL << RRAMC_SUBSCRIBE_WAKEUP_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define RRAMC_SUBSCRIBE_WAKEUP_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define RRAMC_SUBSCRIBE_WAKEUP_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Msk (0x1UL << RRAMC_SUBSCRIBE_WAKEUP_EN_Pos) /*!< Bit mask of EN field.                    */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define RRAMC_SUBSCRIBE_WAKEUP_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* RRAMC_SUBSCRIBE_CLRWRITEBUF: Subscribe configuration for task CLRWRITEBUF */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_CLRWRITEBUF register.            */

/* CHIDX @Bits 0..7 : DPPI channel that task CLRWRITEBUF will subscribe to */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                            */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_CHIDX_Msk (0xFFUL << RRAMC_SUBSCRIBE_CLRWRITEBUF_CHIDX_Pos) /*!< Bit mask of CHIDX field.*/
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                        */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                         */

/* EN @Bit 31 : (unspecified) */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Pos (31UL)  /*!< Position of EN field.                                                */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Msk (0x1UL << RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Pos) /*!< Bit mask of EN field.          */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                    */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                    */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Disabled (0x0UL) /*!< Disable subscription                                            */
  #define RRAMC_SUBSCRIBE_CLRWRITEBUF_EN_Enabled (0x1UL) /*!< Enable subscription                                              */


/* RRAMC_SUBSCRIBE_COMMITWRITEBUF: Subscribe configuration for task COMMITWRITEBUF */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_COMMITWRITEBUF register.      */

/* CHIDX @Bits 0..7 : DPPI channel that task COMMITWRITEBUF will subscribe to */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_CHIDX_Pos (0UL) /*!< Position of CHIDX field.                                         */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_CHIDX_Msk (0xFFUL << RRAMC_SUBSCRIBE_COMMITWRITEBUF_CHIDX_Pos) /*!< Bit mask of CHIDX
                                                                            field.*/
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                     */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                      */

/* EN @Bit 31 : (unspecified) */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Pos (31UL) /*!< Position of EN field.                                              */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Msk (0x1UL << RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Pos) /*!< Bit mask of EN field.    */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Min (0x0UL) /*!< Min enumerator value of EN field.                                 */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Max (0x1UL) /*!< Max enumerator value of EN field.                                 */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Disabled (0x0UL) /*!< Disable subscription                                         */
  #define RRAMC_SUBSCRIBE_COMMITWRITEBUF_EN_Enabled (0x1UL) /*!< Enable subscription                                           */


