NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* SPIM_TASKS_RESUME: Resume SPI transaction */
  #define SPIM_TASKS_RESUME_ResetValue (0x00000000UL) /*!< Reset value of TASKS_RESUME register.                               */

/* TASKS_RESUME @Bit 0 : Resume SPI transaction */
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Pos (0UL)   /*!< Position of TASKS_RESUME field.                                      */
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Msk (0x1UL << SPIM_TASKS_RESUME_TASKS_RESUME_Pos) /*!< Bit mask of TASKS_RESUME field.*/
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Min (0x1UL) /*!< Min enumerator value of TASKS_RESUME field.                          */
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Max (0x1UL) /*!< Max enumerator value of TASKS_RESUME field.                          */
  #define SPIM_TASKS_RESUME_TASKS_RESUME_Trigger (0x1UL) /*!< Trigger task                                                     */


/* SPIM_SUBSCRIBE_START: Subscribe configuration for task START */
  #define SPIM_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                         */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define SPIM_SUBSCRIBE_START_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define SPIM_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define SPIM_SUBSCRIBE_START_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define SPIM_SUBSCRIBE_START_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_START_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define SPIM_SUBSCRIBE_START_EN_Msk (0x1UL << SPIM_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                        */
  #define SPIM_SUBSCRIBE_START_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_START_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_START_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define SPIM_SUBSCRIBE_START_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* SPIM_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define SPIM_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                           */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define SPIM_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_STOP_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define SPIM_SUBSCRIBE_STOP_EN_Msk (0x1UL << SPIM_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                          */
  #define SPIM_SUBSCRIBE_STOP_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_STOP_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_STOP_EN_Disabled (0x0UL)    /*!< Disable subscription                                                 */
  #define SPIM_SUBSCRIBE_STOP_EN_Enabled (0x1UL)     /*!< Enable subscription                                                  */


/* SPIM_SUBSCRIBE_SUSPEND: Subscribe configuration for task SUSPEND */
  #define SPIM_SUBSCRIBE_SUSPEND_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_SUSPEND register.                     */

/* CHIDX @Bits 0..7 : DPPI channel that task SUSPEND will subscribe to */
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos (0UL)     /*!< Position of CHIDX field.                                             */
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_SUSPEND_CHIDX_Pos) /*!< Bit mask of CHIDX field.          */
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Min (0x00UL)  /*!< Min value of CHIDX field.                                            */
  #define SPIM_SUBSCRIBE_SUSPEND_CHIDX_Max (0xFFUL)  /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Pos (31UL)       /*!< Position of EN field.                                                */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Msk (0x1UL << SPIM_SUBSCRIBE_SUSPEND_EN_Pos) /*!< Bit mask of EN field.                    */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Min (0x0UL)      /*!< Min enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Max (0x1UL)      /*!< Max enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Disabled (0x0UL) /*!< Disable subscription                                                 */
  #define SPIM_SUBSCRIBE_SUSPEND_EN_Enabled (0x1UL)  /*!< Enable subscription                                                  */


/* SPIM_SUBSCRIBE_RESUME: Subscribe configuration for task RESUME */
  #define SPIM_SUBSCRIBE_RESUME_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RESUME register.                       */

/* CHIDX @Bits 0..7 : DPPI channel that task RESUME will subscribe to */
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Msk (0xFFUL << SPIM_SUBSCRIBE_RESUME_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define SPIM_SUBSCRIBE_RESUME_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define SPIM_SUBSCRIBE_RESUME_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define SPIM_SUBSCRIBE_RESUME_EN_Msk (0x1UL << SPIM_SUBSCRIBE_RESUME_EN_Pos) /*!< Bit mask of EN field.                      */
  #define SPIM_SUBSCRIBE_RESUME_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_RESUME_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define SPIM_SUBSCRIBE_RESUME_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define SPIM_SUBSCRIBE_RESUME_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* SPIM_EVENTS_STARTED: SPI transaction has started */
  #define SPIM_EVENTS_STARTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STARTED register.                           */

/* EVENTS_STARTED @Bit 0 : SPI transaction has started */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos (0UL) /*!< Position of EVENTS_STARTED field.                                  */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Msk (0x1UL << SPIM_EVENTS_STARTED_EVENTS_STARTED_Pos) /*!< Bit mask of
                                                                            EVENTS_STARTED field.*/
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STARTED field.                    */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STARTED field.                    */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define SPIM_EVENTS_STARTED_EVENTS_STARTED_Generated (0x1UL) /*!< Event generated                                            */


/* SPIM_EVENTS_STOPPED: SPI transaction has stopped */
  #define SPIM_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                           */

/* EVENTS_STOPPED @Bit 0 : SPI transaction has stopped */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                  */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of
                                                                            EVENTS_STOPPED field.*/
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                    */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                    */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                     */
  #define SPIM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                            */


/* SPIM_EVENTS_END: End of RXD buffer and TXD buffer reached */
  #define SPIM_EVENTS_END_ResetValue (0x00000000UL)  /*!< Reset value of EVENTS_END register.                                  */

