NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* TAMPC_PROTECT_ERASEPROTECT_CTRL: Control register for erase protection. */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_ResetValue (0x00000010UL) /*!< Reset value of CTRL register.                         */

/* VALUE @Bit 0 : Set value of eraseprotect signal. */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Pos (0UL) /*!< Position of VALUE field.                                        */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Msk (0x1UL << TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Pos) /*!< Bit mask of VALUE
                                                                            field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Min (0x0UL) /*!< Min enumerator value of VALUE field.                          */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Max (0x1UL) /*!< Max enumerator value of VALUE field.                          */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_Low (0x0UL) /*!< Signal is logic 0.                                            */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_VALUE_High (0x1UL) /*!< Signal is logic 1.                                           */

/* LOCK @Bit 1 : Lock this register to prevent changes to the VALUE field until next reset. */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Pos (1UL) /*!< Position of LOCK field.                                          */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Msk (0x1UL << TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Pos) /*!< Bit mask of LOCK
                                                                            field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                            */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                            */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Disabled (0x0UL) /*!< Lock disabled.                                            */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_LOCK_Enabled (0x1UL) /*!< Lock enabled.                                              */

/* WRITEPROTECTION @Bits 4..7 : The write protection must be cleared to allow updates to the VALUE field. */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Pos (4UL) /*!< Position of WRITEPROTECTION field.                    */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Msk (0xFUL << TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Pos)
                                                                            /*!< Bit mask of WRITEPROTECTION field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Min (0x0UL) /*!< Min enumerator value of WRITEPROTECTION field.      */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Max (0xFUL) /*!< Max enumerator value of WRITEPROTECTION field.      */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Disabled (0x0UL) /*!< Read: Write protection is disabled.            */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Enabled (0x1UL) /*!< Read: Write protection is enabled.              */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_WRITEPROTECTION_Clear (0xFUL) /*!< Write: Value to clear write protection.           */

/* KEY @Bits 16..31 : Required write key for upper 16 bits. Must be included in all register write operations. */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_Pos (16UL) /*!< Position of KEY field.                                           */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_Msk (0xFFFFUL << TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_Pos) /*!< Bit mask of KEY
                                                                            field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_Min (0x50FAUL) /*!< Min enumerator value of KEY field.                           */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_Max (0x50FAUL) /*!< Max enumerator value of KEY field.                           */
  #define TAMPC_PROTECT_ERASEPROTECT_CTRL_KEY_KEY (0x50FAUL) /*!< Write key value.                                             */


/* TAMPC_PROTECT_ERASEPROTECT_STATUS: Status register for eraseprotect. */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ResetValue (0x00000000UL) /*!< Reset value of STATUS register.                     */

/* ERROR @Bit 0 : Error detection status. */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Pos (0UL) /*!< Position of ERROR field.                                      */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Msk (0x1UL << TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Pos) /*!< Bit mask of
                                                                            ERROR field.*/
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Min (0x0UL) /*!< Min enumerator value of ERROR field.                        */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Max (0x1UL) /*!< Max enumerator value of ERROR field.                        */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_NoError (0x0UL) /*!< No error detected.                                      */
  #define TAMPC_PROTECT_ERASEPROTECT_STATUS_ERROR_Error (0x1UL) /*!< Error detected.                                           */



/* ================================================== Struct TAMPC_PROTECT =================================================== */
/**
  * @brief PROTECT [TAMPC_PROTECT] (unspecified)
  */
typedef struct {
  __IOM NRF_TAMPC_PROTECT_DOMAIN_Type DOMAIN[1];     /*!< (@ 0x00000000) (unspecified)                                         */
  __IM  uint32_t  RESERVED[120];
  __IOM NRF_TAMPC_PROTECT_AP_Type AP[1];             /*!< (@ 0x00000200) (unspecified)                                         */
  __IM  uint32_t  RESERVED1[124];
  __IOM NRF_TAMPC_PROTECT_ACTIVESHIELD_Type ACTIVESHIELD; /*!< (@ 0x00000400) Enable active shield detector.                   */
  __IM  uint32_t  RESERVED2[12];
  __IOM NRF_TAMPC_PROTECT_CRACENTAMP_Type CRACENTAMP; /*!< (@ 0x00000438) Enable tamper detector from CRACEN.                  */
  __IOM NRF_TAMPC_PROTECT_GLITCHSLOWDOMAIN_Type GLITCHSLOWDOMAIN; /*!< (@ 0x00000440) Enable slow domain glitch detectors.     */
  __IOM NRF_TAMPC_PROTECT_GLITCHFASTDOMAIN_Type GLITCHFASTDOMAIN; /*!< (@ 0x00000448) Enable fast domain glitch detectors.     */
  __IM  uint32_t  RESERVED3[8];
  __IOM NRF_TAMPC_PROTECT_EXTRESETEN_Type EXTRESETEN; /*!< (@ 0x00000470) Trigger a reset when tamper is detected by the
                                                                          external tamper detectors.*/
  __IOM NRF_TAMPC_PROTECT_INTRESETEN_Type INTRESETEN; /*!< (@ 0x00000478) Trigger a reset when tamper is detected by the glitch
                                                                          detectors, signal protector or CRACEN tamper
                                                                          detector.*/
  __IOM NRF_TAMPC_PROTECT_ERASEPROTECT_Type ERASEPROTECT; /*!< (@ 0x00000480) Device erase protection.                         */
} NRF_TAMPC_PROTECT_Type;                            /*!< Size = 1160 (0x488)                                                  */

/* ====================================================== Struct TAMPC ======================================================= */
/**
  * @brief Tamper controller
  */
  typedef struct {                                   /*!< TAMPC Structure                                                      */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_TAMPER;                    /*!< (@ 0x00000100) Tamper controller detected an error.                  */
    __IOM uint32_t EVENTS_WRITEERROR;                /*!< (@ 0x00000104) Attempt to write a VALUE in PROTECT registers without
                                                                         clearing the WRITEPROTECT.*/
    __IM uint32_t RESERVED1[126];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t INTPEND;                           /*!< (@ 0x0000030C) Pending interrupts                                    */
    __IM uint32_t RESERVED2[60];
    __IOM uint32_t STATUS;                           /*!< (@ 0x00000400) The tamper controller status.                         */
    __IOM NRF_TAMPC_ACTIVESHIELD_Type ACTIVESHIELD;  /*!< (@ 0x00000404) (unspecified)                                         */
    __IM uint32_t RESERVED3[62];
    __IOM NRF_TAMPC_PROTECT_Type PROTECT;            /*!< (@ 0x00000500) (unspecified)                                         */
  } NRF_TAMPC_Type;                                  /*!< Size = 2440 (0x988)                                                  */

