NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* TDM_PUBLISH_MAXCNT: Publish configuration for event MAXCNT */
  #define TDM_PUBLISH_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_MAXCNT register.                            */

/* CHIDX @Bits 0..7 : DPPI channel that event MAXCNT will publish to */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Pos (0UL)         /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Msk (0xFFUL << TDM_PUBLISH_MAXCNT_CHIDX_Pos) /*!< Bit mask of CHIDX field.                  */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Min (0x00UL)      /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_MAXCNT_CHIDX_Max (0xFFUL)      /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_MAXCNT_EN_Pos (31UL)           /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_MAXCNT_EN_Msk (0x1UL << TDM_PUBLISH_MAXCNT_EN_Pos) /*!< Bit mask of EN field.                            */
  #define TDM_PUBLISH_MAXCNT_EN_Min (0x0UL)          /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_MAXCNT_EN_Max (0x1UL)          /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_MAXCNT_EN_Disabled (0x0UL)     /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_MAXCNT_EN_Enabled (0x1UL)      /*!< Enable publishing                                                    */


/* TDM_PUBLISH_BUSERROR_RX: Publish configuration for event BUSERROR_RX */
  #define TDM_PUBLISH_BUSERROR_RX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BUSERROR_RX register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR_RX will publish to */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_BUSERROR_RX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_BUSERROR_RX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Msk (0x1UL << TDM_PUBLISH_BUSERROR_RX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TDM_PUBLISH_BUSERROR_RX_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TDM_PUBLISH_BUSERROR_TX: Publish configuration for event BUSERROR_TX */
  #define TDM_PUBLISH_BUSERROR_TX_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_BUSERROR_TX register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event BUSERROR_TX will publish to */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Msk (0xFFUL << TDM_PUBLISH_BUSERROR_TX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_BUSERROR_TX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Msk (0x1UL << TDM_PUBLISH_BUSERROR_TX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define TDM_PUBLISH_BUSERROR_TX_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* TDM_INTEN: Enable or disable interrupt */
  #define TDM_INTEN_ResetValue (0x00000000UL)        /*!< Reset value of INTEN register.                                       */

/* RXPTRUPD @Bit 1 : Enable or disable interrupt for event RXPTRUPD */
  #define TDM_INTEN_RXPTRUPD_Pos (1UL)               /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTEN_RXPTRUPD_Msk (0x1UL << TDM_INTEN_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                            */
  #define TDM_INTEN_RXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTEN_RXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTEN_RXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_RXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* STOPPED @Bit 2 : Enable or disable interrupt for event STOPPED */
  #define TDM_INTEN_STOPPED_Pos (2UL)                /*!< Position of STOPPED field.                                           */
  #define TDM_INTEN_STOPPED_Msk (0x1UL << TDM_INTEN_STOPPED_Pos) /*!< Bit mask of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Min (0x0UL)              /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Max (0x1UL)              /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTEN_STOPPED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_INTEN_STOPPED_Enabled (0x1UL)          /*!< Enable                                                               */

/* ABORTED @Bit 3 : Enable or disable interrupt for event ABORTED */
  #define TDM_INTEN_ABORTED_Pos (3UL)                /*!< Position of ABORTED field.                                           */
  #define TDM_INTEN_ABORTED_Msk (0x1UL << TDM_INTEN_ABORTED_Pos) /*!< Bit mask of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Min (0x0UL)              /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Max (0x1UL)              /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTEN_ABORTED_Disabled (0x0UL)         /*!< Disable                                                              */
  #define TDM_INTEN_ABORTED_Enabled (0x1UL)          /*!< Enable                                                               */

/* TXPTRUPD @Bit 6 : Enable or disable interrupt for event TXPTRUPD */
  #define TDM_INTEN_TXPTRUPD_Pos (6UL)               /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTEN_TXPTRUPD_Msk (0x1UL << TDM_INTEN_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                            */
  #define TDM_INTEN_TXPTRUPD_Min (0x0UL)             /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTEN_TXPTRUPD_Max (0x1UL)             /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTEN_TXPTRUPD_Disabled (0x0UL)        /*!< Disable                                                              */
  #define TDM_INTEN_TXPTRUPD_Enabled (0x1UL)         /*!< Enable                                                               */

/* MAXCNT @Bit 8 : Enable or disable interrupt for event MAXCNT */
  #define TDM_INTEN_MAXCNT_Pos (8UL)                 /*!< Position of MAXCNT field.                                            */
  #define TDM_INTEN_MAXCNT_Msk (0x1UL << TDM_INTEN_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                                  */
  #define TDM_INTEN_MAXCNT_Min (0x0UL)               /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTEN_MAXCNT_Max (0x1UL)               /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTEN_MAXCNT_Disabled (0x0UL)          /*!< Disable                                                              */
  #define TDM_INTEN_MAXCNT_Enabled (0x1UL)           /*!< Enable                                                               */

/* BUSERROR_RX @Bit 9 : Enable or disable interrupt for event BUSERROR_RX */
  #define TDM_INTEN_BUSERROR_RX_Pos (9UL)            /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTEN_BUSERROR_RX_Msk (0x1UL << TDM_INTEN_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.                   */
  #define TDM_INTEN_BUSERROR_RX_Min (0x0UL)          /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTEN_BUSERROR_RX_Max (0x1UL)          /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTEN_BUSERROR_RX_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TDM_INTEN_BUSERROR_RX_Enabled (0x1UL)      /*!< Enable                                                               */

/* BUSERROR_TX @Bit 10 : Enable or disable interrupt for event BUSERROR_TX */
  #define TDM_INTEN_BUSERROR_TX_Pos (10UL)           /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTEN_BUSERROR_TX_Msk (0x1UL << TDM_INTEN_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.                   */
  #define TDM_INTEN_BUSERROR_TX_Min (0x0UL)          /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTEN_BUSERROR_TX_Max (0x1UL)          /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTEN_BUSERROR_TX_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TDM_INTEN_BUSERROR_TX_Enabled (0x1UL)      /*!< Enable                                                               */


/* TDM_INTENSET: Enable interrupt */
  #define TDM_INTENSET_ResetValue (0x00000000UL)     /*!< Reset value of INTENSET register.                                    */

/* RXPTRUPD @Bit 1 : Write '1' to enable interrupt for event RXPTRUPD */
  #define TDM_INTENSET_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTENSET_RXPTRUPD_Msk (0x1UL << TDM_INTENSET_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define TDM_INTENSET_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENSET_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENSET_RXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to enable interrupt for event STOPPED */
  #define TDM_INTENSET_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define TDM_INTENSET_STOPPED_Msk (0x1UL << TDM_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TDM_INTENSET_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTENSET_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTENSET_STOPPED_Set (0x1UL)           /*!< Enable                                                               */
  #define TDM_INTENSET_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ABORTED @Bit 3 : Write '1' to enable interrupt for event ABORTED */
  #define TDM_INTENSET_ABORTED_Pos (3UL)             /*!< Position of ABORTED field.                                           */
  #define TDM_INTENSET_ABORTED_Msk (0x1UL << TDM_INTENSET_ABORTED_Pos) /*!< Bit mask of ABORTED field.                         */
  #define TDM_INTENSET_ABORTED_Min (0x0UL)           /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTENSET_ABORTED_Max (0x1UL)           /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTENSET_ABORTED_Set (0x1UL)           /*!< Enable                                                               */
  #define TDM_INTENSET_ABORTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_ABORTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 6 : Write '1' to enable interrupt for event TXPTRUPD */
  #define TDM_INTENSET_TXPTRUPD_Pos (6UL)            /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTENSET_TXPTRUPD_Msk (0x1UL << TDM_INTENSET_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define TDM_INTENSET_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENSET_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENSET_TXPTRUPD_Set (0x1UL)          /*!< Enable                                                               */
  #define TDM_INTENSET_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* MAXCNT @Bit 8 : Write '1' to enable interrupt for event MAXCNT */
  #define TDM_INTENSET_MAXCNT_Pos (8UL)              /*!< Position of MAXCNT field.                                            */
  #define TDM_INTENSET_MAXCNT_Msk (0x1UL << TDM_INTENSET_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                            */
  #define TDM_INTENSET_MAXCNT_Min (0x0UL)            /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTENSET_MAXCNT_Max (0x1UL)            /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTENSET_MAXCNT_Set (0x1UL)            /*!< Enable                                                               */
  #define TDM_INTENSET_MAXCNT_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_MAXCNT_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BUSERROR_RX @Bit 9 : Write '1' to enable interrupt for event BUSERROR_RX */
  #define TDM_INTENSET_BUSERROR_RX_Pos (9UL)         /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTENSET_BUSERROR_RX_Msk (0x1UL << TDM_INTENSET_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.             */
  #define TDM_INTENSET_BUSERROR_RX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENSET_BUSERROR_RX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENSET_BUSERROR_RX_Set (0x1UL)       /*!< Enable                                                               */
  #define TDM_INTENSET_BUSERROR_RX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_BUSERROR_RX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BUSERROR_TX @Bit 10 : Write '1' to enable interrupt for event BUSERROR_TX */
  #define TDM_INTENSET_BUSERROR_TX_Pos (10UL)        /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTENSET_BUSERROR_TX_Msk (0x1UL << TDM_INTENSET_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.             */
  #define TDM_INTENSET_BUSERROR_TX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENSET_BUSERROR_TX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENSET_BUSERROR_TX_Set (0x1UL)       /*!< Enable                                                               */
  #define TDM_INTENSET_BUSERROR_TX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENSET_BUSERROR_TX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TDM_INTENCLR: Disable interrupt */
  #define TDM_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

