NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* RXPTRUPD @Bit 1 : Write '1' to disable interrupt for event RXPTRUPD */
  #define TDM_INTENCLR_RXPTRUPD_Pos (1UL)            /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTENCLR_RXPTRUPD_Msk (0x1UL << TDM_INTENCLR_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                      */
  #define TDM_INTENCLR_RXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTENCLR_RXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_RXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_RXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* STOPPED @Bit 2 : Write '1' to disable interrupt for event STOPPED */
  #define TDM_INTENCLR_STOPPED_Pos (2UL)             /*!< Position of STOPPED field.                                           */
  #define TDM_INTENCLR_STOPPED_Msk (0x1UL << TDM_INTENCLR_STOPPED_Pos) /*!< Bit mask of STOPPED field.                         */
  #define TDM_INTENCLR_STOPPED_Min (0x0UL)           /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Max (0x1UL)           /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTENCLR_STOPPED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_STOPPED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_STOPPED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* ABORTED @Bit 3 : Write '1' to disable interrupt for event ABORTED */
  #define TDM_INTENCLR_ABORTED_Pos (3UL)             /*!< Position of ABORTED field.                                           */
  #define TDM_INTENCLR_ABORTED_Msk (0x1UL << TDM_INTENCLR_ABORTED_Pos) /*!< Bit mask of ABORTED field.                         */
  #define TDM_INTENCLR_ABORTED_Min (0x0UL)           /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Max (0x1UL)           /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTENCLR_ABORTED_Clear (0x1UL)         /*!< Disable                                                              */
  #define TDM_INTENCLR_ABORTED_Disabled (0x0UL)      /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_ABORTED_Enabled (0x1UL)       /*!< Read: Enabled                                                        */

/* TXPTRUPD @Bit 6 : Write '1' to disable interrupt for event TXPTRUPD */
  #define TDM_INTENCLR_TXPTRUPD_Pos (6UL)            /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTENCLR_TXPTRUPD_Msk (0x1UL << TDM_INTENCLR_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                      */
  #define TDM_INTENCLR_TXPTRUPD_Min (0x0UL)          /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Max (0x1UL)          /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTENCLR_TXPTRUPD_Clear (0x1UL)        /*!< Disable                                                              */
  #define TDM_INTENCLR_TXPTRUPD_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_TXPTRUPD_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* MAXCNT @Bit 8 : Write '1' to disable interrupt for event MAXCNT */
  #define TDM_INTENCLR_MAXCNT_Pos (8UL)              /*!< Position of MAXCNT field.                                            */
  #define TDM_INTENCLR_MAXCNT_Msk (0x1UL << TDM_INTENCLR_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                            */
  #define TDM_INTENCLR_MAXCNT_Min (0x0UL)            /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Max (0x1UL)            /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTENCLR_MAXCNT_Clear (0x1UL)          /*!< Disable                                                              */
  #define TDM_INTENCLR_MAXCNT_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_MAXCNT_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* BUSERROR_RX @Bit 9 : Write '1' to disable interrupt for event BUSERROR_RX */
  #define TDM_INTENCLR_BUSERROR_RX_Pos (9UL)         /*!< Position of BUSERROR_RX field.                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_RX_Pos) /*!< Bit mask of BUSERROR_RX field.             */
  #define TDM_INTENCLR_BUSERROR_RX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_RX field.                           */
  #define TDM_INTENCLR_BUSERROR_RX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_RX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_RX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* BUSERROR_TX @Bit 10 : Write '1' to disable interrupt for event BUSERROR_TX */
  #define TDM_INTENCLR_BUSERROR_TX_Pos (10UL)        /*!< Position of BUSERROR_TX field.                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Msk (0x1UL << TDM_INTENCLR_BUSERROR_TX_Pos) /*!< Bit mask of BUSERROR_TX field.             */
  #define TDM_INTENCLR_BUSERROR_TX_Min (0x0UL)       /*!< Min enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Max (0x1UL)       /*!< Max enumerator value of BUSERROR_TX field.                           */
  #define TDM_INTENCLR_BUSERROR_TX_Clear (0x1UL)     /*!< Disable                                                              */
  #define TDM_INTENCLR_BUSERROR_TX_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define TDM_INTENCLR_BUSERROR_TX_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


/* TDM_INTPEND: Pending interrupts */
  #define TDM_INTPEND_ResetValue (0x00000000UL)      /*!< Reset value of INTPEND register.                                     */

/* RXPTRUPD @Bit 1 : Read pending status of interrupt for event RXPTRUPD */
  #define TDM_INTPEND_RXPTRUPD_Pos (1UL)             /*!< Position of RXPTRUPD field.                                          */
  #define TDM_INTPEND_RXPTRUPD_Msk (0x1UL << TDM_INTPEND_RXPTRUPD_Pos) /*!< Bit mask of RXPTRUPD field.                        */
  #define TDM_INTPEND_RXPTRUPD_Min (0x0UL)           /*!< Min enumerator value of RXPTRUPD field.                              */
  #define TDM_INTPEND_RXPTRUPD_Max (0x1UL)           /*!< Max enumerator value of RXPTRUPD field.                              */
  #define TDM_INTPEND_RXPTRUPD_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define TDM_INTPEND_RXPTRUPD_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* STOPPED @Bit 2 : Read pending status of interrupt for event STOPPED */
  #define TDM_INTPEND_STOPPED_Pos (2UL)              /*!< Position of STOPPED field.                                           */
  #define TDM_INTPEND_STOPPED_Msk (0x1UL << TDM_INTPEND_STOPPED_Pos) /*!< Bit mask of STOPPED field.                           */
  #define TDM_INTPEND_STOPPED_Min (0x0UL)            /*!< Min enumerator value of STOPPED field.                               */
  #define TDM_INTPEND_STOPPED_Max (0x1UL)            /*!< Max enumerator value of STOPPED field.                               */
  #define TDM_INTPEND_STOPPED_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define TDM_INTPEND_STOPPED_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* ABORTED @Bit 3 : Read pending status of interrupt for event ABORTED */
  #define TDM_INTPEND_ABORTED_Pos (3UL)              /*!< Position of ABORTED field.                                           */
  #define TDM_INTPEND_ABORTED_Msk (0x1UL << TDM_INTPEND_ABORTED_Pos) /*!< Bit mask of ABORTED field.                           */
  #define TDM_INTPEND_ABORTED_Min (0x0UL)            /*!< Min enumerator value of ABORTED field.                               */
  #define TDM_INTPEND_ABORTED_Max (0x1UL)            /*!< Max enumerator value of ABORTED field.                               */
  #define TDM_INTPEND_ABORTED_NotPending (0x0UL)     /*!< Read: Not pending                                                    */
  #define TDM_INTPEND_ABORTED_Pending (0x1UL)        /*!< Read: Pending                                                        */

/* TXPTRUPD @Bit 6 : Read pending status of interrupt for event TXPTRUPD */
  #define TDM_INTPEND_TXPTRUPD_Pos (6UL)             /*!< Position of TXPTRUPD field.                                          */
  #define TDM_INTPEND_TXPTRUPD_Msk (0x1UL << TDM_INTPEND_TXPTRUPD_Pos) /*!< Bit mask of TXPTRUPD field.                        */
  #define TDM_INTPEND_TXPTRUPD_Min (0x0UL)           /*!< Min enumerator value of TXPTRUPD field.                              */
  #define TDM_INTPEND_TXPTRUPD_Max (0x1UL)           /*!< Max enumerator value of TXPTRUPD field.                              */
  #define TDM_INTPEND_TXPTRUPD_NotPending (0x0UL)    /*!< Read: Not pending                                                    */
  #define TDM_INTPEND_TXPTRUPD_Pending (0x1UL)       /*!< Read: Pending                                                        */

/* MAXCNT @Bit 8 : Read pending status of interrupt for event MAXCNT */
  #define TDM_INTPEND_MAXCNT_Pos (8UL)               /*!< Position of MAXCNT field.                                            */
  #define TDM_INTPEND_MAXCNT_Msk (0x1UL << TDM_INTPEND_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.                              */
  #define TDM_INTPEND_MAXCNT_Min (0x0UL)             /*!< Min enumerator value of MAXCNT field.                                */
  #define TDM_INTPEND_MAXCNT_Max (0x1UL)             /*!< Max enumerator value of MAXCNT field.                                */
  #define TDM_INTPEND_MAXCNT_NotPending (0x0UL)      /*!< Read: Not pending                                                    */
  #define TDM_INTPEND_MAXCNT_Pending (0x1UL)         /*!< Read: Pending                                                        */

