NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* DMARXMATCH2 @Bit 24 : Enable or disable interrupt for event DMARXMATCH[2] */
  #define TWIS_INTEN_DMARXMATCH2_Pos (24UL)          /*!< Position of DMARXMATCH2 field.                                       */
  #define TWIS_INTEN_DMARXMATCH2_Msk (0x1UL << TWIS_INTEN_DMARXMATCH2_Pos) /*!< Bit mask of DMARXMATCH2 field.                 */
  #define TWIS_INTEN_DMARXMATCH2_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTEN_DMARXMATCH2_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH2 field.                           */
  #define TWIS_INTEN_DMARXMATCH2_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH2_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMARXMATCH3 @Bit 25 : Enable or disable interrupt for event DMARXMATCH[3] */
  #define TWIS_INTEN_DMARXMATCH3_Pos (25UL)          /*!< Position of DMARXMATCH3 field.                                       */
  #define TWIS_INTEN_DMARXMATCH3_Msk (0x1UL << TWIS_INTEN_DMARXMATCH3_Pos) /*!< Bit mask of DMARXMATCH3 field.                 */
  #define TWIS_INTEN_DMARXMATCH3_Min (0x0UL)         /*!< Min enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTEN_DMARXMATCH3_Max (0x1UL)         /*!< Max enumerator value of DMARXMATCH3 field.                           */
  #define TWIS_INTEN_DMARXMATCH3_Disabled (0x0UL)    /*!< Disable                                                              */
  #define TWIS_INTEN_DMARXMATCH3_Enabled (0x1UL)     /*!< Enable                                                               */

/* DMATXEND @Bit 26 : Enable or disable interrupt for event DMATXEND */
  #define TWIS_INTEN_DMATXEND_Pos (26UL)             /*!< Position of DMATXEND field.                                          */
  #define TWIS_INTEN_DMATXEND_Msk (0x1UL << TWIS_INTEN_DMATXEND_Pos) /*!< Bit mask of DMATXEND field.                          */
  #define TWIS_INTEN_DMATXEND_Min (0x0UL)            /*!< Min enumerator value of DMATXEND field.                              */
  #define TWIS_INTEN_DMATXEND_Max (0x1UL)            /*!< Max enumerator value of DMATXEND field.                              */
  #define TWIS_INTEN_DMATXEND_Disabled (0x0UL)       /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXEND_Enabled (0x1UL)        /*!< Enable                                                               */

/* DMATXREADY @Bit 27 : Enable or disable interrupt for event DMATXREADY */
  #define TWIS_INTEN_DMATXREADY_Pos (27UL)           /*!< Position of DMATXREADY field.                                        */
  #define TWIS_INTEN_DMATXREADY_Msk (0x1UL << TWIS_INTEN_DMATXREADY_Pos) /*!< Bit mask of DMATXREADY field.                    */
  #define TWIS_INTEN_DMATXREADY_Min (0x0UL)          /*!< Min enumerator value of DMATXREADY field.                            */
  #define TWIS_INTEN_DMATXREADY_Max (0x1UL)          /*!< Max enumerator value of DMATXREADY field.                            */
  #define TWIS_INTEN_DMATXREADY_Disabled (0x0UL)     /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXREADY_Enabled (0x1UL)      /*!< Enable                                                               */

/* DMATXBUSERROR @Bit 28 : Enable or disable interrupt for event DMATXBUSERROR */
  #define TWIS_INTEN_DMATXBUSERROR_Pos (28UL)        /*!< Position of DMATXBUSERROR field.                                     */
  #define TWIS_INTEN_DMATXBUSERROR_Msk (0x1UL << TWIS_INTEN_DMATXBUSERROR_Pos) /*!< Bit mask of DMATXBUSERROR field.           */
  #define TWIS_INTEN_DMATXBUSERROR_Min (0x0UL)       /*!< Min enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTEN_DMATXBUSERROR_Max (0x1UL)       /*!< Max enumerator value of DMATXBUSERROR field.                         */
  #define TWIS_INTEN_DMATXBUSERROR_Disabled (0x0UL)  /*!< Disable                                                              */
  #define TWIS_INTEN_DMATXBUSERROR_Enabled (0x1UL)   /*!< Enable                                                               */


/* TWIS_INTENSET: Enable interrupt */
  #define TWIS_INTENSET_ResetValue (0x00000000UL)    /*!< Reset value of INTENSET register.                                    */

/* STOPPED @Bit 1 : Write '1' to enable interrupt for event STOPPED */
  #define TWIS_INTENSET_STOPPED_Pos (1UL)            /*!< Position of STOPPED field.                                           */
  #define TWIS_INTENSET_STOPPED_Msk (0x1UL << TWIS_INTENSET_STOPPED_Pos) /*!< Bit mask of STOPPED field.                       */
  #define TWIS_INTENSET_STOPPED_Min (0x0UL)          /*!< Min enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Max (0x1UL)          /*!< Max enumerator value of STOPPED field.                               */
  #define TWIS_INTENSET_STOPPED_Set (0x1UL)          /*!< Enable                                                               */
  #define TWIS_INTENSET_STOPPED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_STOPPED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* ERROR @Bit 5 : Write '1' to enable interrupt for event ERROR */
  #define TWIS_INTENSET_ERROR_Pos (5UL)              /*!< Position of ERROR field.                                             */
  #define TWIS_INTENSET_ERROR_Msk (0x1UL << TWIS_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                             */
  #define TWIS_INTENSET_ERROR_Min (0x0UL)            /*!< Min enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Max (0x1UL)            /*!< Max enumerator value of ERROR field.                                 */
  #define TWIS_INTENSET_ERROR_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_ERROR_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_ERROR_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

/* WRITE @Bit 15 : Write '1' to enable interrupt for event WRITE */
  #define TWIS_INTENSET_WRITE_Pos (15UL)             /*!< Position of WRITE field.                                             */
  #define TWIS_INTENSET_WRITE_Msk (0x1UL << TWIS_INTENSET_WRITE_Pos) /*!< Bit mask of WRITE field.                             */
  #define TWIS_INTENSET_WRITE_Min (0x0UL)            /*!< Min enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Max (0x1UL)            /*!< Max enumerator value of WRITE field.                                 */
  #define TWIS_INTENSET_WRITE_Set (0x1UL)            /*!< Enable                                                               */
  #define TWIS_INTENSET_WRITE_Disabled (0x0UL)       /*!< Read: Disabled                                                       */
  #define TWIS_INTENSET_WRITE_Enabled (0x1UL)        /*!< Read: Enabled                                                        */

