NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* TASKS_FLUSHRX @Bit 0 : Flush RX FIFO into RX buffer */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos (0UL) /*!< Position of TASKS_FLUSHRX field.                                    */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Msk (0x1UL << UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Pos) /*!< Bit mask of TASKS_FLUSHRX
                                                                            field.*/
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Min (0x1UL) /*!< Min enumerator value of TASKS_FLUSHRX field.                      */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Max (0x1UL) /*!< Max enumerator value of TASKS_FLUSHRX field.                      */
  #define UARTE_TASKS_FLUSHRX_TASKS_FLUSHRX_Trigger (0x1UL) /*!< Trigger task                                                  */


/* UARTE_SUBSCRIBE_FLUSHRX: Subscribe configuration for task FLUSHRX */
  #define UARTE_SUBSCRIBE_FLUSHRX_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_FLUSHRX register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that task FLUSHRX will subscribe to */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Msk (0xFFUL << UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define UARTE_SUBSCRIBE_FLUSHRX_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Msk (0x1UL << UARTE_SUBSCRIBE_FLUSHRX_EN_Pos) /*!< Bit mask of EN field.                  */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Disabled (0x0UL) /*!< Disable subscription                                                */
  #define UARTE_SUBSCRIBE_FLUSHRX_EN_Enabled (0x1UL) /*!< Enable subscription                                                  */


/* UARTE_EVENTS_CTS: CTS is activated (set low). Clear To Send. */
  #define UARTE_EVENTS_CTS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_CTS register.                                  */

/* EVENTS_CTS @Bit 0 : CTS is activated (set low). Clear To Send. */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Pos (0UL)      /*!< Position of EVENTS_CTS field.                                        */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Msk (0x1UL << UARTE_EVENTS_CTS_EVENTS_CTS_Pos) /*!< Bit mask of EVENTS_CTS field.        */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Min (0x0UL)    /*!< Min enumerator value of EVENTS_CTS field.                            */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Max (0x1UL)    /*!< Max enumerator value of EVENTS_CTS field.                            */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define UARTE_EVENTS_CTS_EVENTS_CTS_Generated (0x1UL) /*!< Event generated                                                   */


/* UARTE_EVENTS_NCTS: CTS is deactivated (set high). Not Clear To Send. */
  #define UARTE_EVENTS_NCTS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_NCTS register.                                */

/* EVENTS_NCTS @Bit 0 : CTS is deactivated (set high). Not Clear To Send. */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos (0UL)    /*!< Position of EVENTS_NCTS field.                                       */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Msk (0x1UL << UARTE_EVENTS_NCTS_EVENTS_NCTS_Pos) /*!< Bit mask of EVENTS_NCTS field.   */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Min (0x0UL)  /*!< Min enumerator value of EVENTS_NCTS field.                           */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Max (0x1UL)  /*!< Max enumerator value of EVENTS_NCTS field.                           */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define UARTE_EVENTS_NCTS_EVENTS_NCTS_Generated (0x1UL) /*!< Event generated                                                 */


/* UARTE_EVENTS_TXDRDY: Data sent from TXD */
  #define UARTE_EVENTS_TXDRDY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXDRDY register.                            */

/* EVENTS_TXDRDY @Bit 0 : Data sent from TXD */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos (0UL) /*!< Position of EVENTS_TXDRDY field.                                    */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Msk (0x1UL << UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Pos) /*!< Bit mask of EVENTS_TXDRDY
                                                                            field.*/
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXDRDY field.                      */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXDRDY field.                      */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define UARTE_EVENTS_TXDRDY_EVENTS_TXDRDY_Generated (0x1UL) /*!< Event generated                                             */


/* UARTE_EVENTS_RXDRDY: Data received in RXD (but potentially not yet transferred to Data RAM) */
  #define UARTE_EVENTS_RXDRDY_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_RXDRDY register.                            */

/* EVENTS_RXDRDY @Bit 0 : Data received in RXD (but potentially not yet transferred to Data RAM) */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos (0UL) /*!< Position of EVENTS_RXDRDY field.                                    */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Msk (0x1UL << UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Pos) /*!< Bit mask of EVENTS_RXDRDY
                                                                            field.*/
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Min (0x0UL) /*!< Min enumerator value of EVENTS_RXDRDY field.                      */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Max (0x1UL) /*!< Max enumerator value of EVENTS_RXDRDY field.                      */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define UARTE_EVENTS_RXDRDY_EVENTS_RXDRDY_Generated (0x1UL) /*!< Event generated                                             */


/* UARTE_EVENTS_ERROR: Error detected */
  #define UARTE_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                              */

/* EVENTS_ERROR @Bit 0 : Error detected */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)  /*!< Position of EVENTS_ERROR field.                                      */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << UARTE_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR
                                                                            field.*/
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ERROR field.                         */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ERROR field.                         */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define UARTE_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                               */


