NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* PRTADDR @Bits 0..6 : Port Address (PrtAddr) */
  #define USBHSCORE_HC_SPLT_PRTADDR_Pos (0UL)        /*!< Position of PRTADDR field.                                           */
  #define USBHSCORE_HC_SPLT_PRTADDR_Msk (0x7FUL << USBHSCORE_HC_SPLT_PRTADDR_Pos) /*!< Bit mask of PRTADDR field.              */

/* HUBADDR @Bits 7..13 : Hub Address (HubAddr) */
  #define USBHSCORE_HC_SPLT_HUBADDR_Pos (7UL)        /*!< Position of HUBADDR field.                                           */
  #define USBHSCORE_HC_SPLT_HUBADDR_Msk (0x7FUL << USBHSCORE_HC_SPLT_HUBADDR_Pos) /*!< Bit mask of HUBADDR field.              */

/* XACTPOS @Bits 14..15 : Transaction Position (XactPos) */
  #define USBHSCORE_HC_SPLT_XACTPOS_Pos (14UL)       /*!< Position of XACTPOS field.                                           */
  #define USBHSCORE_HC_SPLT_XACTPOS_Msk (0x3UL << USBHSCORE_HC_SPLT_XACTPOS_Pos) /*!< Bit mask of XACTPOS field.               */
  #define USBHSCORE_HC_SPLT_XACTPOS_Min (0x0UL)      /*!< Min enumerator value of XACTPOS field.                               */
  #define USBHSCORE_HC_SPLT_XACTPOS_Max (0x3UL)      /*!< Max enumerator value of XACTPOS field.                               */
  #define USBHSCORE_HC_SPLT_XACTPOS_MIDDLE (0x0UL)   /*!< Mid. This is the middle payload of this transaction (which is larger
                                                          than 188 bytes)*/
  #define USBHSCORE_HC_SPLT_XACTPOS_END (0x1UL)      /*!< End. This is the last payload of this transaction (which is larger
                                                          than 188 bytes)*/
  #define USBHSCORE_HC_SPLT_XACTPOS_BEGIN (0x2UL)    /*!< Begin. This is the first data payload of this transaction (which is
                                                          larger than 188 bytes)*/
  #define USBHSCORE_HC_SPLT_XACTPOS_ALL (0x3UL)      /*!< All. This is the entire data payload of this transaction (which is
                                                          less than or equal to 188 bytes)*/

/* COMPSPLT @Bit 16 : Do Complete Split (CompSplt) */
  #define USBHSCORE_HC_SPLT_COMPSPLT_Pos (16UL)      /*!< Position of COMPSPLT field.                                          */
  #define USBHSCORE_HC_SPLT_COMPSPLT_Msk (0x1UL << USBHSCORE_HC_SPLT_COMPSPLT_Pos) /*!< Bit mask of COMPSPLT field.            */
  #define USBHSCORE_HC_SPLT_COMPSPLT_Min (0x0UL)     /*!< Min enumerator value of COMPSPLT field.                              */
  #define USBHSCORE_HC_SPLT_COMPSPLT_Max (0x1UL)     /*!< Max enumerator value of COMPSPLT field.                              */
  #define USBHSCORE_HC_SPLT_COMPSPLT_NOSPLIT (0x0UL) /*!< No complete split transaction                                        */
  #define USBHSCORE_HC_SPLT_COMPSPLT_SPLIT (0x1UL)   /*!< Complete Split transaction                                           */

/* SPLTENA @Bit 31 : Split Enable (SpltEna) */
  #define USBHSCORE_HC_SPLT_SPLTENA_Pos (31UL)       /*!< Position of SPLTENA field.                                           */
  #define USBHSCORE_HC_SPLT_SPLTENA_Msk (0x1UL << USBHSCORE_HC_SPLT_SPLTENA_Pos) /*!< Bit mask of SPLTENA field.               */
  #define USBHSCORE_HC_SPLT_SPLTENA_Min (0x0UL)      /*!< Min enumerator value of SPLTENA field.                               */
  #define USBHSCORE_HC_SPLT_SPLTENA_Max (0x1UL)      /*!< Max enumerator value of SPLTENA field.                               */
  #define USBHSCORE_HC_SPLT_SPLTENA_DISABLED (0x0UL) /*!< Split not enabled                                                    */
  #define USBHSCORE_HC_SPLT_SPLTENA_ENABLED (0x1UL)  /*!< Split enabled                                                        */


/* USBHSCORE_HC_INT: Host Channel Interrupt Register 0 */
  #define USBHSCORE_HC_INT_ResetValue (0x00000000UL) /*!< Reset value of INT register.                                         */

/* XFERCOMPL @Bit 0 : Transfer Completed (XferCompl) */
  #define USBHSCORE_HC_INT_XFERCOMPL_Pos (0UL)       /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_HC_INT_XFERCOMPL_Msk (0x1UL << USBHSCORE_HC_INT_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.           */
  #define USBHSCORE_HC_INT_XFERCOMPL_Min (0x0UL)     /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_Max (0x1UL)     /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_HC_INT_XFERCOMPL_INACTIVE (0x0UL) /*!< Transfer in progress or No Active Transfer                          */
  #define USBHSCORE_HC_INT_XFERCOMPL_ACTIVE (0x1UL)  /*!< Transfer completed normally without any errors                       */

/* CHHLTD @Bit 1 : Channel Halted (ChHltd) */
  #define USBHSCORE_HC_INT_CHHLTD_Pos (1UL)          /*!< Position of CHHLTD field.                                            */
  #define USBHSCORE_HC_INT_CHHLTD_Msk (0x1UL << USBHSCORE_HC_INT_CHHLTD_Pos) /*!< Bit mask of CHHLTD field.                    */
  #define USBHSCORE_HC_INT_CHHLTD_Min (0x0UL)        /*!< Min enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_Max (0x1UL)        /*!< Max enumerator value of CHHLTD field.                                */
  #define USBHSCORE_HC_INT_CHHLTD_INACTIVE (0x0UL)   /*!< Channel not halted                                                   */
  #define USBHSCORE_HC_INT_CHHLTD_ACTIVE (0x1UL)     /*!< Channel Halted                                                       */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_HC_INT_AHBERR_Pos (2UL)          /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_HC_INT_AHBERR_Msk (0x1UL << USBHSCORE_HC_INT_AHBERR_Pos) /*!< Bit mask of AHBERR field.                    */
  #define USBHSCORE_HC_INT_AHBERR_Min (0x0UL)        /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_Max (0x1UL)        /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_HC_INT_AHBERR_INACTIVE (0x0UL)   /*!< No AHB error                                                         */
  #define USBHSCORE_HC_INT_AHBERR_ACTIVE (0x1UL)     /*!< AHB error during AHB read/write                                      */

/* STALL @Bit 3 : STALL Response Received Interrupt (STALL) */
  #define USBHSCORE_HC_INT_STALL_Pos (3UL)           /*!< Position of STALL field.                                             */
  #define USBHSCORE_HC_INT_STALL_Msk (0x1UL << USBHSCORE_HC_INT_STALL_Pos) /*!< Bit mask of STALL field.                       */
  #define USBHSCORE_HC_INT_STALL_Min (0x0UL)         /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_Max (0x1UL)         /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_HC_INT_STALL_INACTIVE (0x0UL)    /*!< No Stall Response Received Interrupt                                 */
  #define USBHSCORE_HC_INT_STALL_ACTIVE (0x1UL)      /*!< Stall Response Received Interrupt                                    */

