NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* XFERSIZE @Bits 0..18 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Pos (0UL)       /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_HC_TSIZ_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_HC_TSIZ_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.        */

/* PKTCNT @Bits 19..28 : Non-Scatter/Gather DMA Mode: */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Pos (19UL)        /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_HC_TSIZ_PKTCNT_Msk (0x3FFUL << USBHSCORE_HC_TSIZ_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.                */

/* PID @Bits 29..30 : PID (Pid) */
  #define USBHSCORE_HC_TSIZ_PID_Pos (29UL)           /*!< Position of PID field.                                               */
  #define USBHSCORE_HC_TSIZ_PID_Msk (0x3UL << USBHSCORE_HC_TSIZ_PID_Pos) /*!< Bit mask of PID field.                           */
  #define USBHSCORE_HC_TSIZ_PID_Min (0x0UL)          /*!< Min enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_Max (0x3UL)          /*!< Max enumerator value of PID field.                                   */
  #define USBHSCORE_HC_TSIZ_PID_DATA0 (0x0UL)        /*!< DATA0                                                                */
  #define USBHSCORE_HC_TSIZ_PID_DATA2 (0x1UL)        /*!< DATA2                                                                */
  #define USBHSCORE_HC_TSIZ_PID_DATA1 (0x2UL)        /*!< DATA1                                                                */
  #define USBHSCORE_HC_TSIZ_PID_MDATA (0x3UL)        /*!< MDATA (non-control)/SETUP (control)                                  */

/* DOPNG @Bit 31 : Do Ping (DoPng) */
  #define USBHSCORE_HC_TSIZ_DOPNG_Pos (31UL)         /*!< Position of DOPNG field.                                             */
  #define USBHSCORE_HC_TSIZ_DOPNG_Msk (0x1UL << USBHSCORE_HC_TSIZ_DOPNG_Pos) /*!< Bit mask of DOPNG field.                     */
  #define USBHSCORE_HC_TSIZ_DOPNG_Min (0x0UL)        /*!< Min enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_Max (0x1UL)        /*!< Max enumerator value of DOPNG field.                                 */
  #define USBHSCORE_HC_TSIZ_DOPNG_NOPING (0x0UL)     /*!< No ping protocol                                                     */
  #define USBHSCORE_HC_TSIZ_DOPNG_PING (0x1UL)       /*!< Ping protocol                                                        */


/* USBHSCORE_HC_DMA: Host Channel DMA Address Register 0 */
  #define USBHSCORE_HC_DMA_ResetValue (0x00000000UL) /*!< Reset value of DMA register.                                         */

/* DMAADDR @Bits 0..31 : In Buffer DMA Mode: */
  #define USBHSCORE_HC_DMA_DMAADDR_Pos (0UL)         /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_HC_DMA_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_HC_DMA_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.          */



/* ============================================== Struct USBHSCORE_DWCOTGDFIFO =============================================== */
/**
  * @brief DWCOTGDFIFO [USBHSCORE_DWCOTGDFIFO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[1024];                        /*!< (@ 0x00000000) Data FIFO Access Register Map 0                       */
} NRF_USBHSCORE_DWCOTGDFIFO_Type;                    /*!< Size = 4096 (0x1000)                                                 */
  #define USBHSCORE_DWCOTGDFIFO_MaxCount (16UL)      /*!< Size of DWCOTGDFIFO[16] array.                                       */
  #define USBHSCORE_DWCOTGDFIFO_MaxIndex (15UL)      /*!< Max index of DWCOTGDFIFO[16] array.                                  */
  #define USBHSCORE_DWCOTGDFIFO_MinIndex (0UL)       /*!< Min index of DWCOTGDFIFO[16] array.                                  */


/* ======================================== Struct USBHSCORE_DWCOTGDFIFODIRECTACCESS ========================================= */
/**
  * @brief DWCOTGDFIFODIRECTACCESS [USBHSCORE_DWCOTGDFIFODIRECTACCESS] (unspecified)
  */
typedef struct {
  __IOM uint32_t  DATA[3072];                        /*!< (@ 0x00000000) Data FIFO Direct Access Register Map                  */
  __IM  uint32_t  RESERVED[29696];
} NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type;        /*!< Size = 131072 (0x20000)                                              */

/* ==================================================== Struct USBHSCORE ===================================================== */
/**
  * @brief USBHSCORE
  */
  typedef struct {                                   /*!< USBHSCORE Structure                                                  */
    __IOM uint32_t GOTGCTL;                          /*!< (@ 0x00000000) Control and Status Register                           */
    __IOM uint32_t GOTGINT;                          /*!< (@ 0x00000004) Interrupt Register                                    */
    __IOM uint32_t GAHBCFG;                          /*!< (@ 0x00000008) AHB Configuration Register                            */
    __IOM uint32_t GUSBCFG;                          /*!< (@ 0x0000000C) USB Configuration Register                            */
    __IOM uint32_t GRSTCTL;                          /*!< (@ 0x00000010) Reset Register                                        */
    __IOM uint32_t GINTSTS;                          /*!< (@ 0x00000014) Interrupt STATUS Register                             */
    __IOM uint32_t GINTMSK;                          /*!< (@ 0x00000018) Interrupt Mask Register                               */
    __IOM uint32_t GRXSTSR;                          /*!< (@ 0x0000001C) Receive Status Debug Read Register                    */
    __IOM uint32_t GRXSTSP;                          /*!< (@ 0x00000020) Receive Status Read/Pop Register                      */
    __IOM uint32_t GRXFSIZ;                          /*!< (@ 0x00000024) Receive FIFO Size Register                            */
    __IOM uint32_t GNPTXFSIZ;                        /*!< (@ 0x00000028) Non-periodic Transmit FIFO Size Register              */
    __IOM uint32_t GNPTXSTS;                         /*!< (@ 0x0000002C) Non-periodic Transmit FIFO/Queue Status Register      */
    __IM uint32_t RESERVED[2];
    __IOM uint32_t GGPIO;                            /*!< (@ 0x00000038) General Purpose Input/Output Register                 */
    __IOM uint32_t GUID;                             /*!< (@ 0x0000003C) User ID Register                                      */
    __IOM uint32_t GSNPSID;                          /*!< (@ 0x00000040) Synopsys ID Register                                  */
    __IOM uint32_t GHWCFG1;                          /*!< (@ 0x00000044) User Hardware Configuration 1 Register                */
    __IOM uint32_t GHWCFG2;                          /*!< (@ 0x00000048) User Hardware Configuration 2 Register                */
    __IOM uint32_t GHWCFG3;                          /*!< (@ 0x0000004C) User Hardware Configuration 3 Register                */
    __IOM uint32_t GHWCFG4;                          /*!< (@ 0x00000050) User Hardware Configuration 4 Register                */
    __IOM uint32_t GLPMCFG;                          /*!< (@ 0x00000054) LPM Config Register                                   */
    __IOM uint32_t GPWRDN;                           /*!< (@ 0x00000058) Global Power Down Register                            */
    __IOM uint32_t GDFIFOCFG;                        /*!< (@ 0x0000005C) Global DFIFO Configuration Register                   */
    __IM uint32_t RESERVED1[2];
    __IOM uint32_t GINTMSK2;                         /*!< (@ 0x00000068) Interrupt Mask Register 2                             */
    __IOM uint32_t GINTSTS2;                         /*!< (@ 0x0000006C) Interrupt Register 2                                  */
    __IM uint32_t RESERVED2[36];
    __IOM uint32_t HPTXFSIZ;                         /*!< (@ 0x00000100) Host Periodic Transmit FIFO Size Register             */
    __IOM uint32_t DIEPTXF[16];                      /*!< (@ 0x00000104) Device IN Endpoint Transmit FIFO 1 Size Register      */
    __IM uint32_t RESERVED3[175];
    __IOM uint32_t HCFG;                             /*!< (@ 0x00000400) Host Configuration Register                           */
    __IOM uint32_t HFIR;                             /*!< (@ 0x00000404) Host Frame Interval Register                          */
    __IOM uint32_t HFNUM;                            /*!< (@ 0x00000408) Host Frame Number/Frame Time Remaining Register       */
    __IM uint32_t RESERVED4;
    __IOM uint32_t HPTXSTS;                          /*!< (@ 0x00000410) Host Periodic Transmit FIFO/Queue Status Register     */
    __IOM uint32_t HAINT;                            /*!< (@ 0x00000414) Host All Channels Interrupt Register                  */
    __IOM uint32_t HAINTMSK;                         /*!< (@ 0x00000418) Host All Channels Interrupt Mask Register             */
    __IM uint32_t RESERVED5[9];
    __IOM uint32_t HPRT;                             /*!< (@ 0x00000440) Host Port Control and Status Register                 */
    __IM uint32_t RESERVED6[47];
    __IOM NRF_USBHSCORE_HC_Type HC[16];              /*!< (@ 0x00000500) (unspecified)                                         */
    __IM uint32_t RESERVED7[96];
    __IOM uint32_t DCFG;                             /*!< (@ 0x00000800) Device Configuration Register                         */
    __IOM uint32_t DCTL;                             /*!< (@ 0x00000804) Device Control Register                               */
    __IOM uint32_t DSTS;                             /*!< (@ 0x00000808) Device Status Register                                */
    __IM uint32_t RESERVED8;
    __IOM uint32_t DIEPMSK;                          /*!< (@ 0x00000810) Device IN Endpoint Common Interrupt Mask Register     */
    __IOM uint32_t DOEPMSK;                          /*!< (@ 0x00000814) Device OUT Endpoint Common Interrupt Mask Register    */
    __IOM uint32_t DAINT;                            /*!< (@ 0x00000818) Device All Endpoints Interrupt Register               */
    __IOM uint32_t DAINTMSK;                         /*!< (@ 0x0000081C) Device All Endpoints Interrupt Mask Register          */
    __IM uint32_t RESERVED9[2];
    __IOM uint32_t DVBUSDIS;                         /*!< (@ 0x00000828) Device VBUS Discharge Time Register                   */
    __IOM uint32_t DVBUSPULSE;                       /*!< (@ 0x0000082C) Device VBUS Pulsing Time Register                     */
    __IOM uint32_t DTHRCTL;                          /*!< (@ 0x00000830) Device Threshold Control Register                     */
    __IOM uint32_t DIEPEMPMSK;                       /*!< (@ 0x00000834) Device IN Endpoint FIFO Empty Interrupt Mask Register */
    __IM uint32_t RESERVED10[50];
    __IOM uint32_t DIEPCTL0;                         /*!< (@ 0x00000900) Device Control IN Endpoint 0 Control Register         */
    __IM uint32_t RESERVED11;
    __IOM uint32_t DIEPINT0;                         /*!< (@ 0x00000908) Device IN Endpoint 0 Interrupt Register               */
    __IM uint32_t RESERVED12;
    __IOM uint32_t DIEPTSIZ0;                        /*!< (@ 0x00000910) Device IN Endpoint 0 Transfer Size Register           */
    __IOM uint32_t DIEPDMA0;                         /*!< (@ 0x00000914) Device IN Endpoint 0 DMA Address Register             */
    __IOM uint32_t DTXFSTS0;                         /*!< (@ 0x00000918) Device IN Endpoint Transmit FIFO Status Register 0    */
    __IM uint32_t RESERVED13;
    __IOM uint32_t DIEPCTL1;                         /*!< (@ 0x00000920) Device Control IN Endpoint Control Register 1         */
    __IM uint32_t RESERVED14;
    __IOM uint32_t DIEPINT1;                         /*!< (@ 0x00000928) Device IN Endpoint Interrupt Register 1               */
    __IM uint32_t RESERVED15;
    __IOM uint32_t DIEPTSIZ1;                        /*!< (@ 0x00000930) Device IN Endpoint Transfer Size Register 1           */
    __IOM uint32_t DIEPDMA1;                         /*!< (@ 0x00000934) Device IN Endpoint DMA Address Register 1             */
    __IOM uint32_t DTXFSTS1;                         /*!< (@ 0x00000938) Device IN Endpoint Transmit FIFO Status Register 1    */
    __IM uint32_t RESERVED16;
    __IOM uint32_t DIEPCTL2;                         /*!< (@ 0x00000940) Device Control IN Endpoint Control Register 2         */
    __IM uint32_t RESERVED17;
    __IOM uint32_t DIEPINT2;                         /*!< (@ 0x00000948) Device IN Endpoint Interrupt Register 2               */
    __IM uint32_t RESERVED18;
    __IOM uint32_t DIEPTSIZ2;                        /*!< (@ 0x00000950) Device IN Endpoint Transfer Size Register 2           */
    __IOM uint32_t DIEPDMA2;                         /*!< (@ 0x00000954) Device IN Endpoint DMA Address Register 2             */
    __IOM uint32_t DTXFSTS2;                         /*!< (@ 0x00000958) Device IN Endpoint Transmit FIFO Status Register 2    */
    __IM uint32_t RESERVED19;
    __IOM uint32_t DIEPCTL3;                         /*!< (@ 0x00000960) Device Control IN Endpoint Control Register 3         */
    __IM uint32_t RESERVED20;
    __IOM uint32_t DIEPINT3;                         /*!< (@ 0x00000968) Device IN Endpoint Interrupt Register 3               */
    __IM uint32_t RESERVED21;
    __IOM uint32_t DIEPTSIZ3;                        /*!< (@ 0x00000970) Device IN Endpoint Transfer Size Register 3           */
    __IOM uint32_t DIEPDMA3;                         /*!< (@ 0x00000974) Device IN Endpoint DMA Address Register 3             */
    __IOM uint32_t DTXFSTS3;                         /*!< (@ 0x00000978) Device IN Endpoint Transmit FIFO Status Register 3    */
    __IM uint32_t RESERVED22;
    __IOM uint32_t DIEPCTL4;                         /*!< (@ 0x00000980) Device Control IN Endpoint Control Register 4         */
    __IM uint32_t RESERVED23;
    __IOM uint32_t DIEPINT4;                         /*!< (@ 0x00000988) Device IN Endpoint Interrupt Register 4               */
    __IM uint32_t RESERVED24;
    __IOM uint32_t DIEPTSIZ4;                        /*!< (@ 0x00000990) Device IN Endpoint Transfer Size Register 4           */
    __IOM uint32_t DIEPDMA4;                         /*!< (@ 0x00000994) Device IN Endpoint DMA Address Register 4             */
    __IOM uint32_t DTXFSTS4;                         /*!< (@ 0x00000998) Device IN Endpoint Transmit FIFO Status Register 4    */
    __IM uint32_t RESERVED25;
    __IOM uint32_t DIEPCTL5;                         /*!< (@ 0x000009A0) Device Control IN Endpoint Control Register 5         */
    __IM uint32_t RESERVED26;
    __IOM uint32_t DIEPINT5;                         /*!< (@ 0x000009A8) Device IN Endpoint Interrupt Register 5               */
    __IM uint32_t RESERVED27;
    __IOM uint32_t DIEPTSIZ5;                        /*!< (@ 0x000009B0) Device IN Endpoint Transfer Size Register 5           */
    __IOM uint32_t DIEPDMA5;                         /*!< (@ 0x000009B4) Device IN Endpoint DMA Address Register 5             */
    __IOM uint32_t DTXFSTS5;                         /*!< (@ 0x000009B8) Device IN Endpoint Transmit FIFO Status Register 5    */
    __IM uint32_t RESERVED28;
    __IOM uint32_t DIEPCTL6;                         /*!< (@ 0x000009C0) Device Control IN Endpoint Control Register 6         */
    __IM uint32_t RESERVED29;
    __IOM uint32_t DIEPINT6;                         /*!< (@ 0x000009C8) Device IN Endpoint Interrupt Register 6               */
    __IM uint32_t RESERVED30;
    __IOM uint32_t DIEPTSIZ6;                        /*!< (@ 0x000009D0) Device IN Endpoint Transfer Size Register 6           */
    __IOM uint32_t DIEPDMA6;                         /*!< (@ 0x000009D4) Device IN Endpoint DMA Address Register 6             */
    __IOM uint32_t DTXFSTS6;                         /*!< (@ 0x000009D8) Device IN Endpoint Transmit FIFO Status Register 6    */
    __IM uint32_t RESERVED31;
    __IOM uint32_t DIEPCTL7;                         /*!< (@ 0x000009E0) Device Control IN Endpoint Control Register 7         */
    __IM uint32_t RESERVED32;
    __IOM uint32_t DIEPINT7;                         /*!< (@ 0x000009E8) Device IN Endpoint Interrupt Register 7               */
    __IM uint32_t RESERVED33;
    __IOM uint32_t DIEPTSIZ7;                        /*!< (@ 0x000009F0) Device IN Endpoint Transfer Size Register 7           */
    __IOM uint32_t DIEPDMA7;                         /*!< (@ 0x000009F4) Device IN Endpoint DMA Address Register 7             */
    __IOM uint32_t DTXFSTS7;                         /*!< (@ 0x000009F8) Device IN Endpoint Transmit FIFO Status Register 7    */
    __IM uint32_t RESERVED34;
    __IOM uint32_t DIEPCTL8;                         /*!< (@ 0x00000A00) Device Control IN Endpoint Control Register 8         */
    __IM uint32_t RESERVED35;
    __IOM uint32_t DIEPINT8;                         /*!< (@ 0x00000A08) Device IN Endpoint Interrupt Register 8               */
    __IM uint32_t RESERVED36;
    __IOM uint32_t DIEPTSIZ8;                        /*!< (@ 0x00000A10) Device IN Endpoint Transfer Size Register 8           */
    __IOM uint32_t DIEPDMA8;                         /*!< (@ 0x00000A14) Device IN Endpoint DMA Address Register 8             */
    __IOM uint32_t DTXFSTS8;                         /*!< (@ 0x00000A18) Device IN Endpoint Transmit FIFO Status Register 8    */
    __IM uint32_t RESERVED37;
    __IOM uint32_t DIEPCTL9;                         /*!< (@ 0x00000A20) Device Control IN Endpoint Control Register 9         */
    __IM uint32_t RESERVED38;
    __IOM uint32_t DIEPINT9;                         /*!< (@ 0x00000A28) Device IN Endpoint Interrupt Register 9               */
    __IM uint32_t RESERVED39;
    __IOM uint32_t DIEPTSIZ9;                        /*!< (@ 0x00000A30) Device IN Endpoint Transfer Size Register 9           */
    __IOM uint32_t DIEPDMA9;                         /*!< (@ 0x00000A34) Device IN Endpoint DMA Address Register 9             */
    __IOM uint32_t DTXFSTS9;                         /*!< (@ 0x00000A38) Device IN Endpoint Transmit FIFO Status Register 9    */
    __IM uint32_t RESERVED40;
    __IOM uint32_t DIEPCTL10;                        /*!< (@ 0x00000A40) Device Control IN Endpoint Control Register 10        */
    __IM uint32_t RESERVED41;
    __IOM uint32_t DIEPINT10;                        /*!< (@ 0x00000A48) Device IN Endpoint Interrupt Register 10              */
    __IM uint32_t RESERVED42;
    __IOM uint32_t DIEPTSIZ10;                       /*!< (@ 0x00000A50) Device IN Endpoint Transfer Size Register 10          */
    __IOM uint32_t DIEPDMA10;                        /*!< (@ 0x00000A54) Device IN Endpoint DMA Address Register 10            */
    __IOM uint32_t DTXFSTS10;                        /*!< (@ 0x00000A58) Device IN Endpoint Transmit FIFO Status Register 10   */
    __IM uint32_t RESERVED43;
    __IOM uint32_t DIEPCTL11;                        /*!< (@ 0x00000A60) Device Control IN Endpoint Control Register 11        */
    __IM uint32_t RESERVED44;
    __IOM uint32_t DIEPINT11;                        /*!< (@ 0x00000A68) Device IN Endpoint Interrupt Register 11              */
    __IM uint32_t RESERVED45;
    __IOM uint32_t DIEPTSIZ11;                       /*!< (@ 0x00000A70) Device IN Endpoint Transfer Size Register 11          */
    __IOM uint32_t DIEPDMA11;                        /*!< (@ 0x00000A74) Device IN Endpoint DMA Address Register 11            */
    __IOM uint32_t DTXFSTS11;                        /*!< (@ 0x00000A78) Device IN Endpoint Transmit FIFO Status Register 11   */
    __IM uint32_t RESERVED46;
    __IOM uint32_t DIEPCTL12;                        /*!< (@ 0x00000A80) Device Control IN Endpoint Control Register 12        */
    __IM uint32_t RESERVED47;
    __IOM uint32_t DIEPINT12;                        /*!< (@ 0x00000A88) Device IN Endpoint Interrupt Register 12              */
    __IM uint32_t RESERVED48;
    __IOM uint32_t DIEPTSIZ12;                       /*!< (@ 0x00000A90) Device IN Endpoint Transfer Size Register 12          */
    __IOM uint32_t DIEPDMA12;                        /*!< (@ 0x00000A94) Device IN Endpoint DMA Address Register 12            */
    __IOM uint32_t DTXFSTS12;                        /*!< (@ 0x00000A98) Device IN Endpoint Transmit FIFO Status Register 12   */
    __IM uint32_t RESERVED49;
    __IOM uint32_t DIEPCTL13;                        /*!< (@ 0x00000AA0) Device Control IN Endpoint Control Register 13        */
    __IM uint32_t RESERVED50;
    __IOM uint32_t DIEPINT13;                        /*!< (@ 0x00000AA8) Device IN Endpoint Interrupt Register 13              */
    __IM uint32_t RESERVED51;
    __IOM uint32_t DIEPTSIZ13;                       /*!< (@ 0x00000AB0) Device IN Endpoint Transfer Size Register 13          */
    __IOM uint32_t DIEPDMA13;                        /*!< (@ 0x00000AB4) Device IN Endpoint DMA Address Register 13            */
    __IOM uint32_t DTXFSTS13;                        /*!< (@ 0x00000AB8) Device IN Endpoint Transmit FIFO Status Register 13   */
    __IM uint32_t RESERVED52;
    __IOM uint32_t DIEPCTL14;                        /*!< (@ 0x00000AC0) Device Control IN Endpoint Control Register 14        */
    __IM uint32_t RESERVED53;
    __IOM uint32_t DIEPINT14;                        /*!< (@ 0x00000AC8) Device IN Endpoint Interrupt Register 14              */
    __IM uint32_t RESERVED54;
    __IOM uint32_t DIEPTSIZ14;                       /*!< (@ 0x00000AD0) Device IN Endpoint Transfer Size Register 14          */
    __IOM uint32_t DIEPDMA14;                        /*!< (@ 0x00000AD4) Device IN Endpoint DMA Address Register 14            */
    __IOM uint32_t DTXFSTS14;                        /*!< (@ 0x00000AD8) Device IN Endpoint Transmit FIFO Status Register 14   */
    __IM uint32_t RESERVED55;
    __IOM uint32_t DIEPCTL15;                        /*!< (@ 0x00000AE0) Device Control IN Endpoint Control Register 15        */
    __IM uint32_t RESERVED56;
    __IOM uint32_t DIEPINT15;                        /*!< (@ 0x00000AE8) Device IN Endpoint Interrupt Register 15              */
    __IM uint32_t RESERVED57;
    __IOM uint32_t DIEPTSIZ15;                       /*!< (@ 0x00000AF0) Device IN Endpoint Transfer Size Register 15          */
    __IOM uint32_t DIEPDMA15;                        /*!< (@ 0x00000AF4) Device IN Endpoint DMA Address Register 15            */
    __IOM uint32_t DTXFSTS15;                        /*!< (@ 0x00000AF8) Device IN Endpoint Transmit FIFO Status Register 15   */
    __IM uint32_t RESERVED58;
    __IOM uint32_t DOEPCTL0;                         /*!< (@ 0x00000B00) Device Control OUT Endpoint 0 Control Register        */
    __IM uint32_t RESERVED59;
    __IOM uint32_t DOEPINT0;                         /*!< (@ 0x00000B08) Device OUT Endpoint 0 Interrupt Register              */
    __IM uint32_t RESERVED60;
    __IOM uint32_t DOEPTSIZ0;                        /*!< (@ 0x00000B10) Device OUT Endpoint 0 Transfer Size Register          */
    __IOM uint32_t DOEPDMA0;                         /*!< (@ 0x00000B14) Device OUT Endpoint 0 DMA Address Register            */
    __IM uint32_t RESERVED61[2];
    __IOM uint32_t DOEPCTL1;                         /*!< (@ 0x00000B20) Device Control OUT Endpoint Control Register 1        */
    __IM uint32_t RESERVED62;
    __IOM uint32_t DOEPINT1;                         /*!< (@ 0x00000B28) Device OUT Endpoint Interrupt Register 1              */
    __IM uint32_t RESERVED63;
    __IOM uint32_t DOEPTSIZ1;                        /*!< (@ 0x00000B30) Device OUT Endpoint Transfer Size Register 1          */
    __IOM uint32_t DOEPDMA1;                         /*!< (@ 0x00000B34) Device OUT Endpoint DMA Address Register 1            */
    __IM uint32_t RESERVED64[2];
