NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* DBNCTIME @Bit 17 : Mode: Host only. Long/Short Debounce Time (DbncTime) */
  #define USBHSCORE_GOTGCTL_DBNCTIME_Pos (17UL)      /*!< Position of DBNCTIME field.                                          */
  #define USBHSCORE_GOTGCTL_DBNCTIME_Msk (0x1UL << USBHSCORE_GOTGCTL_DBNCTIME_Pos) /*!< Bit mask of DBNCTIME field.            */
  #define USBHSCORE_GOTGCTL_DBNCTIME_Min (0x0UL)     /*!< Min enumerator value of DBNCTIME field.                              */
  #define USBHSCORE_GOTGCTL_DBNCTIME_Max (0x1UL)     /*!< Max enumerator value of DBNCTIME field.                              */
  #define USBHSCORE_GOTGCTL_DBNCTIME_LONG (0x0UL)    /*!< Long debounce time, used for physical connections (100 ms + 2.5
                                                          micro-sec)*/
  #define USBHSCORE_GOTGCTL_DBNCTIME_SHORT (0x1UL)   /*!< Short debounce time, used for soft connections (2.5 micro-sec)       */

/* ASESVLD @Bit 18 : Mode: Host only. A-Session Valid (ASesVld) */
  #define USBHSCORE_GOTGCTL_ASESVLD_Pos (18UL)       /*!< Position of ASESVLD field.                                           */
  #define USBHSCORE_GOTGCTL_ASESVLD_Msk (0x1UL << USBHSCORE_GOTGCTL_ASESVLD_Pos) /*!< Bit mask of ASESVLD field.               */
  #define USBHSCORE_GOTGCTL_ASESVLD_Min (0x0UL)      /*!< Min enumerator value of ASESVLD field.                               */
  #define USBHSCORE_GOTGCTL_ASESVLD_Max (0x1UL)      /*!< Max enumerator value of ASESVLD field.                               */
  #define USBHSCORE_GOTGCTL_ASESVLD_NOTVALID (0x0UL) /*!< A-session is not valid.                                              */
  #define USBHSCORE_GOTGCTL_ASESVLD_VALID (0x1UL)    /*!< A-session is valid.                                                  */

/* BSESVLD @Bit 19 : Mode: Device only. B-Session Valid (BSesVld) */
  #define USBHSCORE_GOTGCTL_BSESVLD_Pos (19UL)       /*!< Position of BSESVLD field.                                           */
  #define USBHSCORE_GOTGCTL_BSESVLD_Msk (0x1UL << USBHSCORE_GOTGCTL_BSESVLD_Pos) /*!< Bit mask of BSESVLD field.               */
  #define USBHSCORE_GOTGCTL_BSESVLD_Min (0x0UL)      /*!< Min enumerator value of BSESVLD field.                               */
  #define USBHSCORE_GOTGCTL_BSESVLD_Max (0x1UL)      /*!< Max enumerator value of BSESVLD field.                               */
  #define USBHSCORE_GOTGCTL_BSESVLD_NOTVALID (0x0UL) /*!< B-session is not valid.                                              */
  #define USBHSCORE_GOTGCTL_BSESVLD_VALID (0x1UL)    /*!< B-session is valid.                                                  */

/* OTGVER @Bit 20 : OTG Version (OTGVer) */
  #define USBHSCORE_GOTGCTL_OTGVER_Pos (20UL)        /*!< Position of OTGVER field.                                            */
  #define USBHSCORE_GOTGCTL_OTGVER_Msk (0x1UL << USBHSCORE_GOTGCTL_OTGVER_Pos) /*!< Bit mask of OTGVER field.                  */
  #define USBHSCORE_GOTGCTL_OTGVER_Min (0x0UL)       /*!< Min enumerator value of OTGVER field.                                */
  #define USBHSCORE_GOTGCTL_OTGVER_Max (0x1UL)       /*!< Max enumerator value of OTGVER field.                                */
  #define USBHSCORE_GOTGCTL_OTGVER_VER13 (0x0UL)     /*!< Supports OTG Version 1.3                                             */
  #define USBHSCORE_GOTGCTL_OTGVER_VER20 (0x1UL)     /*!< Supports OTG Version 2.0                                             */

/* CURMOD @Bit 21 : Current Mode of Operation (CurMod) */
  #define USBHSCORE_GOTGCTL_CURMOD_Pos (21UL)        /*!< Position of CURMOD field.                                            */
  #define USBHSCORE_GOTGCTL_CURMOD_Msk (0x1UL << USBHSCORE_GOTGCTL_CURMOD_Pos) /*!< Bit mask of CURMOD field.                  */
  #define USBHSCORE_GOTGCTL_CURMOD_Min (0x0UL)       /*!< Min enumerator value of CURMOD field.                                */
  #define USBHSCORE_GOTGCTL_CURMOD_Max (0x1UL)       /*!< Max enumerator value of CURMOD field.                                */
  #define USBHSCORE_GOTGCTL_CURMOD_DEVICEMODE (0x0UL) /*!< Current mode is device mode.                                        */
  #define USBHSCORE_GOTGCTL_CURMOD_HOSTMODE (0x1UL)  /*!< Current mode is host mode.                                           */

/* MULTVALIDBC @Bits 22..26 : Mode: Host and Device. Multi Valued ID pin (MultValIdBC) */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Pos (22UL)   /*!< Position of MULTVALIDBC field.                                       */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Msk (0x1FUL << USBHSCORE_GOTGCTL_MULTVALIDBC_Pos) /*!< Bit mask of MULTVALIDBC field.  */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Min (0x01UL) /*!< Min enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_Max (0x10UL) /*!< Max enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RIDC (0x01UL) /*!< B-Device connected to ACA. VBUS is on.                              */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RIDB (0x02UL) /*!< B-Device connected to ACA. VBUS is off.                             */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RIDA (0x04UL) /*!< A-Device connected to ACA                                           */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RIDGND (0x08UL) /*!< A-Device not connected to ACA                                     */
  #define USBHSCORE_GOTGCTL_MULTVALIDBC_RIDFLOAT (0x10UL) /*!< B-Device not connected to ACA                                   */

/* CHIRPEN @Bit 27 : Mode: Device Only. This bit when programmed to 1'b1 results in the core asserting chirp_on before sending
                     an actual Chirp 'K' signal on USB. This bit is present only if OTG_BC_SUPPORT = 1.If OTG_BC_SUPPORT!=1,
                     this bit is a reserved bit. Do not set this bit when core is operating in HSIC mode because HSIC always
                     operates at High Speed and High speed chirp is not used */

  #define USBHSCORE_GOTGCTL_CHIRPEN_Pos (27UL)       /*!< Position of CHIRPEN field.                                           */
  #define USBHSCORE_GOTGCTL_CHIRPEN_Msk (0x1UL << USBHSCORE_GOTGCTL_CHIRPEN_Pos) /*!< Bit mask of CHIRPEN field.               */
  #define USBHSCORE_GOTGCTL_CHIRPEN_Min (0x0UL)      /*!< Min enumerator value of CHIRPEN field.                               */
  #define USBHSCORE_GOTGCTL_CHIRPEN_Max (0x1UL)      /*!< Max enumerator value of CHIRPEN field.                               */
  #define USBHSCORE_GOTGCTL_CHIRPEN_CHIRPDISABLE (0x0UL) /*!< The controller does not assert chirp_on before sending an actual
                                                              Chirp 'K' signal on USB.*/
  #define USBHSCORE_GOTGCTL_CHIRPEN_CHIRPENABLE (0x1UL) /*!< The controller asserts chirp_on before sending an actual Chirp 'K'
                                                             signal on USB.*/

/* EUSB2PHYDISCSUPP @Bit 28 : This field is only applicable to Device mode and must be set to 1'b1 if eUSB2 PHY is used. */
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_Pos (28UL) /*!< Position of EUSB2PHYDISCSUPP field.                               */
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_Msk (0x1UL << USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_Pos) /*!< Bit mask of
                                                                            EUSB2PHYDISCSUPP field.*/
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_Min (0x0UL) /*!< Min enumerator value of EUSB2PHYDISCSUPP field.                  */
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_Max (0x1UL) /*!< Max enumerator value of EUSB2PHYDISCSUPP field.                  */
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_DISABLED (0x0UL) /*!< Device disconnect detection using GINTSTS.USBRst interrupt
                                                                   when not in hibernation and GPWRDN.ResetDetected when in
                                                                   hibernation*/
  #define USBHSCORE_GOTGCTL_EUSB2PHYDISCSUPP_ENABLED (0x1UL) /*!< Device disconnect detection using GOTGINT.SesEEndDet interrupt
                                                                  when not in hibernation and GPWRDN.StsChngInt when in
                                                                  hibernation*/


