NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* PRTINT @Bit 24 : Mode: Host only. Host Port Interrupt (PrtInt) */
  #define USBHSCORE_GINTSTS_PRTINT_Pos (24UL)        /*!< Position of PRTINT field.                                            */
  #define USBHSCORE_GINTSTS_PRTINT_Msk (0x1UL << USBHSCORE_GINTSTS_PRTINT_Pos) /*!< Bit mask of PRTINT field.                  */
  #define USBHSCORE_GINTSTS_PRTINT_Min (0x0UL)       /*!< Min enumerator value of PRTINT field.                                */
  #define USBHSCORE_GINTSTS_PRTINT_Max (0x1UL)       /*!< Max enumerator value of PRTINT field.                                */
  #define USBHSCORE_GINTSTS_PRTINT_INACTIVE (0x0UL)  /*!< Not active                                                           */
  #define USBHSCORE_GINTSTS_PRTINT_ACTIVE (0x1UL)    /*!< Host Port Interrupt                                                  */

/* HCHINT @Bit 25 : Mode: Host only. Host Channels Interrupt (HChInt) */
  #define USBHSCORE_GINTSTS_HCHINT_Pos (25UL)        /*!< Position of HCHINT field.                                            */
  #define USBHSCORE_GINTSTS_HCHINT_Msk (0x1UL << USBHSCORE_GINTSTS_HCHINT_Pos) /*!< Bit mask of HCHINT field.                  */
  #define USBHSCORE_GINTSTS_HCHINT_Min (0x0UL)       /*!< Min enumerator value of HCHINT field.                                */
  #define USBHSCORE_GINTSTS_HCHINT_Max (0x1UL)       /*!< Max enumerator value of HCHINT field.                                */
  #define USBHSCORE_GINTSTS_HCHINT_INACTIVE (0x0UL)  /*!< Not active                                                           */
  #define USBHSCORE_GINTSTS_HCHINT_ACTIVE (0x1UL)    /*!< Host Channels Interrupt                                              */

/* PTXFEMP @Bit 26 : Mode: Host only. Periodic TxFIFO Empty (PTxFEmp) */
  #define USBHSCORE_GINTSTS_PTXFEMP_Pos (26UL)       /*!< Position of PTXFEMP field.                                           */
  #define USBHSCORE_GINTSTS_PTXFEMP_Msk (0x1UL << USBHSCORE_GINTSTS_PTXFEMP_Pos) /*!< Bit mask of PTXFEMP field.               */
  #define USBHSCORE_GINTSTS_PTXFEMP_Min (0x0UL)      /*!< Min enumerator value of PTXFEMP field.                               */
  #define USBHSCORE_GINTSTS_PTXFEMP_Max (0x1UL)      /*!< Max enumerator value of PTXFEMP field.                               */
  #define USBHSCORE_GINTSTS_PTXFEMP_INACTIVE (0x0UL) /*!< Not active                                                           */
  #define USBHSCORE_GINTSTS_PTXFEMP_ACTIVE (0x1UL)   /*!< Periodic TxFIFO Empty                                                */

/* LPMINT @Bit 27 : Mode: Host and Device. LPM Transaction Received Interrupt (LPM_Int). */
  #define USBHSCORE_GINTSTS_LPMINT_Pos (27UL)        /*!< Position of LPMINT field.                                            */
  #define USBHSCORE_GINTSTS_LPMINT_Msk (0x1UL << USBHSCORE_GINTSTS_LPMINT_Pos) /*!< Bit mask of LPMINT field.                  */
  #define USBHSCORE_GINTSTS_LPMINT_Min (0x0UL)       /*!< Min enumerator value of LPMINT field.                                */
  #define USBHSCORE_GINTSTS_LPMINT_Max (0x1UL)       /*!< Max enumerator value of LPMINT field.                                */
  #define USBHSCORE_GINTSTS_LPMINT_INACTIVE (0x0UL)  /*!< Not Active                                                           */
  #define USBHSCORE_GINTSTS_LPMINT_ACTIVE (0x1UL)    /*!< LPM Transaction Received Interrupt                                   */

/* CONIDSTSCHNG @Bit 28 : Mode: Host and Device. Connector ID Status Change (ConIDStsChng) */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos (28UL)  /*!< Position of CONIDSTSCHNG field.                                      */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Msk (0x1UL << USBHSCORE_GINTSTS_CONIDSTSCHNG_Pos) /*!< Bit mask of CONIDSTSCHNG field.*/
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Min (0x0UL) /*!< Min enumerator value of CONIDSTSCHNG field.                          */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_Max (0x1UL) /*!< Max enumerator value of CONIDSTSCHNG field.                          */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_INACTIVE (0x0UL) /*!< Not Active                                                      */
  #define USBHSCORE_GINTSTS_CONIDSTSCHNG_ACTIVE (0x1UL) /*!< Connector ID Status Change                                        */

/* DISCONNINT @Bit 29 : Mode: Host only. Disconnect Detected Interrupt (DisconnInt) */
  #define USBHSCORE_GINTSTS_DISCONNINT_Pos (29UL)    /*!< Position of DISCONNINT field.                                        */
  #define USBHSCORE_GINTSTS_DISCONNINT_Msk (0x1UL << USBHSCORE_GINTSTS_DISCONNINT_Pos) /*!< Bit mask of DISCONNINT field.      */
  #define USBHSCORE_GINTSTS_DISCONNINT_Min (0x0UL)   /*!< Min enumerator value of DISCONNINT field.                            */
  #define USBHSCORE_GINTSTS_DISCONNINT_Max (0x1UL)   /*!< Max enumerator value of DISCONNINT field.                            */
  #define USBHSCORE_GINTSTS_DISCONNINT_INACTIVE (0x0UL) /*!< Not active                                                        */
  #define USBHSCORE_GINTSTS_DISCONNINT_ACTIVE (0x1UL) /*!< Disconnect Detected Interrupt                                       */

/* SESSREQINT @Bit 30 : Mode: Host and Device. Session Request/New Session Detected Interrupt (SessReqInt) */
  #define USBHSCORE_GINTSTS_SESSREQINT_Pos (30UL)    /*!< Position of SESSREQINT field.                                        */
  #define USBHSCORE_GINTSTS_SESSREQINT_Msk (0x1UL << USBHSCORE_GINTSTS_SESSREQINT_Pos) /*!< Bit mask of SESSREQINT field.      */
  #define USBHSCORE_GINTSTS_SESSREQINT_Min (0x0UL)   /*!< Min enumerator value of SESSREQINT field.                            */
  #define USBHSCORE_GINTSTS_SESSREQINT_Max (0x1UL)   /*!< Max enumerator value of SESSREQINT field.                            */
  #define USBHSCORE_GINTSTS_SESSREQINT_INACTIVE (0x0UL) /*!< Not active                                                        */
  #define USBHSCORE_GINTSTS_SESSREQINT_ACTIVE (0x1UL) /*!< Session Request New Session Detected Interrupt                      */

/* WKUPINT @Bit 31 : Mode: Host and Device. Resume/Remote Wakeup Detected Interrupt (WkUpInt) */
  #define USBHSCORE_GINTSTS_WKUPINT_Pos (31UL)       /*!< Position of WKUPINT field.                                           */
  #define USBHSCORE_GINTSTS_WKUPINT_Msk (0x1UL << USBHSCORE_GINTSTS_WKUPINT_Pos) /*!< Bit mask of WKUPINT field.               */
  #define USBHSCORE_GINTSTS_WKUPINT_Min (0x0UL)      /*!< Min enumerator value of WKUPINT field.                               */
  #define USBHSCORE_GINTSTS_WKUPINT_Max (0x1UL)      /*!< Max enumerator value of WKUPINT field.                               */
  #define USBHSCORE_GINTSTS_WKUPINT_INACTIVE (0x0UL) /*!< Not active                                                           */
  #define USBHSCORE_GINTSTS_WKUPINT_ACTIVE (0x1UL)   /*!< Resume or Remote Wakeup Detected Interrupt                           */


/* USBHSCORE_GINTMSK: Interrupt Mask Register */
  #define USBHSCORE_GINTMSK_ResetValue (0x00000000UL) /*!< Reset value of GINTMSK register.                                    */

/* MODEMISMSK @Bit 1 : Mode: Host and Device. Mode Mismatch Interrupt Mask (ModeMisMsk) */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Pos (1UL)     /*!< Position of MODEMISMSK field.                                        */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Msk (0x1UL << USBHSCORE_GINTMSK_MODEMISMSK_Pos) /*!< Bit mask of MODEMISMSK field.      */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Min (0x0UL)   /*!< Min enumerator value of MODEMISMSK field.                            */
  #define USBHSCORE_GINTMSK_MODEMISMSK_Max (0x1UL)   /*!< Max enumerator value of MODEMISMSK field.                            */
  #define USBHSCORE_GINTMSK_MODEMISMSK_MASK (0x0UL)  /*!< Mode Mismatch Interrupt Mask                                         */
  #define USBHSCORE_GINTMSK_MODEMISMSK_NOMASK (0x1UL) /*!< No Mode Mismatch Interrupt Mask                                     */

/* OTGINTMSK @Bit 2 : Mode: Host and Device. OTG Interrupt Mask (OTGIntMsk) */
  #define USBHSCORE_GINTMSK_OTGINTMSK_Pos (2UL)      /*!< Position of OTGINTMSK field.                                         */
  #define USBHSCORE_GINTMSK_OTGINTMSK_Msk (0x1UL << USBHSCORE_GINTMSK_OTGINTMSK_Pos) /*!< Bit mask of OTGINTMSK field.         */
  #define USBHSCORE_GINTMSK_OTGINTMSK_Min (0x0UL)    /*!< Min enumerator value of OTGINTMSK field.                             */
  #define USBHSCORE_GINTMSK_OTGINTMSK_Max (0x1UL)    /*!< Max enumerator value of OTGINTMSK field.                             */
  #define USBHSCORE_GINTMSK_OTGINTMSK_MASK (0x0UL)   /*!< OTG Interrupt Mask                                                   */
  #define USBHSCORE_GINTMSK_OTGINTMSK_NOMASK (0x1UL) /*!< No OTG Interrupt Mask                                                */

