NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* I2CINTSEL @Bit 8 : I2C Selection (I2CIntSel) */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Pos (8UL)      /*!< Position of I2CINTSEL field.                                         */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Msk (0x1UL << USBHSCORE_GHWCFG3_I2CINTSEL_Pos) /*!< Bit mask of I2CINTSEL field.         */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Min (0x0UL)    /*!< Min enumerator value of I2CINTSEL field.                             */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_Max (0x1UL)    /*!< Max enumerator value of I2CINTSEL field.                             */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_DISABLED (0x0UL) /*!< I2C Interface is not available                                     */
  #define USBHSCORE_GHWCFG3_I2CINTSEL_ENABLED (0x1UL) /*!< I2C Interface is available                                          */

/* VNDCTLSUPT @Bit 9 : Vendor Control Interface Support (VndctlSupt) */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Pos (9UL)     /*!< Position of VNDCTLSUPT field.                                        */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Msk (0x1UL << USBHSCORE_GHWCFG3_VNDCTLSUPT_Pos) /*!< Bit mask of VNDCTLSUPT field.      */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Min (0x0UL)   /*!< Min enumerator value of VNDCTLSUPT field.                            */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_Max (0x1UL)   /*!< Max enumerator value of VNDCTLSUPT field.                            */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_DISABLED (0x0UL) /*!< Vendor Control Interface is not available.                        */
  #define USBHSCORE_GHWCFG3_VNDCTLSUPT_ENABLED (0x1UL) /*!< Vendor Control Interface is available.                             */

/* OPTFEATURE @Bit 10 : Optional Features Removed (OptFeature) */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Pos (10UL)    /*!< Position of OPTFEATURE field.                                        */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Msk (0x1UL << USBHSCORE_GHWCFG3_OPTFEATURE_Pos) /*!< Bit mask of OPTFEATURE field.      */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Min (0x0UL)   /*!< Min enumerator value of OPTFEATURE field.                            */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_Max (0x1UL)   /*!< Max enumerator value of OPTFEATURE field.                            */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_DISABLED (0x0UL) /*!< Optional features were not Removed                                */
  #define USBHSCORE_GHWCFG3_OPTFEATURE_ENABLED (0x1UL) /*!< Optional Features have been Removed                                */

/* RSTTYPE @Bit 11 : Reset Style for Clocked always Blocks in RTL (RstType) */
  #define USBHSCORE_GHWCFG3_RSTTYPE_Pos (11UL)       /*!< Position of RSTTYPE field.                                           */
  #define USBHSCORE_GHWCFG3_RSTTYPE_Msk (0x1UL << USBHSCORE_GHWCFG3_RSTTYPE_Pos) /*!< Bit mask of RSTTYPE field.               */
  #define USBHSCORE_GHWCFG3_RSTTYPE_Min (0x0UL)      /*!< Min enumerator value of RSTTYPE field.                               */
  #define USBHSCORE_GHWCFG3_RSTTYPE_Max (0x1UL)      /*!< Max enumerator value of RSTTYPE field.                               */
  #define USBHSCORE_GHWCFG3_RSTTYPE_ASYNCRST (0x0UL) /*!< Asynchronous reset is used in the core                               */
  #define USBHSCORE_GHWCFG3_RSTTYPE_SYNCRST (0x1UL)  /*!< Synchronous reset is used in the core                                */

/* ADPSUPPORT @Bit 12 : This bit indicates whether ADP logic is present within or external to the controller */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Pos (12UL)    /*!< Position of ADPSUPPORT field.                                        */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG3_ADPSUPPORT_Pos) /*!< Bit mask of ADPSUPPORT field.      */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Min (0x0UL)   /*!< Min enumerator value of ADPSUPPORT field.                            */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_Max (0x1UL)   /*!< Max enumerator value of ADPSUPPORT field.                            */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_DISABLED (0x0UL) /*!< ADP logic is not present along with the controller                */
  #define USBHSCORE_GHWCFG3_ADPSUPPORT_ENABLED (0x1UL) /*!< ADP logic is present along with the controller                     */

/* HSICMODE @Bit 13 : HSIC mode specified for Mode of Operation */
  #define USBHSCORE_GHWCFG3_HSICMODE_Pos (13UL)      /*!< Position of HSICMODE field.                                          */
  #define USBHSCORE_GHWCFG3_HSICMODE_Msk (0x1UL << USBHSCORE_GHWCFG3_HSICMODE_Pos) /*!< Bit mask of HSICMODE field.            */
  #define USBHSCORE_GHWCFG3_HSICMODE_Min (0x0UL)     /*!< Min enumerator value of HSICMODE field.                              */
  #define USBHSCORE_GHWCFG3_HSICMODE_Max (0x1UL)     /*!< Max enumerator value of HSICMODE field.                              */
  #define USBHSCORE_GHWCFG3_HSICMODE_DISABLED (0x0UL) /*!< No HSIC capability                                                  */
  #define USBHSCORE_GHWCFG3_HSICMODE_ENABLED (0x1UL) /*!< HSIC-capable with shared UTMI PHY interface                          */

/* BCSUPPORT @Bit 14 : This bit indicates the controller support for Battery Charger. */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Pos (14UL)     /*!< Position of BCSUPPORT field.                                         */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Msk (0x1UL << USBHSCORE_GHWCFG3_BCSUPPORT_Pos) /*!< Bit mask of BCSUPPORT field.         */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Min (0x0UL)    /*!< Min enumerator value of BCSUPPORT field.                             */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_Max (0x1UL)    /*!< Max enumerator value of BCSUPPORT field.                             */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_DISABLED (0x0UL) /*!< No Battery Charger Support                                         */
  #define USBHSCORE_GHWCFG3_BCSUPPORT_ENABLED (0x1UL) /*!< Battery Charger Support present                                     */

/* LPMMODE @Bit 15 : LPM mode specified for Mode of Operation. */
  #define USBHSCORE_GHWCFG3_LPMMODE_Pos (15UL)       /*!< Position of LPMMODE field.                                           */
  #define USBHSCORE_GHWCFG3_LPMMODE_Msk (0x1UL << USBHSCORE_GHWCFG3_LPMMODE_Pos) /*!< Bit mask of LPMMODE field.               */
  #define USBHSCORE_GHWCFG3_LPMMODE_Min (0x0UL)      /*!< Min enumerator value of LPMMODE field.                               */
  #define USBHSCORE_GHWCFG3_LPMMODE_Max (0x1UL)      /*!< Max enumerator value of LPMMODE field.                               */
  #define USBHSCORE_GHWCFG3_LPMMODE_DISABLED (0x0UL) /*!< LPM disabled                                                         */
  #define USBHSCORE_GHWCFG3_LPMMODE_ENABLED (0x1UL)  /*!< LPM enabled                                                          */

