NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* EPDISBLDMSK @Bit 1 : Endpoint Disabled Interrupt Mask (EPDisbldMsk) */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Pos (1UL)    /*!< Position of EPDISBLDMSK field.                                       */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_EPDISBLDMSK_Pos) /*!< Bit mask of EPDISBLDMSK field.   */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Min (0x0UL)  /*!< Min enumerator value of EPDISBLDMSK field.                           */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_Max (0x1UL)  /*!< Max enumerator value of EPDISBLDMSK field.                           */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_MASK (0x0UL) /*!< Mask Endpoint Disabled Interrupt                                     */
  #define USBHSCORE_DIEPMSK_EPDISBLDMSK_NOMASK (0x1UL) /*!< No Endpoint Disabled Interrupt Mask                                */

/* AHBERRMSK @Bit 2 : AHB Error Mask (AHBErrMsk) */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Pos (2UL)      /*!< Position of AHBERRMSK field.                                         */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_AHBERRMSK_Pos) /*!< Bit mask of AHBERRMSK field.         */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Min (0x0UL)    /*!< Min enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_Max (0x1UL)    /*!< Max enumerator value of AHBERRMSK field.                             */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_MASK (0x0UL)   /*!< Mask AHB Error Interrupt                                             */
  #define USBHSCORE_DIEPMSK_AHBERRMSK_NOMASK (0x1UL) /*!< No AHB Error Interrupt Mask                                          */

/* TIMEOUTMSK @Bit 3 : Timeout Condition Mask (TimeOUTMsk) (Non-isochronous endpoints) */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Pos (3UL)     /*!< Position of TIMEOUTMSK field.                                        */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_TIMEOUTMSK_Pos) /*!< Bit mask of TIMEOUTMSK field.      */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Min (0x0UL)   /*!< Min enumerator value of TIMEOUTMSK field.                            */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_Max (0x1UL)   /*!< Max enumerator value of TIMEOUTMSK field.                            */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_MASK (0x0UL)  /*!< Mask Timeout Condition Interrupt                                     */
  #define USBHSCORE_DIEPMSK_TIMEOUTMSK_NOMASK (0x1UL) /*!< No Timeout Condition Interrupt Mask                                 */

/* INTKNTXFEMPMSK @Bit 4 : IN Token Received When TxFIFO Empty Mask (INTknTXFEmpMsk) */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Pos (4UL) /*!< Position of INTKNTXFEMPMSK field.                                    */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Pos) /*!< Bit mask of INTKNTXFEMPMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMPMSK field.                      */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMPMSK field.                      */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_MASK (0x0UL) /*!< Mask IN Token Received When TxFIFO Empty Interrupt                */
  #define USBHSCORE_DIEPMSK_INTKNTXFEMPMSK_NOMASK (0x1UL) /*!< No IN Token Received When TxFIFO Empty Interrupt                */

/* INTKNEPMISMSK @Bit 5 : IN Token received with EP Mismatch Mask (INTknEPMisMsk) */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Pos (5UL)  /*!< Position of INTKNEPMISMSK field.                                     */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INTKNEPMISMSK_Pos) /*!< Bit mask of INTKNEPMISMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Min (0x0UL) /*!< Min enumerator value of INTKNEPMISMSK field.                        */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_Max (0x1UL) /*!< Max enumerator value of INTKNEPMISMSK field.                        */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_MASK (0x0UL) /*!< Mask IN Token received with EP Mismatch Interrupt                  */
  #define USBHSCORE_DIEPMSK_INTKNEPMISMSK_NOMASK (0x1UL) /*!< No Mask IN Token received with EP Mismatch Interrupt             */

/* INEPNAKEFFMSK @Bit 6 : IN Endpoint NAK Effective Mask (INEPNakEffMsk) */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Pos (6UL)  /*!< Position of INEPNAKEFFMSK field.                                     */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Pos) /*!< Bit mask of INEPNAKEFFMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Min (0x0UL) /*!< Min enumerator value of INEPNAKEFFMSK field.                        */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_Max (0x1UL) /*!< Max enumerator value of INEPNAKEFFMSK field.                        */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_MASK (0x0UL) /*!< Mask IN Endpoint NAK Effective Interrupt                           */
  #define USBHSCORE_DIEPMSK_INEPNAKEFFMSK_NOMASK (0x1UL) /*!< No IN Endpoint NAK Effective Interrupt Mask                      */

/* TXFIFOUNDRNMSK @Bit 8 : Fifo Underrun Mask (TxfifoUndrnMsk) */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Pos (8UL) /*!< Position of TXFIFOUNDRNMSK field.                                    */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Msk (0x1UL << USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Pos) /*!< Bit mask of TXFIFOUNDRNMSK
                                                                            field.*/
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Min (0x0UL) /*!< Min enumerator value of TXFIFOUNDRNMSK field.                      */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_Max (0x1UL) /*!< Max enumerator value of TXFIFOUNDRNMSK field.                      */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_MASK (0x0UL) /*!< Mask Fifo Underrun Interrupt                                      */
  #define USBHSCORE_DIEPMSK_TXFIFOUNDRNMSK_NOMASK (0x1UL) /*!< No Fifo Underrun Interrupt Mask                                 */

