NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* USBHSCORE_DIEPCTL0: Device Control IN Endpoint 0 Control Register */
  #define USBHSCORE_DIEPCTL0_ResetValue (0x00008000UL) /*!< Reset value of DIEPCTL0 register.                                  */

/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL0_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DIEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DIEPCTL0_MPS_Pos) /*!< Bit mask of MPS field.                         */
  #define USBHSCORE_DIEPCTL0_MPS_Min (0x0UL)         /*!< Min enumerator value of MPS field.                                   */
  #define USBHSCORE_DIEPCTL0_MPS_Max (0x3UL)         /*!< Max enumerator value of MPS field.                                   */
  #define USBHSCORE_DIEPCTL0_MPS_BYTES64 (0x0UL)     /*!< 64 bytes                                                             */
  #define USBHSCORE_DIEPCTL0_MPS_BYTES32 (0x1UL)     /*!< 32 bytes                                                             */
  #define USBHSCORE_DIEPCTL0_MPS_BYTES16 (0x2UL)     /*!< 16 bytes                                                             */
  #define USBHSCORE_DIEPCTL0_MPS_BYTES8 (0x3UL)      /*!< 8 bytes                                                              */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL0_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DIEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL0_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DIEPCTL0_USBACTEP_Min (0x1UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL0_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL0_USBACTEP_ACTIVE0 (0x1UL) /*!< Control endpoint is always active                                   */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL0_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DIEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL0_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DIEPCTL0_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL0_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL0_NAKSTS_INACTIVE (0x0UL) /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DIEPCTL0_NAKSTS_ACTIVE (0x1UL)   /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL0_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DIEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL0_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DIEPCTL0_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL0_EPTYPE_Max (0x0UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL0_EPTYPE_ACTIVE (0x0UL)   /*!< Endpoint Control 0                                                   */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DIEPCTL0_STALL_Pos (21UL)        /*!< Position of STALL field.                                             */
  #define USBHSCORE_DIEPCTL0_STALL_Msk (0x1UL << USBHSCORE_DIEPCTL0_STALL_Pos) /*!< Bit mask of STALL field.                   */
  #define USBHSCORE_DIEPCTL0_STALL_Min (0x0UL)       /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL0_STALL_Max (0x1UL)       /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DIEPCTL0_STALL_INACTIVE (0x0UL)  /*!< No Stall                                                             */
  #define USBHSCORE_DIEPCTL0_STALL_ACTIVE (0x1UL)    /*!< Stall Handshake                                                      */

/* TXFNUM @Bits 22..25 : TxFIFO Number (TxFNum) */
  #define USBHSCORE_DIEPCTL0_TXFNUM_Pos (22UL)       /*!< Position of TXFNUM field.                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_Msk (0xFUL << USBHSCORE_DIEPCTL0_TXFNUM_Pos) /*!< Bit mask of TXFNUM field.                */
  #define USBHSCORE_DIEPCTL0_TXFNUM_Min (0x0UL)      /*!< Min enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL0_TXFNUM_Max (0xFUL)      /*!< Max enumerator value of TXFNUM field.                                */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO0 (0x0UL)  /*!< Tx FIFO 0                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO1 (0x1UL)  /*!< Tx FIFO 1                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO2 (0x2UL)  /*!< Tx FIFO 2                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO3 (0x3UL)  /*!< Tx FIFO 3                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO4 (0x4UL)  /*!< Tx FIFO 4                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO5 (0x5UL)  /*!< Tx FIFO 5                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO6 (0x6UL)  /*!< Tx FIFO 6                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO7 (0x7UL)  /*!< Tx FIFO 7                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO8 (0x8UL)  /*!< Tx FIFO 8                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO9 (0x9UL)  /*!< Tx FIFO 9                                                            */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO10 (0xAUL) /*!< Tx FIFO 10                                                           */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO11 (0xBUL) /*!< Tx FIFO 11                                                           */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO12 (0xCUL) /*!< Tx FIFO 12                                                           */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO13 (0xDUL) /*!< Tx FIFO 13                                                           */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO14 (0xEUL) /*!< Tx FIFO 14                                                           */
  #define USBHSCORE_DIEPCTL0_TXFNUM_TXFIFO15 (0xFUL) /*!< Tx FIFO 15                                                           */

/* CNAK @Bit 26 : (unspecified) */
  #define USBHSCORE_DIEPCTL0_CNAK_Pos (26UL)         /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DIEPCTL0_CNAK_Msk (0x1UL << USBHSCORE_DIEPCTL0_CNAK_Pos) /*!< Bit mask of CNAK field.                      */
  #define USBHSCORE_DIEPCTL0_CNAK_Min (0x0UL)        /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL0_CNAK_Max (0x1UL)        /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DIEPCTL0_CNAK_NOCLEAR (0x0UL)    /*!< No action                                                            */
  #define USBHSCORE_DIEPCTL0_CNAK_CLEAR (0x1UL)      /*!< Clear NAK                                                            */

/* SNAK @Bit 27 : (unspecified) */
  #define USBHSCORE_DIEPCTL0_SNAK_Pos (27UL)         /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DIEPCTL0_SNAK_Msk (0x1UL << USBHSCORE_DIEPCTL0_SNAK_Pos) /*!< Bit mask of SNAK field.                      */
  #define USBHSCORE_DIEPCTL0_SNAK_Min (0x0UL)        /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL0_SNAK_Max (0x1UL)        /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DIEPCTL0_SNAK_NOSET (0x0UL)      /*!< No action                                                            */
  #define USBHSCORE_DIEPCTL0_SNAK_SET (0x1UL)        /*!< Set NAK                                                              */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DIEPCTL0_EPDIS_Pos (30UL)        /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DIEPCTL0_EPDIS_Msk (0x1UL << USBHSCORE_DIEPCTL0_EPDIS_Pos) /*!< Bit mask of EPDIS field.                   */
  #define USBHSCORE_DIEPCTL0_EPDIS_Min (0x0UL)       /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL0_EPDIS_Max (0x1UL)       /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DIEPCTL0_EPDIS_INACTIVE (0x0UL)  /*!< No action                                                            */
  #define USBHSCORE_DIEPCTL0_EPDIS_ACTIVE (0x1UL)    /*!< Disabled Endpoint                                                    */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DIEPCTL0_EPENA_Pos (31UL)        /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DIEPCTL0_EPENA_Msk (0x1UL << USBHSCORE_DIEPCTL0_EPENA_Pos) /*!< Bit mask of EPENA field.                   */
  #define USBHSCORE_DIEPCTL0_EPENA_Min (0x0UL)       /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL0_EPENA_Max (0x1UL)       /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DIEPCTL0_EPENA_INACTIVE (0x0UL)  /*!< No action                                                            */
  #define USBHSCORE_DIEPCTL0_EPENA_ACTIVE (0x1UL)    /*!< Enable Endpoint                                                      */


/* USBHSCORE_DIEPINT0: Device IN Endpoint 0 Interrupt Register */
  #define USBHSCORE_DIEPINT0_ResetValue (0x00000080UL) /*!< Reset value of DIEPINT0 register.                                  */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Pos (0UL)     /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Msk (0x1UL << USBHSCORE_DIEPINT0_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.       */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Min (0x0UL)   /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_Max (0x1UL)   /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_INACTIVE (0x0UL) /*!< No Transfer Complete Interrupt                                    */
  #define USBHSCORE_DIEPINT0_XFERCOMPL_ACTIVE (0x1UL) /*!< Transfer Completed Interrupt                                        */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DIEPINT0_EPDISBLD_Pos (1UL)      /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DIEPINT0_EPDISBLD_Msk (0x1UL << USBHSCORE_DIEPINT0_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.          */
  #define USBHSCORE_DIEPINT0_EPDISBLD_Min (0x0UL)    /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT0_EPDISBLD_Max (0x1UL)    /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DIEPINT0_EPDISBLD_INACTIVE (0x0UL) /*!< No Endpoint Disabled Interrupt                                     */
  #define USBHSCORE_DIEPINT0_EPDISBLD_ACTIVE (0x1UL) /*!< Endpoint Disabled Interrupt                                          */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DIEPINT0_AHBERR_Pos (2UL)        /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DIEPINT0_AHBERR_Msk (0x1UL << USBHSCORE_DIEPINT0_AHBERR_Pos) /*!< Bit mask of AHBERR field.                */
  #define USBHSCORE_DIEPINT0_AHBERR_Min (0x0UL)      /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT0_AHBERR_Max (0x1UL)      /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DIEPINT0_AHBERR_INACTIVE (0x0UL) /*!< No AHB Error Interrupt                                               */
  #define USBHSCORE_DIEPINT0_AHBERR_ACTIVE (0x1UL)   /*!< AHB Error interrupt                                                  */

/* TIMEOUT @Bit 3 : Timeout Condition (TimeOUT) */
  #define USBHSCORE_DIEPINT0_TIMEOUT_Pos (3UL)       /*!< Position of TIMEOUT field.                                           */
  #define USBHSCORE_DIEPINT0_TIMEOUT_Msk (0x1UL << USBHSCORE_DIEPINT0_TIMEOUT_Pos) /*!< Bit mask of TIMEOUT field.             */
  #define USBHSCORE_DIEPINT0_TIMEOUT_Min (0x0UL)     /*!< Min enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT0_TIMEOUT_Max (0x1UL)     /*!< Max enumerator value of TIMEOUT field.                               */
  #define USBHSCORE_DIEPINT0_TIMEOUT_INACTIVE (0x0UL) /*!< No Timeout interrupt                                                */
  #define USBHSCORE_DIEPINT0_TIMEOUT_ACTIVE (0x1UL)  /*!< Timeout interrupt                                                    */

/* INTKNTXFEMP @Bit 4 : IN Token Received When TxFIFO is Empty (INTknTXFEmp) */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Pos (4UL)   /*!< Position of INTKNTXFEMP field.                                       */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Msk (0x1UL << USBHSCORE_DIEPINT0_INTKNTXFEMP_Pos) /*!< Bit mask of INTKNTXFEMP field. */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Min (0x0UL) /*!< Min enumerator value of INTKNTXFEMP field.                           */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_Max (0x1UL) /*!< Max enumerator value of INTKNTXFEMP field.                           */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_INACTIVE (0x0UL) /*!< No IN Token Received when TxFIFO Empty interrupt                */
  #define USBHSCORE_DIEPINT0_INTKNTXFEMP_ACTIVE (0x1UL) /*!< IN Token Received when TxFIFO Empty Interrupt                     */

/* INTKNEPMIS @Bit 5 : IN Token Received with EP Mismatch (INTknEPMis) */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Pos (5UL)    /*!< Position of INTKNEPMIS field.                                        */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Msk (0x1UL << USBHSCORE_DIEPINT0_INTKNEPMIS_Pos) /*!< Bit mask of INTKNEPMIS field.    */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Min (0x0UL)  /*!< Min enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_Max (0x1UL)  /*!< Max enumerator value of INTKNEPMIS field.                            */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_INACTIVE (0x0UL) /*!< No IN Token Received with EP Mismatch interrupt                  */
  #define USBHSCORE_DIEPINT0_INTKNEPMIS_ACTIVE (0x1UL) /*!< IN Token Received with EP Mismatch interrupt                       */

