NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* USBHSCORE_DIEPDMA15: Device IN Endpoint DMA Address Register 15 */
  #define USBHSCORE_DIEPDMA15_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA15 register.                                */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA15_DMAADDR_Pos (0UL)      /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA15_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA15_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.    */


/* USBHSCORE_DTXFSTS15: Device IN Endpoint Transmit FIFO Status Register 15 */
  #define USBHSCORE_DTXFSTS15_ResetValue (0x00000C00UL) /*!< Reset value of DTXFSTS15 register.                                */

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS15_INEPTXFSPCAVAIL_Pos (0UL) /*!< Position of INEPTXFSPCAVAIL field.                                */
  #define USBHSCORE_DTXFSTS15_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS15_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DOEPCTL0: Device Control OUT Endpoint 0 Control Register */
  #define USBHSCORE_DOEPCTL0_ResetValue (0x00008000UL) /*!< Reset value of DOEPCTL0 register.                                  */

/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL0_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DOEPCTL0_MPS_Pos) /*!< Bit mask of MPS field.                         */
  #define USBHSCORE_DOEPCTL0_MPS_Min (0x0UL)         /*!< Min enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_Max (0x3UL)         /*!< Max enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE64 (0x0UL)      /*!< 64 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE32 (0x1UL)      /*!< 32 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE16 (0x2UL)      /*!< 16 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE8 (0x3UL)       /*!< 8 bytes                                                              */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL0_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Min (0x1UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_ACTIVE (0x1UL) /*!< USB Active Endpoint 0                                                */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL0_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_INACTIVE (0x0UL) /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DOEPCTL0_NAKSTS_ACTIVE (0x1UL)   /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL0_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Max (0x0UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_ACTIVE (0x0UL)   /*!< Endpoint Control 0                                                   */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL0_STALL_Pos (21UL)        /*!< Position of STALL field.                                             */
  #define USBHSCORE_DOEPCTL0_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL0_STALL_Pos) /*!< Bit mask of STALL field.                   */
  #define USBHSCORE_DOEPCTL0_STALL_Min (0x0UL)       /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL0_STALL_Max (0x1UL)       /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL0_STALL_INACTIVE (0x0UL)  /*!< No Stall                                                             */
  #define USBHSCORE_DOEPCTL0_STALL_ACTIVE (0x1UL)    /*!< Stall Handshake                                                      */

/* CNAK @Bit 26 : Clear NAK (CNAK) */
  #define USBHSCORE_DOEPCTL0_CNAK_Pos (26UL)         /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DOEPCTL0_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_CNAK_Pos) /*!< Bit mask of CNAK field.                      */
  #define USBHSCORE_DOEPCTL0_CNAK_Min (0x0UL)        /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_CNAK_Max (0x1UL)        /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_CNAK_NOCLEAR (0x0UL)    /*!< No action                                                            */
  #define USBHSCORE_DOEPCTL0_CNAK_CLEAR (0x1UL)      /*!< Clear NAK                                                            */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL0_SNAK_Pos (27UL)         /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DOEPCTL0_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL0_SNAK_Pos) /*!< Bit mask of SNAK field.                      */
  #define USBHSCORE_DOEPCTL0_SNAK_Min (0x0UL)        /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_SNAK_Max (0x1UL)        /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL0_SNAK_NOSET (0x0UL)      /*!< No action                                                            */
  #define USBHSCORE_DOEPCTL0_SNAK_SET (0x1UL)        /*!< Set NAK                                                              */

/* EPDIS @Bit 30 : Endpoint Disable (EPDis) */
  #define USBHSCORE_DOEPCTL0_EPDIS_Pos (30UL)        /*!< Position of EPDIS field.                                             */
  #define USBHSCORE_DOEPCTL0_EPDIS_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPDIS_Pos) /*!< Bit mask of EPDIS field.                   */
  #define USBHSCORE_DOEPCTL0_EPDIS_Min (0x0UL)       /*!< Min enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL0_EPDIS_Max (0x0UL)       /*!< Max enumerator value of EPDIS field.                                 */
  #define USBHSCORE_DOEPCTL0_EPDIS_INACTIVE (0x0UL)  /*!< No Endpoint disable                                                  */

/* EPENA @Bit 31 : Endpoint Enable (EPEna) */
  #define USBHSCORE_DOEPCTL0_EPENA_Pos (31UL)        /*!< Position of EPENA field.                                             */
  #define USBHSCORE_DOEPCTL0_EPENA_Msk (0x1UL << USBHSCORE_DOEPCTL0_EPENA_Pos) /*!< Bit mask of EPENA field.                   */
  #define USBHSCORE_DOEPCTL0_EPENA_Min (0x0UL)       /*!< Min enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL0_EPENA_Max (0x1UL)       /*!< Max enumerator value of EPENA field.                                 */
  #define USBHSCORE_DOEPCTL0_EPENA_INACTIVE (0x0UL)  /*!< No action                                                            */
  #define USBHSCORE_DOEPCTL0_EPENA_ACTIVE (0x1UL)    /*!< Enable Endpoint                                                      */


/* USBHSCORE_DOEPINT0: Device OUT Endpoint 0 Interrupt Register */
  #define USBHSCORE_DOEPINT0_ResetValue (0x00000000UL) /*!< Reset value of DOEPINT0 register.                                  */

/* XFERCOMPL @Bit 0 : Transfer Completed Interrupt (XferCompl) */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Pos (0UL)     /*!< Position of XFERCOMPL field.                                         */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Msk (0x1UL << USBHSCORE_DOEPINT0_XFERCOMPL_Pos) /*!< Bit mask of XFERCOMPL field.       */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Min (0x0UL)   /*!< Min enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_Max (0x1UL)   /*!< Max enumerator value of XFERCOMPL field.                             */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_INACTIVE (0x0UL) /*!< No Transfer Complete Interrupt                                    */
  #define USBHSCORE_DOEPINT0_XFERCOMPL_ACTIVE (0x1UL) /*!< Transfer Complete Interrupt                                         */

/* EPDISBLD @Bit 1 : Endpoint Disabled Interrupt (EPDisbld) */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Pos (1UL)      /*!< Position of EPDISBLD field.                                          */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Msk (0x1UL << USBHSCORE_DOEPINT0_EPDISBLD_Pos) /*!< Bit mask of EPDISBLD field.          */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Min (0x0UL)    /*!< Min enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT0_EPDISBLD_Max (0x1UL)    /*!< Max enumerator value of EPDISBLD field.                              */
  #define USBHSCORE_DOEPINT0_EPDISBLD_INACTIVE (0x0UL) /*!< No Endpoint Disabled Interrupt                                     */
  #define USBHSCORE_DOEPINT0_EPDISBLD_ACTIVE (0x1UL) /*!< Endpoint Disabled Interrupt                                          */

/* AHBERR @Bit 2 : AHB Error (AHBErr) */
  #define USBHSCORE_DOEPINT0_AHBERR_Pos (2UL)        /*!< Position of AHBERR field.                                            */
  #define USBHSCORE_DOEPINT0_AHBERR_Msk (0x1UL << USBHSCORE_DOEPINT0_AHBERR_Pos) /*!< Bit mask of AHBERR field.                */
  #define USBHSCORE_DOEPINT0_AHBERR_Min (0x0UL)      /*!< Min enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT0_AHBERR_Max (0x1UL)      /*!< Max enumerator value of AHBERR field.                                */
  #define USBHSCORE_DOEPINT0_AHBERR_INACTIVE (0x0UL) /*!< No AHB Error Interrupt                                               */
  #define USBHSCORE_DOEPINT0_AHBERR_ACTIVE (0x1UL)   /*!< AHB Error interrupt                                                  */

/* SETUP @Bit 3 : SETUP Phase Done (SetUp) */
  #define USBHSCORE_DOEPINT0_SETUP_Pos (3UL)         /*!< Position of SETUP field.                                             */
  #define USBHSCORE_DOEPINT0_SETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_SETUP_Pos) /*!< Bit mask of SETUP field.                   */
  #define USBHSCORE_DOEPINT0_SETUP_Min (0x0UL)       /*!< Min enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT0_SETUP_Max (0x1UL)       /*!< Max enumerator value of SETUP field.                                 */
  #define USBHSCORE_DOEPINT0_SETUP_INACTIVE (0x0UL)  /*!< No SETUP Phase Done                                                  */
  #define USBHSCORE_DOEPINT0_SETUP_ACTIVE (0x1UL)    /*!< SETUP Phase Done                                                     */

/* OUTTKNEPDIS @Bit 4 : OUT Token Received When Endpoint Disabled (OUTTknEPdis) */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos (4UL)   /*!< Position of OUTTKNEPDIS field.                                       */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTTKNEPDIS_Pos) /*!< Bit mask of OUTTKNEPDIS field. */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Min (0x0UL) /*!< Min enumerator value of OUTTKNEPDIS field.                           */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_Max (0x1UL) /*!< Max enumerator value of OUTTKNEPDIS field.                           */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_INACTIVE (0x0UL) /*!< No OUT Token Received When Endpoint Disabled                    */
  #define USBHSCORE_DOEPINT0_OUTTKNEPDIS_ACTIVE (0x1UL) /*!< OUT Token Received When Endpoint Disabled                         */

/* STSPHSERCVD @Bit 5 : Status Phase Received for Control Write (StsPhseRcvd) */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Pos (5UL)   /*!< Position of STSPHSERCVD field.                                       */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Msk (0x1UL << USBHSCORE_DOEPINT0_STSPHSERCVD_Pos) /*!< Bit mask of STSPHSERCVD field. */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Min (0x0UL) /*!< Min enumerator value of STSPHSERCVD field.                           */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_Max (0x1UL) /*!< Max enumerator value of STSPHSERCVD field.                           */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_INACTIVE (0x0UL) /*!< No Status Phase Received for Control Write                      */
  #define USBHSCORE_DOEPINT0_STSPHSERCVD_ACTIVE (0x1UL) /*!< Status Phase Received for Control Write                           */

/* BACK2BACKSETUP @Bit 6 : Back-to-Back SETUP Packets Received (Back2BackSETup) */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos (6UL) /*!< Position of BACK2BACKSETUP field.                                   */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Msk (0x1UL << USBHSCORE_DOEPINT0_BACK2BACKSETUP_Pos) /*!< Bit mask of BACK2BACKSETUP
                                                                            field.*/
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Min (0x0UL) /*!< Min enumerator value of BACK2BACKSETUP field.                     */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_Max (0x1UL) /*!< Max enumerator value of BACK2BACKSETUP field.                     */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_INACTIVE (0x0UL) /*!< No Back-to-Back SETUP Packets Received                       */
  #define USBHSCORE_DOEPINT0_BACK2BACKSETUP_ACTIVE (0x1UL) /*!< Back-to-Back SETUP Packets Received                            */

/* OUTPKTERR @Bit 8 : OUT Packet Error (OutPktErr) */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Pos (8UL)     /*!< Position of OUTPKTERR field.                                         */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Msk (0x1UL << USBHSCORE_DOEPINT0_OUTPKTERR_Pos) /*!< Bit mask of OUTPKTERR field.       */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Min (0x0UL)   /*!< Min enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_Max (0x1UL)   /*!< Max enumerator value of OUTPKTERR field.                             */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_INACTIVE (0x0UL) /*!< No OUT Packet Error                                               */
  #define USBHSCORE_DOEPINT0_OUTPKTERR_ACTIVE (0x1UL) /*!< OUT Packet Error                                                    */

