NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* SUBSCRIBE17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos (17UL) /*!< Position of SUBSCRIBE17 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE17 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE17 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE17 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Disabled (0x0UL) /*!< Subscribe disabled for TASK[17]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE17_Enabled (0x1UL) /*!< Subscribe enabled for TASK[17]                              */

/* SUBSCRIBE18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos (18UL) /*!< Position of SUBSCRIBE18 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE18 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE18 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE18 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Disabled (0x0UL) /*!< Subscribe disabled for TASK[18]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE18_Enabled (0x1UL) /*!< Subscribe enabled for TASK[18]                              */

/* SUBSCRIBE19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos (19UL) /*!< Position of SUBSCRIBE19 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE19 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE19 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE19 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Disabled (0x0UL) /*!< Subscribe disabled for TASK[19]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE19_Enabled (0x1UL) /*!< Subscribe enabled for TASK[19]                              */


/**
  * @brief EVENTS [VPRCSR_NORDIC_EVENTS] DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTS (0x000007E2ul)
  #define VPRCSR_NORDIC_EVENTS_ResetValue (0x00000000UL) /*!< Reset value of EVENTS register.                                  */

/* EVENTS0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Pos (0UL)     /*!< Position of EVENTS0 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS0_Pos) /*!< Bit mask of EVENTS0 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Min (0x0UL)   /*!< Min enumerator value of EVENTS0 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Max (0x1UL)   /*!< Max enumerator value of EVENTS0 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Disabled (0x0UL) /*!< EVENTS[0] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS0_Enabled (0x1UL) /*!< EVENTS[0] enabled                                                  */

/* EVENTS1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Pos (1UL)     /*!< Position of EVENTS1 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS1_Pos) /*!< Bit mask of EVENTS1 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Min (0x0UL)   /*!< Min enumerator value of EVENTS1 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Max (0x1UL)   /*!< Max enumerator value of EVENTS1 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Disabled (0x0UL) /*!< EVENTS[1] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS1_Enabled (0x1UL) /*!< EVENTS[1] enabled                                                  */

/* EVENTS2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Pos (2UL)     /*!< Position of EVENTS2 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS2_Pos) /*!< Bit mask of EVENTS2 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Min (0x0UL)   /*!< Min enumerator value of EVENTS2 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Max (0x1UL)   /*!< Max enumerator value of EVENTS2 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Disabled (0x0UL) /*!< EVENTS[2] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS2_Enabled (0x1UL) /*!< EVENTS[2] enabled                                                  */

/* EVENTS3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Pos (3UL)     /*!< Position of EVENTS3 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS3_Pos) /*!< Bit mask of EVENTS3 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Min (0x0UL)   /*!< Min enumerator value of EVENTS3 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Max (0x1UL)   /*!< Max enumerator value of EVENTS3 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Disabled (0x0UL) /*!< EVENTS[3] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS3_Enabled (0x1UL) /*!< EVENTS[3] enabled                                                  */

/* EVENTS4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Pos (4UL)     /*!< Position of EVENTS4 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS4_Pos) /*!< Bit mask of EVENTS4 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Min (0x0UL)   /*!< Min enumerator value of EVENTS4 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Max (0x1UL)   /*!< Max enumerator value of EVENTS4 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Disabled (0x0UL) /*!< EVENTS[4] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS4_Enabled (0x1UL) /*!< EVENTS[4] enabled                                                  */

/* EVENTS5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Pos (5UL)     /*!< Position of EVENTS5 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS5_Pos) /*!< Bit mask of EVENTS5 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Min (0x0UL)   /*!< Min enumerator value of EVENTS5 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Max (0x1UL)   /*!< Max enumerator value of EVENTS5 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Disabled (0x0UL) /*!< EVENTS[5] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS5_Enabled (0x1UL) /*!< EVENTS[5] enabled                                                  */

/* EVENTS6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Pos (6UL)     /*!< Position of EVENTS6 field.                                           */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Msk (0x1UL << VPRCSR_NORDIC_EVENTS_EVENTS6_Pos) /*!< Bit mask of EVENTS6 field.         */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Min (0x0UL)   /*!< Min enumerator value of EVENTS6 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Max (0x1UL)   /*!< Max enumerator value of EVENTS6 field.                               */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Disabled (0x0UL) /*!< EVENTS[6] disabled                                                */
  #define VPRCSR_NORDIC_EVENTS_EVENTS6_Enabled (0x1UL) /*!< EVENTS[6] enabled                                                  */

