NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN0_Pos (0UL)            /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN0_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN0_Pos) /*!< Bit mask of PIN0 field.                          */
  #define VPRCSR_NORDIC_IN_PIN0_Min (0x0UL)          /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN0_Max (0x1UL)          /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN0_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN0_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN1_Pos (1UL)            /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN1_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN1_Pos) /*!< Bit mask of PIN1 field.                          */
  #define VPRCSR_NORDIC_IN_PIN1_Min (0x0UL)          /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN1_Max (0x1UL)          /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN1_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN1_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN2_Pos (2UL)            /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN2_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN2_Pos) /*!< Bit mask of PIN2 field.                          */
  #define VPRCSR_NORDIC_IN_PIN2_Min (0x0UL)          /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN2_Max (0x1UL)          /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN2_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN2_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN3_Pos (3UL)            /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN3_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN3_Pos) /*!< Bit mask of PIN3 field.                          */
  #define VPRCSR_NORDIC_IN_PIN3_Min (0x0UL)          /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN3_Max (0x1UL)          /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN3_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN3_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN4_Pos (4UL)            /*!< Position of PIN4 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN4_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN4_Pos) /*!< Bit mask of PIN4 field.                          */
  #define VPRCSR_NORDIC_IN_PIN4_Min (0x0UL)          /*!< Min enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN4_Max (0x1UL)          /*!< Max enumerator value of PIN4 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN4_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN4_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN5_Pos (5UL)            /*!< Position of PIN5 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN5_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN5_Pos) /*!< Bit mask of PIN5 field.                          */
  #define VPRCSR_NORDIC_IN_PIN5_Min (0x0UL)          /*!< Min enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN5_Max (0x1UL)          /*!< Max enumerator value of PIN5 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN5_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN5_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN6 @Bit 6 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN6_Pos (6UL)            /*!< Position of PIN6 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN6_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN6_Pos) /*!< Bit mask of PIN6 field.                          */
  #define VPRCSR_NORDIC_IN_PIN6_Min (0x0UL)          /*!< Min enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN6_Max (0x1UL)          /*!< Max enumerator value of PIN6 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN6_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN6_HIGH (0x1UL)         /*!< Pin is High                                                          */

/* PIN7 @Bit 7 : (unspecified) */
  #define VPRCSR_NORDIC_IN_PIN7_Pos (7UL)            /*!< Position of PIN7 field.                                              */
  #define VPRCSR_NORDIC_IN_PIN7_Msk (0x1UL << VPRCSR_NORDIC_IN_PIN7_Pos) /*!< Bit mask of PIN7 field.                          */
  #define VPRCSR_NORDIC_IN_PIN7_Min (0x0UL)          /*!< Min enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN7_Max (0x1UL)          /*!< Max enumerator value of PIN7 field.                                  */
  #define VPRCSR_NORDIC_IN_PIN7_LOW (0x0UL)          /*!< Pin is Low                                                           */
  #define VPRCSR_NORDIC_IN_PIN7_HIGH (0x1UL)         /*!< Pin is High                                                          */

