NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* End field group OUTMODEB. */

/* Field group INMODEB : (unspecified) */
/* MODE @Bits 20..21 : Alias to INMODEB.MODE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Pos (20UL) /*!< Position of MODE field.                                      */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Msk (0x3UL << VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Pos) /*!< Bit mask of MODE
                                                                            field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                         */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_Max (0x3UL) /*!< Max enumerator value of MODE field.                         */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_CONTINUOUS (0x0UL) /*!< Continuous sampling (if CPU is not sleeping)         */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_EVENT (0x1UL) /*!< Sampling on Counter1 event                                */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_SHIFT (0x2UL) /*!< Sampling and shifting on Counter1 event                   */
    #define VPRCSR_NORDIC_SHIFTCTRLB_INMODEB_MODE_SHIFTA (0x3UL) /*!< Sampling and shifting on Counter1 event, independent from
                                                                      output*/

/* End field group INMODEB. */


/**
  * @brief SHIFTCNTIN [VPRCSR_NORDIC_SHIFTCNTIN] Number of frames to be shifted from INB before new data is required
  */
  #define VPRCSR_NORDIC_SHIFTCNTIN (0x00000BCDul)
  #define VPRCSR_NORDIC_SHIFTCNTIN_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCNTIN register.                          */

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Pos (0UL)   /*!< Position of VALUE field.                                             */
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Pos) /*!< Bit mask of VALUE field.      */
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Min (0x00UL) /*!< Min value of VALUE field.                                           */
  #define VPRCSR_NORDIC_SHIFTCNTIN_VALUE_Max (0x3FUL) /*!< Max size of VALUE field.                                            */


/**
  * @brief SHIFTCNTOUT [VPRCSR_NORDIC_SHIFTCNTOUT] Number of frames to be shifted to OUTB before new data is required
  */
  #define VPRCSR_NORDIC_SHIFTCNTOUT (0x00000BCEul)
  #define VPRCSR_NORDIC_SHIFTCNTOUT_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCNTOUT register.                        */

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Pos (0UL)  /*!< Position of VALUE field.                                             */
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Pos) /*!< Bit mask of VALUE field.    */
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Min (0x00UL) /*!< Min value of VALUE field.                                          */
  #define VPRCSR_NORDIC_SHIFTCNTOUT_VALUE_Max (0x3FUL) /*!< Max size of VALUE field.                                           */


/**
  * @brief SHIFTCNTB [VPRCSR_NORDIC_SHIFTCNTB] Buffered SHIFTCNTOUT and SHIFTCNTIN register
  */
  #define VPRCSR_NORDIC_SHIFTCNTB (0x00000BCFul)
  #define VPRCSR_NORDIC_SHIFTCNTB_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCNTB register.                            */

/* VALUE @Bits 0..5 : Value */
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Pos (0UL)    /*!< Position of VALUE field.                                             */
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCNTB_VALUE_Pos) /*!< Bit mask of VALUE field.        */
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Min (0x00UL) /*!< Min value of VALUE field.                                            */
  #define VPRCSR_NORDIC_SHIFTCNTB_VALUE_Max (0x3FUL) /*!< Max size of VALUE field.                                             */


/**
  * @brief OUTTGL [VPRCSR_NORDIC_OUTTGL] GPIO Output Toggle
  */
  #define VPRCSR_NORDIC_OUTTGL (0x00000BD0ul)
  #define VPRCSR_NORDIC_OUTTGL_ResetValue (0x00000000UL) /*!< Reset value of OUTTGL register.                                  */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Pos (0UL)        /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN0_Pos) /*!< Bit mask of PIN0 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Min (0x0UL)      /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_Max (0x1UL)      /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN0_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Pos (1UL)        /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN1_Pos) /*!< Bit mask of PIN1 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Min (0x0UL)      /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_Max (0x1UL)      /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN1_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Pos (2UL)        /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN2_Pos) /*!< Bit mask of PIN2 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Min (0x0UL)      /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_Max (0x1UL)      /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN2_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Pos (3UL)        /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Msk (0x1UL << VPRCSR_NORDIC_OUTTGL_PIN3_Pos) /*!< Bit mask of PIN3 field.                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Min (0x0UL)      /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_Max (0x1UL)      /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                               */
  #define VPRCSR_NORDIC_OUTTGL_PIN3_TOGGLE (0x1UL)   /*!< Pin is toggled                                                       */

