NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lm20a/nrf54lm20a_types.h
/* PIN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_Pos (26UL)     /*!< Position of PIN26 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN26_Pos) /*!< Bit mask of PIN26 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_Min (0x0UL)    /*!< Min enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_Max (0x1UL)    /*!< Max enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN26_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_Pos (27UL)     /*!< Position of PIN27 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN27_Pos) /*!< Bit mask of PIN27 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_Min (0x0UL)    /*!< Min enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_Max (0x1UL)    /*!< Max enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN27_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_Pos (28UL)     /*!< Position of PIN28 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN28_Pos) /*!< Bit mask of PIN28 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_Min (0x0UL)    /*!< Min enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_Max (0x1UL)    /*!< Max enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN28_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_Pos (29UL)     /*!< Position of PIN29 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN29_Pos) /*!< Bit mask of PIN29 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_Min (0x0UL)    /*!< Min enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_Max (0x1UL)    /*!< Max enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN29_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_Pos (30UL)     /*!< Position of PIN30 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN30_Pos) /*!< Bit mask of PIN30 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_Min (0x0UL)    /*!< Min enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_Max (0x1UL)    /*!< Max enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN30_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */

/* PIN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_Pos (31UL)     /*!< Position of PIN31 field.                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_Msk (0x1UL << VPRCSR_NORDIC_OUTBTGL_PIN31_Pos) /*!< Bit mask of PIN31 field.             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_Min (0x0UL)    /*!< Min enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_Max (0x1UL)    /*!< Max enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                             */
  #define VPRCSR_NORDIC_OUTBTGL_PIN31_TOGGLE (0x1UL) /*!< Pin is toggled                                                       */


/**
  * @brief DIRBTGL [VPRCSR_NORDIC_DIRBTGL] Buffered GPIO pin Direction Toggle
  */
  #define VPRCSR_NORDIC_DIRBTGL (0x00000BD3ul)
  #define VPRCSR_NORDIC_DIRBTGL_ResetValue (0x00000000UL) /*!< Reset value of DIRBTGL register.                                */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_Pos (0UL)       /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN0_Pos) /*!< Bit mask of PIN0 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_Min (0x0UL)     /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_Max (0x1UL)     /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN0_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_Pos (1UL)       /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN1_Pos) /*!< Bit mask of PIN1 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_Min (0x0UL)     /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_Max (0x1UL)     /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN1_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_Pos (2UL)       /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN2_Pos) /*!< Bit mask of PIN2 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_Min (0x0UL)     /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_Max (0x1UL)     /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN2_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_Pos (3UL)       /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_Msk (0x1UL << VPRCSR_NORDIC_DIRBTGL_PIN3_Pos) /*!< Bit mask of PIN3 field.                */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_Min (0x0UL)     /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_Max (0x1UL)     /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                              */
  #define VPRCSR_NORDIC_DIRBTGL_PIN3_TOGGLE (0x1UL)  /*!< Pin is toggled                                                       */

